[
{"date": "2019-09-01 16:52", "link": "https://newyork.craigslist.org/que/egr/d/richmond-hill-experienced-architect/6969375572.html", "text": "EXPERIENCED ARCHITECT/ DRAFTER", "compensation": "BASED ON EXPERIENCE", "type": "full-time", "images": [], "address": ["\n        ", "\nLOOKING TO HIRE EXPERIENCED ARCHITECT/ DRAFTER MUST KNOW AND BE ABLE TO DO NYC  ZONING CALCULATIONS,  CODES REVIEW  AND PLAN REQUIREMENTS FOR DOB SUBMITTAL FAMILIAR WITH  DOB PAPERWORK. CLASS TWO DOB ID IS A PLUS. ", "\n", "\nREQUIREMENTS:", "\n- Must have 5-year Bachelor of Architecture degree and minimum 3 years working experience in single family residential design and mixed-use buildings ", "\n- Must have knowledge of NYC zoning and building codes", "\n- Must be able to develop design concepts into a full set of construction drawings independently", "\n- Must be a very organized team player with excellent communication skills. Must feel comfortable/confident to be the liaison between office, clients, contractors and consultants", "\n- Strong AutoCad skills ", "\n- Must be able to manage multiple projects EMAIL YOUR RESUME.    "]},
{"date": "2019-08-08 16:49", "link": "https://newyork.craigslist.org/que/egr/d/construction-project-manager-estimator/6952502629.html", "text": "Construction Project Manager / Estimator", "compensation": "Based on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nJob Description: ", "\n", "\nWe are looking for a Project Manager/Estimator available to directly work for Construction General Contractor's Office. We specialize in Commercial and Residential Renovations. ", "\n", "\nThe Position: Daily Job Duties include: ", "\n", "\nConstruction Contract Administration & negotiations with valued subcontractors for buyout. ", "\nPreparing and ensuring Construction Schedule is met from Permit through signed Punch list.", "\nClose and Warranty work when applicable. ", "\nDirect support and involvement in the Estimating / Quantity Take-off and the Request For Proposal Process including obtaining and Qualifying rec'd proposals is also part of the job.", "\n", "\nThis Project Manager position will require Daily Job Awareness, juggling multiple priorities, organized interaction with the Field representatives and Professional updates with our Special and often Demanding Customers in a very fast paced environment. ", "\n", "\nPersonal Characteristics:", "\nDevelops, maintains and fosters a positive \"can-do\" attitude concerning the job and our company with both customers and fellow employees", "\nInitiates and promotes teamwork concepts.", "\nDevelops, improves and maintains communication skills with others.", "\nDevelops and understands systems of priorities and time management. ", "\nUtilizes time appropriately.", "\nDevelops and initiates improvements to company business methods and practices.", "\nAbility to stay calm during busy hard working stressful periods", "\nFor consideration, please send resume of Project Management Experience specifically regarding detailed Commercial Construction, Scheduling and Estimating abilities to us for review and consideration.", "\n", "\n", "\n*We are an Equal Opportunity Employer", "\n", "\nJob Requirements", "\nSkills & Abilities:", "\nKnowledge of Project Management, estimating and Construction Management software (Timberline, On-Screen Take-Off)", "\nDetailed Take-off organization, accuracy and consistency", "\nKnowledge of Labor output and Labor rates and how they vary by job and location.", "\nKnowledge of material costs and variations caused by time constraints", "\nUnderstand specific and industry-related construction specifications", "\nAbility to cost and price non-standard construction details", "\nDevelop and understand job specific comprehensive Scopes of Work to Schedule accordingly", "\nAbility to foster and promote customer relationships.", "\nStrong Letter Writing skill set", "\nInnovative Problem Solving", "\nExcellent Follow Up Skills", "\n", "\nQualifications:", "\nBachelor's Degree (or equivalent) for Construction Science or related field of study", "\nWorking knowledge of Microsoft Office products; specifically Outlook, Word and Excel", "\nProficiency with reading construction plans, specifications and vendor product data information", "\nFamiliarity with construction project delivery methods and practices    "]},
{"date": "2019-08-28 12:25", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/6966509540.html", "text": "Intermediate Architect", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nNew York based architectural firm is seeking Intermediate Architects for current large-scale projects. Applicants must be available to begin work immediately. We are seeking Project Architects with a minimum of 8 to 10 years of experience in the delivery of detailed construction documents. Proficiency in Autodesk Revit, AutoCad and associated software is required. ", "\n", "\nApplicants must possess excellent technical skills. Applicants will be required to prepare detailed construction document's, attend site meetings and prepare field reports. Experience with current New York City Building Codes.", "\n", "\nWe offer a competitive salary and benefits package commensurate with experience, health insurance, vacation/sick time, disability and paid family leave coverages. ", "\n", "\nInterested candidates please forward a cover letter and resume.    "]},
{"date": "2019-08-03 09:40", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-licensed-superintendent/6948518804.html", "text": "Licensed Superintendent/ Assistant Construction Manager", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nGrowing Construction Management & Consulting Firm seeks Assistant CM in support of multiple High Profile Projects. This is a key position working closely with primary decision makers. Work must be accurate and complete over a range of Construction Management Functions. ", "\n", "\n•\tFast moving and exciting Residential Development and Hospitality Projects in Manhattan.", "\n•\t Collaborators include Top Restaurant Operators, Highly Published Design Firms and Growing Residential Developers.", "\n•\tWork directly with Principal on Overall Project Strategies and Weekly Objectives", "\n", "\nProjects", "\n", "\n•\tTownhouse Single Family Development Projects in Manhattan. Gut Rehabs", "\n•\tCondo Development Projects ", "\n•\tAmenities Space Renovation in Large Downtown Condo Property", "\n•\tHigh Profile Restaurant Projects with Internationally Known Operators", "\n•\tLevels of Design and Finish Ranging from Condo to Very High End", "\n", "\nGeneral Requirements", "\n", "\n•\tD.O.B. Superintendent License", "\n•\tProficiency in Excel", "\n•\tEstimating Experience helpful", "\n•\tExperience in Construction Administration", "\n•\tMust write well.", "\n•\tFluent in Smartsheet or MS Project type Scheduling Programs", "\n•\t Experience in Architecture/ Engineering, Legal or Accounting Fields very helpful.", "\n•\tAble to Manage Information over Multiple Projects", "\n", "\n", "\n Duties ", "\n", "\n•\tSuperintendent’s Log Book Updates", "\n•\tDaily Site Reports", "\n•\tAdministrative Site Meeting Minutes", "\n•\tToolbox Meetings", "\n•\t Submittals and Submittal Log", "\n•\tScheduling of Special Inspections", "\n•\tTrack DOB Required Items for Letter(s) of Completion and C of O", "\n•\tPunch List Administration", "\n", "\nRespond to: silfoxlabor@gmail.com", "\n    "]},
{"date": "2019-08-28 13:17", "link": "https://newyork.craigslist.org/que/egr/d/construction-estimator/6966558357.html", "text": "Construction Estimator", "compensation": "Competitive salary", "type": "full-time", "images": [], "address": ["\n        ", "\nConstruction Estimator/Project Manager", "\n", "\nEstablished NYC based Construction firm seeks self-motivated energetic individual with minimum 10 years' experience to join our team.  ", "\n", "\nDuties Include: Preparing detailed take-offs and estimates, analyzing architectural drawings, developing scope of work, preparing formal proposals, attend meetings and walk throughs, solicit bids from subcontractors and vendors, manage projects, cost control, submittals and scheduling. ", "\n", "\nCandidate must have thorough knowledge of computer programs especially Excel, Word, Planswift and MS Project and possess strong analytical and communication skills with an eye for detail.", "\n", "\nBA/BS in architecture or engineering preferred.  Drawing, sketching and Auto CAD proficiency a plus.", "\n", "\nCompetitive salary and benefits package.", "\n    "]},
{"date": "2019-08-28 11:47", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect/6966474737.html", "text": "Project Architect", "compensation": "Salary commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nGF55 Partners in New York City is looking to hire a Senior Project Architect to work on significant large scale Mixed Use Multi Family Projects in the New York region. The candidate should capable of running a team and interacting with clients and consultants. The work is fast paced, challenging and rewarding.  Our Midtown office provides a collaborative environment with interaction between the senior and junior staff. Our dynamic pipeline of work provides opportunities for true achievement. ", "\n  ", "\nPersonal development is encouraged, and professional growth is supported.  ", "\nCompetitive compensation and benefits provided commensurate with qualifications and experience.", "\n", "\nMinimum requirements:", "\n7-10 years of relevant experience", "\nProfessional Degree ", "\nProficient in Revit, AutoCAD, Bluebeam and Microsoft Office.", "\nLicensed Architects preferred.", "\n ", "\nPlease email your cover letter, resume, and samples of work. ", "\n", "\n    "]},
{"date": "2019-08-03 10:13", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-asst-project-designer/6948541786.html", "text": "Asst Project Designer / Office Manager", "compensation": "Base Salary 55-65k plus overall package", "type": "full-time", "images": [], "address": ["\n        ", "\nAssistant Project Designer / Office Manager at The Renovated Home., which is located at our showroom at 401 East 76th Street, New York, NY 10021.", "\n", "\nPosition Duties:", "\n• Manage all facets of the operations of the office and design studio. Inventory management, supplies, etc.", "\n• Fully involved in all facets of projects underway, coordination with the project designers on staffing and subcontractor", "\non upcoming projects.", "\n• Handle and coordinate all facets of service work for past clients through completion.", "\n• Involvement on scheduling throughout the trades and vendors on all ongoing projects.", "\n• Monitor, organize, shadow and follow up on all emails sent to Our presidents TRH mailbox.", "\n• Continually oversee the vendors and add contractors and sourcing to our team as appropriate and available.", "\n• Liaison with clients as needed.", "\n• Tracking / Scheduling / and coordinating site meetings throughout the project process as well as management of the", "\nproject", "\n", "\nPlease send resume and any pertinent information that might give us a sense of what makes you the ROCKSTAR we are looking for! ", "\n", "\n    "]},
{"date": "2019-08-03 16:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-manager/6948888353.html", "text": "Project Manager - Electrical / Data Construction - Large Firm", "compensation": "Compensation based off of experience", "type": "full-time", "images": [], "address": ["\n        ", "\nCompany Overview: ", "\nWe are a large-scale electrical contractor in NYC.  We are a family owned and operated business.  Our projects include data centers, museums, hotels, Telecom infrastructure, Sports Arenas, and office spaces for some of the leading companies and venues in the New York City area.  ", "\n", "\nAbout The Role: ", "\nWe are looking for a full time Project Manager with 5-20 year's experience.  This position will work under one of the owners of the company.  They will be responsible for their own projects as well as assisting the owner and other Project Managers in all aspects of electrical and communications construction projects to ensure project success.", "\n", "\nIf you have knowledge and experience with Data cable and fiber wiring layout and install please be sure to note on resume.  This is a big plus. ", "\n", "\nJob Function: ", "\n-\tEnsure field supervision has the instruction, material, and support that they need to succeed", "\n-\tAddress client and vendor concerns", "\n-\tProposal preparation and review", "\n-\tRFI preparation and review", "\n-\tSubmittal tracking", "\n-\tMonitor status of projects", "\n-\tContract administration", "\n-\tPrepare billing requests", "\n-\tPrepare basic estimates ", "\n-\tAttend project meetings", "\n-\tConduct and prepare post-project analysis", "\n-\tTake initiative and spear head initiatives to improve business practices", "\n", "\nRequirements: ", "\n-\t5 - 20 years of experience as a project manager in the electrical / communications industry ", "\n-\tProficiency in Microsoft Office", "\n-\tKnowledge of electrical construction", "\n-\tStrong research and sourcing skills", "\n-\tMust be able to manage multiple projects at once. ", "\n-\tDemonstrate excellent verbal and written communication ", "\n-\tTravel to projects within NYC", "\n", "\nPreferred Qualifications: ", "\n-\tHands on electrical construction field experience", "\n-\tCooper and fiber install knowledge", "\n-\tRadio RF cable antenna install knowledge", "\n-\tKnowledge of Blue Beam and AutoCAD", "\n-\tPrior electrical estimating experience", "\n-\tProficient in Google Suite of products ", "\n", "\nThis position has excellent career advancement opportunities.  Most of our project managers have grown with the company since their employment. ", "\n", "\nAdditional Information: ", "\nWe are located in Long Island City Queens. Easily accessible by the 7, N,W,R,E,M, and F train. ", "\n", "\n    "]},
{"date": "2019-08-04 13:28", "link": "https://newyork.craigslist.org/que/egr/d/flushing-structural-engineer/6949345885.html", "text": "Structural Engineer", "compensation": "The salary is based on level of experience.", "type": "full-time", "images": [], "address": ["\n        ", "\nJob Description:", "\n", "\nWe are currently seeking structural engineers at multiple levels to join our team. As a structural engineer, you will work with other team members in our highly collaborative environment to assure that designs are developed in accordance with appropriate codes and standards, quality control objectives are achieved, and project goals are met within the schedule and budget. This is an outstanding opportunity for a structural engineer to work on a variety of high-profile projects throughout the region. ", "\n", "\nDuties and Responsibilities:", "\n", "\n- Coordinate with architects, contractors, owners, and other engineers from the initial planning stages through final construction.", "\n- Determine design criteria using relevant codes and standards.", "\n- Analyze and/or prepare models and calculations for various structural elements and systems by using various software and/or hand calculations.", "\n- Develop contract documents, including construction drawings and technical specifications", "\n- Produce schematic and detailed designs and evaluation of planning and concept alternatives", "\n- Review shop drawings, RFI's.", "\n- Perform field inspections and write inspection reports.", "\n", "\nSkills and Qualifications:", "\n", "\n- Familiar with latest version of AutoCAD, Revit, ETABS, SAP2000, SAFE, RAM, Excel.", "\n- Excellent verbal and written communication skills", "\n- Ability to effectively work independently and collaboratively in a team environment", "\n- Must be eligible to work in the United States", "\n", "\nEntry Level Candidates:", "\n- Bachelor’s degree in Civil or Structural Engineering.", "\n", "\nIntermediate Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 3+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n", "\nAdvance Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 8+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n- NYS PE License", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-04 05:37", "link": "https://newyork.craigslist.org/lgi/egr/d/melville-bookkeeper/6949137095.html", "text": "BOOKKEEPER", "compensation": "Salary", "type": "full-time", "images": [], "address": ["\n        ", "\nGeneral Contracting firm is looking or a full time bookkeeper. Candidates need to have a basic knowledge of accounting and quickbooks. Bachelor's degree is a plus, 2 years experience preferably in the construction industry.", "\nTo apply please send your resume and requirements.", "\n", "\n", "\n    "]},
{"date": "2019-08-05 08:44", "link": "https://newyork.craigslist.org/lgi/egr/d/east-setauket-draftsmen/6949802220.html", "text": "Draftsmen", "compensation": "Based Upon Experience", "type": "full-time", "images": [], "address": ["\n        ", "\nDraftsman - Must be highly skilled in architectural, millwork, and cabinet shop drawing.  Must have a high level of experience on CAD.  Must work well with others.  Well established, high-end, architectural, millwork, and cabinetry company located in the Port Jefferson area of Long Island looking for draftsman.  This is a job in our office.  We are not looking for outside freelancers.  Please send resume and examples of your work. ", "\n", "\n    "]},
{"date": "2019-08-05 09:05", "link": "https://newyork.craigslist.org/que/egr/d/fresh-meadows-office-field-assistant/6949814443.html", "text": "Office & Field Assistant (Flushing)", "compensation": "Competitive salary and benefits.", "type": "full-time", "images": [], "address": ["\n        ", "\ncompensation: Competitive salary and benefits.", "\nemployment type: full-time ", "\nLand Surveying firm looking for Office & field assistants.", "\nTraining can be provided for potential candidates.", "\nCollege Grads with computer skills a plus for training.", "\nKnowledge of AutoCad, Carlson Surveying an asset.", "\nNYS Driver's license Reqiured", "\nMust be authorised to work in the USA", "\n", "\nCandidates must be available to start immediately. Motivated individuals are encouraged to apply.", "\n    "]},
{"date": "2019-08-05 09:11", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-engineer/6949818068.html", "text": "Project Engineer", "compensation": "Determined by experience", "type": "full-time", "images": [], "address": ["\n        ", "\nERS is an energy engineering and consulting firm specializing in the assessment and implementation of energy efficiency, renewable energy, and sustainability programs. For over 20 years, ERS has been leading efforts to promote a healthy economy and environment by guiding business, industry, government, and utilities in the efficient use of resources and the advancement of sustainable practices throughout the US. ", "\n", "\nWe are currently seeking Project Engineers for our offices in Connecticut, Maine, Massachusetts, and New York. Successful candidates will have knowledge of energy systems, energy efficiency, renewable energy, and sustainable practices for commercial and industrial facilities. Experience in efficiency program administration, project management, and measurement and verification of energy-related projects is highly desirable. ERS Project Engineers will be responsible for the following: ", "\n", "\n\tConducting and/or directing site surveys ", "\n\tOverseeing the deployment of instrumentation such as power meters and data loggers to measure equipment energy performance", "\n\tPerforming engineering analyses of efficiency measures", "\n\tPreparing comprehensive reports with detailed analytical findings", "\n\tProviding technical assistance to facility owners and operators ", "\n\tConducting technical review and assessment of energy-related projects", "\n\tConducting customer education and outreach on behalf of our utility clients", "\n\tSupporting energy efficiency program efforts including design, development, and delivery services", "\n", "\nCandidates must have excellent communication, writing, and computer skills and be able to work closely with customers, vendors, and efficiency program administrators. A bachelor's degree in Mechanical Engineering, Energy Engineering, or related field is required; certification as an Engineer-in-Training or CEM, or a master’s/advanced degree, is preferred. ", "\n", "\nERS offers a competitive salary commensurate with experience and background, a comprehensive benefits package, and an excellent opportunity for growth. Our company is committed to making a positive contribution to society, and we provide a hardworking yet casual work environment that encourages individual initiative. Learn more about ERS at www.ers-inc.com.", "\n", "\nTo be considered for the position of Project Engineer, please email your resume to recruiting@ers-inc.com. Include a cover letter explaining your interest in working for ERS in the field of energy engineering. Please include the ERS location(s) you are applying for.", "\n", "\nERS is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex (including pregnancy, sexual orientation, and gender identity), national origin, citizenship, disability, protected veteran status, or any other protected class. In addition to federal law requirements, ERS complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. ERS expressly prohibits any form of workplace harassment based on any protected class.", "\n    "]},
{"date": "2019-08-05 09:42", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-designer-sales-must-have/6949839443.html", "text": "Designer + Sales - Must have experience with 20/20", "compensation": "Salary & commission", "type": "full-time", "images": [], "address": ["\n        ", "\nWe are a Kitchen & Bathroom design company with a friendly atmosphere, featuring top national brands and an award-winning designer showroom. We consistently provide the best design and service in the kitchen & Bathroom business, and are currently seeking an experienced individual to join our team of design professionals. ", "\n", "\nResponsibilities include: ", "\nAccurate translation of rough measures into working designs under tight deadlines ", "\nAssisting sales team with management of client accounts ", "\nManaging design process, from initial layout to final order ", "\nMaintaining a positive attitude and staying organized under pressure ", "\n", "\nThe desired applicant will have: ", "\nPrevious kitchen & Bathroom design experience, with portfolio examples ", "\nMust have experience working at a design/construction company specializing in bathroom and kitchen renovation ", "\nMust have experience with material selection", "\nMust have experience with 20/20, Knowledge of AutoCAD and similar interior design programs ", "\n", "\nExperience in resolving problems that arise on-site during installation ", "\nA detail-oriented, organized disposition ", "\nExcellent written and verbal communication skills ", "\n", "\nA minimum of 3 years in a related profession is required, as is knowledge of Microsoft programs and Windows. This is an immediate opening. ", "\n", "\nYou may contact us via email. When applying please enter \"Kitchen & Bath Designer Position\" as the subject of the email and paste resume into body of email.", "\n", "\nWe are looking to fill this position immediately. Only serious candidates need apply", "\n", "\nThank you for your interest, and best of luck.", "\n    "]},
{"date": "2019-08-05 10:21", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-top-expediting-firm/6949870518.html", "text": "Top Expediting Firm- Immediate Full time Openings- Excellent Benefits", "compensation": "DOE", "type": "full-time", "images": [], "address": ["\n        ", "\nTop Expediting Firm- Immediate Full time Openings- Excellent Benefits (Midtown West)", "\n", "\nOutsource is the leading provider of Building Code and Zoning Consultation, offering a broad scope of services that includes Approvals, Permit Expediting, and Sign Offs. Outsource prides itself on unparalleled expert representation to architects, engineers, building owners, building managers, attorneys, and contractors. Our encyclopedic knowledge of the Municipal Building Codes and Zoning Laws that regulate construction enables us to navigate projects efficiently and quickly through the application, approval, and sign off processes. The final result is the successful completion of all our projects and absolute customer satisfaction.", "\n", "\nWe have immediate openings for the following: ", "\n", "\n•\tSign Off Coordinator", "\n•\tTechnical Project Manager", "\n•\tAccounting Clerk", "\n", "\nAwesome team-oriented work environment and company benefits package.", "\n", "\nCompany Perks:", "\n", "\n- Paid vacation and personal days", "\n- Paid Holidays ", "\n- Health, Dental, Vision Insurance", "\n- 401K", "\n- Company funded HRA", "\n- Bonus opportunities", "\n", "\n- Chance to grow with a dynamic expediting firm who works with elite clients.", "\n", "\n", "\nThis is a fast-paced position that demands an organized, diligent, and detail-oriented candidate.", "\nSuccessful candidates must be self-motivated (punctual), able to work well in an entrepreneurial environment and be a team player. Equal Opportunity Employer M/F/D/V", "\n", "\nPlease apply on our careers page:", "\n", "\n", "    "]},
{"date": "2019-08-05 12:55", "link": "https://newyork.craigslist.org/mnh/egr/d/draftsperson-detailer/6950017014.html", "text": "Draftsperson Detailer", "compensation": "tbd", "type": "full-time", "images": [], "address": ["\n        ", "\nStore/events Display props and wood cabinetry manufacturing company seeking motivated and responsible individual to fill the position of Draftsperson Detailer. Must be experienced with the process of producing client drawings and production drawings.", "\n", "\n", "\nMust be experienced and proficient in 3D rendering.", "\n", "\nExperience in creating CNC files required. ", "\n", "\n", "\nMust also be skilled with drafting decorative patterns, intricate millwork", "\nand heavily sculpted three dimensional elements for production. ", "\n", "\n", "\n", "\nCandidate must be familiar with materials such as solid wood, plywood,", "\nplastic, metal fabrication and veneer work. ", "\n", "\n", "\nMust submit portfolio with application, no candidate without portfolio will be considered!", "\n", "\n", "\n", "\nHours are Monday through Friday 8:30 AM - 5:30 PM and must be available for overtime, working until 8:30 PM and weekends at times.", "\n•\tPrincipals only. Recruiters, please don't contact this job poster.", "\n•\tdo NOT contact us with unsolicited services or offers", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-05 15:33", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-senior-interior-designer/6950172567.html", "text": "Senior Interior Designer/Project Manager - Home Studios", "compensation": "COMPETITIVE SALARY/MEDICAL/DENTAL/VISION", "type": "full-time", "images": [], "address": ["\n        ", "\nHome Studios (homestudios.nyc) is currently hiring a Senior Interior Designer/Project Manager to work with our design team. Home Studios is an interior design studio focusing primarily on hospitality projects. As a studio, we are inspired by detail, materials, history, and building processes. We are a young firm that is quickly growing so opportunities are vast for the right applicant. Applicants must be passionate and collaboratively-inclined.", "\n", "\nSCOPE OF WORK:", "\n", "\n-MANAGE LARGE SCALE PROJECTS ", "\n-PROJECT POINT OF CONTACT FOR SELECT PROJECTS", "\n-CREATE DESIGN WITH DESIGN DIRECTOR", "\n-OVERSEE DESIGN TEAM, SET AND MAINTAIN WEEKLY PROJECT GOALS WITH DESIGNERS", "\n-INITIAL APPROVAL ON ALL DELIVERABLES FOR SELECT PROJECTS", "\n-SET AND MAINTAIN WEEKLY PROJECT GOALS WITH DESIGN DIRECTOR", "\n-COORDINATION WITH ARCHITECT AND CONTRACTOR", "\n-CREATE SCHEMATIC PLANS, MODEL, ID SET AND CUSTOM DRAWINGS", "\n-DESIGN ITERATION FOR APPROVAL OF DESIGN DIRECTOR", "\n-BUILD SCHEDULE WITH PROJECT MANAGER", "\n-DIGITAL MATERIAL INPUT FOR RENDERINGS", "\n-DESIGN PROCESSES, PROCEDURES, AND DELIVERABLES", "\n-CONSTRUCTION ADMINISTRATION", "\n", "\n", "\nRequirements: ", "\n4-6 years of relevant experience ", "\nHighly motivated and passionate about design and/or architecture ", "\nARCHITECTURE OR INTERIOR ARCHITECTURE BACKGROUND PREFERRED ", "\nExtremely organized and detail oriented ", "\nProblem solver ", "\nTeam player and enjoy working collaboratively ", "\nHave construction knowledge or enthusiasm for learning about construction and building methods", "\n", "\nSoftware requirements (highly proficient): AutoCad, Sketchup, Adobe Creative Suite, Google Docs (Sheets)", "\n", "\nPlease send the following to careers@homestudios.nyc:", "\nShort paragraph on your background, interests, and goals", "\nResume - attachments only", "\nPortfolio - attachments only", "\nInstagram/blog", "\n3 Professional references", "\nWho is your favorite designer and why?", "\n", "\nNOTE: International candidates must hold a valid US working permit.", "\n    "]},
{"date": "2019-08-05 17:17", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-energy-engineer/6950264745.html", "text": "Energy Engineer", "compensation": "110,000 to 140,000", "type": "full-time", "images": [], "address": ["\n        ", "\nThe Energy Engineer - Energy Practice is responsible for the quality, integrity, and profitability of a subset of the larger Energy Practice at our firm. As the direct supervisor to a subset of engineering & project management staff at our company, the Energy Engineer- Energy Practice plays a critical role in managing day-to-day operations of a subset of the Energy Practice while also contributing to the general strategic direction of the Practice.", "\n", "\n", "\nManagement Responsibilities", "\n", "\nDirect supervisor to a subset of engineers & project managers (6-8) within the Energy Practice", "\n", "\nProject/staff resourcing – utilize existing tools to monitor and track total project load relative to staff resources, develop and contribute to new tools as necessary", "\n", "\nSupport in new hiring decisions and candidate interviews", "\n", "\nResponsible for on-boarding of engineers & project managers and oversight of continuing professional development", "\n", "\nHelp to inform & refine pricing methodologies for engineering & energy management services and proposals", "\n", "\nServe as arbiter for internal staff conflicts or resourcing issues", "\n", "\nRepresent our firm as a thoughtful  leader in energy efficiency industry", "\n", "\nResponsible for disseminating the Energy Practice ethos to staff", "\n", "\nManagement of staff time-tracking, employee analysis & consistent feedback", "\n", "\nResponsible for Objective and Goal setting for all engineers, conduct performance reviews", "\n", "\nOversee and contribute to Engineering & Energy Management-related product development", "\n", "\nInterface with clients to support business development and client satisfaction", "\n", "\n", "\n", "\nRequisite Experience", "\n", "\n• Bachelor’s Degree in related Engineering field, preferably Mechanical or Electrical, or related field", "\n", "\n• 5+ years of direct management experience of technical staff", "\n", "\n• 6+ years of energy engineering experience (including energy auditing, retro-commissioning, ongoing commissioning, and/or new commissioning projects) with direct experience managing multiple projects concurrently", "\n", "\n• Advanced quantitative skills, with strong knowledge of Microsoft Excel", "\n", "\nFull Benefits, Salary, Vacation, Bonuses, Flexible Schedule", "\n    "]},
{"date": "2019-08-06 05:41", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-administrator-assistant/6950541297.html", "text": "Administrator/ Assistant Project Manager and Office Manager", "compensation": "Submit salary requirements", "type": "employee's choice", "images": [], "address": ["\n        ", "\nAdministrator/ Assistant Project Manager and Office Manager", "\n", "\n", "\nSmall general contracting company looking for a versatile worker to help with office management and assistant project management. Experience maintaining a small office is preferred, but a willingness to learn new skills related to the business is crucial. We are seeking someone with excellent verbal and written communication skills who can easily communicate messages to coworkers and is confident using professional front-facing language when speaking with clients. Applicants should have a working knowledge of Adobe Acrobat Pro, Microsoft Word and Excel, Microsoft Outlook, and QuickBooks for minor bookkeeping.", "\n", "\nDuring busy periods we will need extra support in project management, and an ideal candidate can follow through with tasks from start to finish.", "\n", "\nPlease include salary requested", "\nNotary Public a plus but not mandatory", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-06 07:17", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-freelance-sketchup/6950556587.html", "text": "Freelance Sketchup Designer - Immediate hire", "compensation": "TBD", "type": "part-time", "images": [], "address": ["\n        ", "\nMcCARTAN is seeking immediate experienced Sketchup Designer for our NYC office.", "\n ", "\nResponsibilities include:", "\n- Working on Interior Architecture for hotels and hi-rise living towers", "\n", "\nRequirements include:", "\n- In depth understanding of building material and systems", "\n- Min 5+ years of experience in the preparation of construction documents, with work samples demonstrating such experience.", "\n- High proficiency in AutoCAD, Revit, SketchUp & 3D rendering programs", "\n- Able to effectively and clearly communicate with other members of the project team", "\n- Fully proficient in all ADA & building codes", "\n", "\nNote:", "\n- PLEASE DO NOT RESPOND IF YOU CANNOT FULFILL OR PROVE THE ABOVE REQUIREMENTS", "\n- When emailing portfolio keep attachments small and consolidate files into one package.", "\n- We thank all candidates for their interest, however only those candidates selected for an interview will be contacted", "\n- US residents only as this is for immediate hire", "\n    "]},
{"date": "2019-08-06 08:40", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect-drafter/6950583726.html", "text": "ARCHITECT / DRAFTER", "compensation": "Salary & Bonus - Based on Qualification", "type": "part-time", "images": [], "address": ["\n        ", "\nBusy Design and Consulting firm is looking for a talented individual to join our team.", "\n", "\nOur work includes renovations and ground ups of small, medium and large scale single and multi-family residential, commercial, community facility and mixed-use projects. ", "\n", "\nResponsibilities will include production of design development and construction documents, Candidates must be self-motivated, reliable and able to manage all aspects of a project.", "\n", "\nCandidate Qualifications:", "\nBe familiar with NYC codes and zoning.", "\nKnowledge of construction materials, details and methods.", "\nProficiency in Revit and AutoCAD.", "\n", "\nWe are looking for highly motivated individuals who are willing to take on responsibility and grow with our team. Interested applicants must be quick to learn and adapt new drawing methods, related zoning & code rules, DOB and related agency requirements. detail-oriented, collaborative, and eager to take on challenges", "\n", "\nQualified individuals should submit a *brief description of your qualifications, *work samples, *starting salary requirements, in pdf or word format    "]},
{"date": "2019-08-06 09:27", "link": "https://newyork.craigslist.org/que/egr/d/flushing-architect-drafts-person/6950609383.html", "text": "Architect drafts person", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nLOOKING TO HIRE FULL TIME ARCHITECT/ DRAFTS PERSON, WITH KNOWLEDGE OF NYC ZONING CALCULATIONS, BUILDING CODES, AND PAPER WORK REQUIREMENTS FOR DOB SUBMITTAL. ", "\n", "\nREQUIREMENTS:", "\n- Must have Bachelor of Architecture degree - 1-2 years working experience in single family residential design and mixed-use buildings (Community Facility is a plus)", "\n- Must be able to develop a full set of construction drawings independently", "\n- Must be a very organized and have excellent communication skills. ", "\n- Strong AutoCad skills", "\n- Revit skills is a plus", "\n- Must be able to manage multiple projects and communicate back to clients and contractors ", "\n", "\nEMAIL YOUR RESUME.", "\n    "]},
{"date": "2019-08-06 11:15", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-stone-estimator-needed/6950695485.html", "text": "Stone Estimator needed for at trendy LIC firm! APPLY TODAY!!", "compensation": "Commenstruate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nA growing Marble & Stone distributing and fabrication company is looking for a Stone Estimator to work with our team of Architects and Engineers and convert designs into technical plans. Stone Drafter responsibilities include gathering drawings and specifications, calculating material and equipment requirements and setting up production methods. If you have hands-on experience with computer-aided design (AutoCAD) software and are familiar with building processes, we’d like to meet you.", "\n", "\nResponsibilities:", "\n", "\nLiaise with architects and engineers to gather product and structural requirements and designs", "\nCalculate dimensions, weight limitations and requirements in materials", "\nDescribe production methods step-by-step (including equipment and software types to be used)", "\nCreate detailed designs with computer-aided design (AutoCAD) software", "\nDesign diagrams, maps and layouts to illustrate workflow", "\nPrepare and review rough sketches and review them along with the engineering team", "\nIdentify potential operational issues and redesign layouts to improve functionality", "\nEnsure final designs comply with regulations and project specs", "\nCreate manuals that describe existing products’ operation and maintenance plans using AutoCAD", "\nWork from rough sketches and specifications created by engineers and architects", "\nHelp design & draft products with engineering and manufacturing techniques", "\nCreate drawings from architectural & engineering documents, following project specifications", "\nPrepare multiple versions of designs for review by engineers and architects", "\nSpecify dimensions, materials, and procedures for projects", "\n", "\n", "\nRequirements:", "\nProven work experience as a Stone and Marble Estimator or similar role", "\nHands-on experience with computer-aided design (AutoCAD) software", "\nFamiliarity with 3D modeling tools", "\nGood math skills", "\nAbility to meet deadlines", "\nExperience in stone/construction field, preparing & planning large scale projects using AutoCAD, Planswift, etc.", "\n", "\nQualifications:", "\nBachelor’s degree from an accredited University", "\n3 years of Stone estimating experience", "\nA detail-oriented approach to tasks", "\nA natural problem-solver", "\nStrong industry research skills    "]},
{"date": "2019-08-06 16:01", "link": "https://newyork.craigslist.org/que/egr/d/woodside-rhonda-feinman-custom-frames/6950967891.html", "text": "Rhonda Feinman Custom Frames are looking to hire Sander & Supervising", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nRhonda Feinman Custom Frames was founded in 2001 with the goal of providing the finest quality custom made picture frames for the fine art trade. Our frames are featured in renowned museums, galleries and private collections. ", "\n", "\nRhonda Feinman Custom Frames are looking to hire Sander & supervising sanding department", "\n", "\nRequirement ", "\n", "\n* furniture sanding and finishing or auto body repair 6month experience", "\n* Experience with spray painting, compressor operation and maintenance", "\n", "\nIn order to apply and be considered for the position, interested candidates must attend a screening interview recruitment event ", "\n", "\n Date & Time: 8/9/2019 10:00am to 3:00pm", "\n Location: 41-17 Main St, Flushing, NY 11355 (3rd Floor)", "\n", "\n Please be dressed professionally and ready for an interview", "\n", "\n Ask for Maha at the front desk. ", "\n", "\n Don’t miss this great opportunity!", "\n    "]},
{"date": "2019-08-06 17:40", "link": "https://newyork.craigslist.org/mnh/egr/d/architect-intermediate/6951050978.html", "text": "Architect, Intermediate", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nTribeca office seeks intermediate Architect for work including new commercial and residential construction.  This is a great opportunity for professional growth with exposure to all aspects of architectural practice.  Candidate must be knowledgeable, with good communication skills, and must be willing and able to take on responsibility.  Vectorworks a plus.", "\n", "\nSend resume, portfolio less than 3MB, availability, salary requirements    "]},
{"date": "2019-08-06 18:28", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-engineer/6951087639.html", "text": "Project Engineer (Structural/Civil) - Immediate Hire!", "compensation": "$150,000", "type": "contract", "images": [], "address": ["\n        ", "\nNYC Engineering & Architecture firm specializing in restoration projects is seeking a full-time PE for immediate hire for 4-6 week duration with experience in fire damage properties.", "\n", "\nRequirements/Skills:", "\n", "\nProfessional Engineer (Civil/Structural) in NYS", "\nExperience with fire damaged buildings", "\nKnowledge of NYC historical construction types in various sized residential and commercial buildings", "\nExperience with shoring design and installation", "\nExperience and confidence in working in potentially structurally hazardous spaces where your safety and the safety of others is incumbent on your sole discretion. (No spaces or situations should be entered into if unsafe, but this will be determined by you as the experienced structural engineer)", "\nExperience and confidence in working in in potentially environmentally hazardous spaces with proper PPE and in conjunction with environmental consultants (mold, ACM)", "\nResponsibilities:", "\n", "\nCoordinate with Lead PE in developing and overseeing stabilization/demolition plan", "\nproviding direction to owner’s contractor to stabilize, shore, and remove portions structure damaged by fire", "\nparticipate in interagency meetings with OEM, DOB, FDNY, NYPD, HPD, etc.", "\nJob Type: Contract", "\n", "\nSalary: $150,000.00 /year    "]},
{"date": "2019-08-07 08:55", "link": "https://newyork.craigslist.org/mnh/egr/d/oswego-architectural-model-maker/6951350374.html", "text": "ARCHITECTURAL MODEL MAKER", "compensation": "based on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nCompany: KMCA Location: New Haven, CT ", "\nJob Description", "\nKMCA, Inc., one of the nation’s most sophisticated and advanced model-making studios, is seeking both entry level or experienced model makers to join its team. ", "\n", "\nIf you have experience in architectural and/or engineering model making, proficiency in CAD/CAM software, experience in project management, skill in laser cutting and 3D printing, knowledge in CNC milling, we want to talk to you.   ", "\n", "\nVisit our website KMCA.com to learn more and see projects from around the world. ", "\n", "\n    "]},
{"date": "2019-08-07 09:40", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-manager-for-busy/6951378496.html", "text": "Project Manager for Busy Design-to-Build Reno Co.", "compensation": "75k-125k DOE", "type": "full-time", "images": [], "address": ["\n        ", "\nBusy Design-to Build renovation company looking for mid to upper level project manager.", "\nMUST be able to oversee jobs throughout NYC, supervise, and report to CEO.", "\nMUST have experience performing alterations in Co-ops, Condos, and houses.", "\nMUST be college grad.", "\nAble to start immediately.    "]},
{"date": "2019-08-07 10:54", "link": "https://newyork.craigslist.org/que/egr/d/construction-estimator/6951437011.html", "text": "Construction Estimator", "compensation": "Competitive salary", "type": "full-time", "images": [], "address": ["\n        ", "\nConstruction Estimator/Project Manager", "\n", "\nEstablished NYC based Construction firm seeks self-motivated energetic individual with minimum 10 years' experience to join our team.  ", "\n", "\nDuties Include: Preparing detailed take-offs and estimates, analyzing architectural drawings, developing scope of work, preparing formal proposals, attend meetings and walk throughs, solicit bids from subcontractors and vendors, manage projects, cost control, submittals and scheduling. ", "\n", "\nCandidate must have thorough knowledge of computer programs especially Excel, Word, Planswift and MS Project and possess strong analytical and communication skills with an eye for detail.", "\n", "\nBA/BS in architecture or engineering preferred.  Drawing, sketching and Auto CAD proficiency a plus.", "\n", "\nCompetitive salary and benefits package.", "\n    "]},
{"date": "2019-08-07 11:12", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-freelance-draftsperson-for/6951453705.html", "text": "Freelance Draftsperson for Fine Art Studio", "compensation": "Compensation to commensurate with experience.", "type": "part-time", "images": [], "address": ["\n        ", "\nLeo Villareal Studio is a fine art studio specializing in the creation of highly-refined LED and video artwork. The studio designs, prototypes, and assembles museum quality electronic artworks that are installed on both domestic and architectural scales.  We are looking for a freelance draftsperson with immediate availability to assist our team. ", "\n", "\nQUALIFICATIONS: ", "\n", "\n- 5 years experience in architectural technical design or product design.  Design experience must include taking real world projects from concept to creation", "\n", "\n- 2D drafting in Rhino, some geometrical 3D object modeling required ", "\n", "\n- Photoshop, Illustrator, or InDesign required ", "\n", "\n- Ability to work in our Brooklyn studio 3 days per week for the duration of the project", "\n", "\nApplication Instructions:", "\n", "\nPlease send us your resume  along with work examples including pdf’s of design drafting in Rhino (pdf’s of drafting in other CAD programs are acceptable so long as the applicant is capable of producing equivalent quality of work in Rhino).  ", "\n", "\n    "]},
{"date": "2019-08-07 11:26", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-dob-filing-representative/6951466451.html", "text": "DOB Filing Representative- Freelance", "compensation": "TBD", "type": "contract", "images": [], "address": ["\n        ", "\nJob Description", "\nFiling Representative needed to file DOB Architectural filing set and certificate of correction in Manhattan NY.", "\n", "\nMust have Class 1 or 2 Filing Representative License.", "\n", "\nRESPONSIBILITIES:", "\n", "\nDOB (Department of Buildings)", "\n", "\n1. Pre-filing and E-filing for job filings (ALT 1, 2, 3, Demo, PA)", "\n2. DOB Now Build", "\n3. DOB Now Safety", "\n4. DOB Now Inspections:", "\nSchedule Construction, Plumbing, Electrical inspections", "\nDelegate pertinent parties", "\nDownload Pass - Final Reports and submit for sign-off", "\nUpload corrections for certifiable objections", "\n5. DOB Permits PW 1, PW 2, PW 3, PW4, After hour variances", "\n6. Site Safety Plans", "\n7. Records Room research: microfilm, block and lot, folder", "\n8. Post Approval Amendments", "\n9. Violations (AEU2, AEU20, Dismissals, Waivers)", "\n10. Stop Work Orders, Partial Stop Work Orders", "\n11. Obtain New DOB Tracking Number for Contractors and insurance updates", "\n12. Required Items submission", "\n13. Letter of Completions", "\n14. Temporary and Final Certificates of Occupancy", "\n15. Schedule and attend Plan Examiner appointments to obtain approvals", "\n16. Attend Chief Plan's examiners meetings with Architects, Engineers, Developers, Property Managers", "\n17. Attend meetings with Deputy Borough Commissioners", "\nDOT (Department of Transportation)", "\n", "\n1. DOT Permits: Sidewalk, Fire Hydrant, Curb Cut", "\nECB (Environmental Control Board)", "\n1. Attend ECB hearings", "\n2. Process penalty payments", "\n", "\nTOPO (Topographical Bureau)", "\n", "\n1. Street Address Verification", "\nDOF (Department of Finance)", "\n", "\n1. Tax Maps", "\n", "\nFDNY (Fire Department of the city of New York)", "\n", "\n1. Submit applications", "\n2. Obtain Building Profiles, Notices of Violation and Violation Orders", "\n3. Attend appointments", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-07 12:31", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-remotely-estimator/6951528495.html", "text": "Remotely Estimator Construction Carpenter  WANTED", "compensation": "Compensation will be commensurate with experience.", "type": "part-time", "images": [], "address": ["\n        ", "\nConstruction company requires remotely  estimator. ", "\n", "\nResponsibilities:", "\nThe Estimator will perform take-offs, pricing and bidding of construction projects. Review construction design drawings/blue prints & specifications, gathers all material and data necessary to determine scope of work & organize a construction cost estimate", "\nUse of On Screen Take Off software to review construction drawings and provide clear detailed quantity takeoffs", "\nMaintain file of working documents as back-up for estimating database, including current information on prices ", "\n", "\nExperience:", "\nProficiency with MS Word, Excel and Estimating Software  OST", "\nExperience in the field ", "\nMinimum of 2 years in the construction industry is a must", "\n", "\n ", "\n", "\n", "\n", "\n", "\n ", "\n", "\nPlease submit your resume with E-mail and contact number    "]},
{"date": "2019-08-07 12:59", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-senior-architectural/6951555810.html", "text": "Senior Architectural Designer", "compensation": "based upon experience", "type": "full-time", "images": [], "address": ["\n        ", "\nWe are a High End Residential Interior Design Firm in Manhattan expanding our architecture department and looking to fill a Senior Architectural Designer position. Ideal candidate must have 7-10 years of residential experience.", "\n", "\nQualifications include:", "\n-Degree in Architecture", "\n-Excellent verbal and written communication skills", "\n-Excellent organizational and time management skills", "\n-Capable of managing several projects simultaneously", "\n-Extreme proficiency in AutoCAD", "\n-Construction administration experience", "\n-Custom furniture design experience a plus", "\n-Experience in producing Construction Documents including detailing and millwork", "\n-Experience in NYC building codes and DOB filing processes", "\n-Currently living in the NYC area and eligible for work in the US", "\nFull Time position offers annual salary and benefits. ", "\n", "\nQualified candidates should send their resume in PDF form", "\n    "]},
{"date": "2019-08-07 20:23", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-coordinator/6951915328.html", "text": "Project Coordinator / Intermediate Architect", "compensation": "Commensurate with experience and criteria indicated.", "type": "full-time", "images": [], "address": ["\n        ", "\nIn our small Midtown Manhattan office environment, every team member works directly with the principal--and gains exposure to all aspects of architectural and interior design practice. Our portfolio reflects diverse projects that range from ground-up development and corporate interiors to brownstones, restaurants, and places of worship. ", "\n", "\nWe're looking to hire a technically adept Intermediate Architect capable of assuming some project management responsibilities. The role will require the following skill set and characteristics:", "\n", "\n4 -- 6 years of experience and strong technical skills (design and drawing).", "\nProficiency in Revit design and production. ", "\nStrong written and oral communication skills.", "\nSelf-motivated, dedicated, detail-oriented, adaptable, and efficient.", "\nSite survey and construction documentation experience.", "\nSome flexibility to put in extra hours when needed.", "\nKnowledge of New York City zoning codes, building codes, and DOB permit application process desirable.", "\nBachelor's degree in Architecture. ", "\n", "\n    "]},
{"date": "2019-08-08 11:17", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-manager-corporate/6952202896.html", "text": "Project Manager - Corporate Interiors - Revit", "compensation": "negotiable with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nKPA, a New York City based architecture and design firm, is looking for a Corporate Interiors Project Manager. We seek talented, energetic and passionate team members for career opportunities in our Corporate Interiors Studio. We have a passion for quality in our products and services, our clients and our people. We seek candidates who not only have the skill sets to efficiently produce and deliver great projects  but also the willingness and initiative to create better ways of servicing our clients while contributing to the growth and success of our teams and our firm. ", "\n", "\nThe Project Manager will lead a team and may also require independent design and production work under the guidance of senior management. Prior experience as a team leader, project management, and construction administration, with strong technical design background is required.", "\n", "\nThe Project Manager requires strong leadership and communication skills with expertise in Workplace / Corporate Interiors projects. Monitors and tracks project progress and is responsible for overall project performance and profitability. Responsible for the building and maintaining of client relationships and managing the client’s project expectations. Has excellent technical knowledge and management skills and is able to plan, direct and monitor all aspects of projects. Is involved with the project production and will coordinate several concurrently. Possess strong drive, motivation and self-initiative. Communicates and coordinates project requirements with the project team and consultants. Adheres to company policies and can mentor staff members. Reports to the Senior Project Manager, Director, and/or Principal.", "\n", "\nExperience and Qualifications:", "\n", "\nMinimum 7 years’ related experience in Architecture and Design Services.", "\nB. Architecture or Interior Design degree required.", "\nPrevious experience in workplace / corporate interior projects preferred.", "\nStrong leadership skills and ability to manage teams effectively and proficiently.", "\nExperienced managing multiple projects simultaneously.", "\nManage all phases from schematic design thru construction administration.", "\nKnowledge of building systems, building codes, ADA, and DOB filing requirements.", "\nProficiency with Revit, AutoCAD, Sketch up, and other 3D design modeling software.", "\nProficiency with Adobe Products, Photoshop, Illustrator, and InDesign.  ", "\nProficiency with MS office suite, MS Project, Bluebeam, and other software.", "\nMaintain and implement client and company drawing and service standards.", "\nStrong management, organizational, technical, and interpersonal skillsets.", "\nProficiency in communication, both written and verbal.    "]},
{"date": "2019-08-08 12:09", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-structural-engineer/6952250856.html", "text": "Structural Engineer-Construction", "compensation": "over $100,000, exact amount depends on qualifications and experience, plus full medical insurance plus vacation, plus holidays, plus 401(k)", "type": "full-time", "images": [], "address": ["\n        ", "\nMetropolitan New York City construction contractor specializing in scaffolding, sidewalk bridge, and personnel hoists is looking for a structural engineer with BS or BE degree to design scaffolding, sidewalk bridge, and personnel hoist installations for our contracts. Current New York PE and 10 years experience is necessary. CAD experience is also required.", "\nYou will work with an experienced team of construction professionals in a good environment. The work is very interesting and rewarding for an innovative and practical engineer. Annual compensation is over $100,000, for the candidate with the right qualifications and experience. We also offer full medical ins., vacations, holidays, and 401(k) plan, etc.", "\nIf this opportunity interests you, please send your resume to the email address listed below, or call 718-889-1888. You can also fax your resume to 718-889-1888    "]},
{"date": "2019-08-09 08:59", "link": "https://newyork.craigslist.org/lgi/egr/d/bellmore-plumbing-mechanic-technician/6952836543.html", "text": "Plumbing Mechanic / Technician for Immediate Hire", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nBusy Plumbing & Heating Service Company looking for experienced, hardworking and punctual Plumbing Mechanic / Technician for immediate hire. The plumbing mechanic / technician will be responsible for all aspects of the installation, maintenance & repair of existing plumbing systems and heating systems in both our residential & commercial clients. This is a great opportunity for the right person! We offer competitive salary & consistent long-term work. Experienced & qualified individuals who are looking to be appreciated, compensated for their skills and knowledge are encouraged to apply.", "\n", "\nWe specialize in repairs, installations and rough plumbing for: house lifts and new constructions, faucets, fixtures, water heaters, boilers etc.", "\n", "\nPlumbers / mechanics / heating mechanics / technicians must have a minimum of 3 years’ experience and outstanding references. Must know how to use tools of the trade; i.e. run a sewer machine. MUST be able to communicate well in English (both written and orally), have a clean driver’s license, reliable transportation and a positive attitude. ", "\n", "\nAbility to speak and understand Spanish, Russian or Hebrew as a second language is a plus but not required. ", "\n", "\nPlease email your resume and references for consideration. Those who submit emails without a resume and references will NOT be considered.  This is not an assistant or JR Plumbers position; experience is 110% required.", "\n    "]},
{"date": "2019-08-09 10:20", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-intermediate-project/6952891884.html", "text": "INTERMEDIATE PROJECT ARCHITECT", "compensation": "Salary plus healthcare benefits", "type": "full-time", "images": ["https://images.craigslist.org/00j0j_ctv8IY2B9M9_600x450.jpg", "https://images.craigslist.org/00707_2ohiyJZd4NU_600x450.jpg", "https://images.craigslist.org/00R0R_3x7GTRi5u4s_600x450.jpg", "https://images.craigslist.org/00g0g_5muTB0fTtyo_600x450.jpg", "https://images.craigslist.org/00505_b1sgX3jtE3k_600x450.jpg"], "address": ["\n        ", "\nFor 27 years, Joseph Vance Architects has been designing high end, custom residential projects - brownstone/townhouse gut renovations, lofts, rooftop additions and conversions of manufacturing buildings to residential. We are a small group of creative problem solvers with a taste for well-crafted design. We value hard work to continuously grow and evolve, pushing boundaries until a project is the best it can be.", "\n", "\nCurrent projects include a ground up new 6 story townhouse in the Upper West Side (with a new basketball court beneath), a gut renovation of a townhouse in Chelsea including a totally new facade, a 6,000sf triplex in a new West Village development, and others.", "\n", "\nWe are currently seeking an Intermediate Project Architect to join our ranks.", "\n", "\nAs a member of our team, you will manage your own projects under the direction of the principal, and with the support of the office as needed to help meet deadlines. The format of our firm is such that everyone is expected to run his/her own jobs - generating designs, presentations and drawings, researching codes, managing schedules, and coordinating with clients, contractors, expeditors, city agencies, vendors, consultants, etc. throughout the entire process of the project from initial client meetings to punch-list closeout. The nature of our business requires immense organization, efficiency, and commitment, but we also maintain a very stable work/life balance.", "\n", "\nIdeally you have experience in residential architecture in NYC, some knowledge of NYC DOB and LPC, have worked with 3D modeling/BIM software and the adobe creative suite. We also expect you to have a great design sensibility and critical thinking skills, along with 4-8 years of professional experience.", "\n", "\nIf this sounds like you, then please submit a pdf of your cover letter, resume, and work sample. This is a full time salaried position with medical coverage (no part-time or freelance work). We look forward to hearing from you and appreciate your interest in our firm!", "\n", "\nThis is a full time salaried position with benefits (no part-time or freelance positions). Qualified candidates are currently living in the tri-state area and should submit a resume, work samples and salary requirements via .pdf.", "\n    "]},
{"date": "2019-08-09 10:48", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-freelance-interior-designer/6952914363.html", "text": "Freelance Interior Designer", "compensation": "To be discussed", "type": "contract", "images": [], "address": ["\n        ", "\nMARKZEFF is currently seeking a talented, responsible, ambitious FREELANCE Senior Interior Designer for immediate full-time employment to work on high-end hospitality design. We are looking for a sharp individual who is detail-oriented, and who likes to experiment with new ideas and materials. The candidate must be equally able to take direction and work independently as needed while being fully accountable for all project assignments. They will also need to be team-spirited, willing not only to listen but also contribute to a creative design dialogue. Curiosity, discernment, resourcefulness, and drive are important.", "\n", "\nPersons interested must also have the following requirements:", "\n", "\n*Must be able to work in our Brooklyn office*", "\n5+ years of hospitality experience with a Bachelor's degree in Interior Design or related field.", "\nProject management & FFE selection & purchasing experience required.", "\nSite/fieldwork experience. Experience in construction. ", "\nPosition includes managing all phases of the design process including schematic, design development, FFE selections, FFE purchasing, and generating & maintaining project budgets for highly customized hi-end residential projects. ", "\nFull knowledge of FFE specifications selection, furniture drawings, specification documentation & submittals is required. ", "\nStrong presentation skills are necessary.", "\nStrong written & verbal communication skills.", "\nA keen eye and attention to detail. ", "\nMust be highly motivated with a strong work ethic.", "\nMust have the ability to work autonomously, manage various projects effectively and follow up.", "\nMust have strong time management skills and the ability to remain flexible while multi-tasking.", "\nAbility to work on short time frames and complete projects on tight schedules. ", "\nOrganizational skills with a proven ability to complete successful projects on time and within budget. ", "\nMeeting deadlines is a must.", "\nMicrosoft Office(Word, Excel, Outlook), Photoshop, Adobe Professional/Nitro, CAD. ", "\nSpexx & 3D Max preferred, but not required. ", "\nAdministrative skills required. ", "\nInterest and aptitude to work in an extremely fast-paced office culture.", "\n", "\n***THIS IS FOR A FREELANCE/CONTRACT ROLE ONLY. Must be authorized to work in the US. Tri-state candidates only - no international / out-of-area applicants***    "]},
{"date": "2019-08-09 11:15", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-director-of-engineering/6952938225.html", "text": "Director of Engineering (Restaurant/Hotel)", "compensation": "$75K-90K + generous benefits package", "type": "full-time", "images": [], "address": ["\n        ", "\nApply Now: ", "\n", "\nThe Head Engineer will be responsible for maintaining the entire building and all its systems in order to ensure the safety of guests, staff members, vendors, patrons and diners. They will be the main point person to provide support for the service and operations teams, enabling them to offer an exceptional experience for all guests and visitors every day.", "\n", "\nThe ideal candidate for this role is a true problem solver, and enjoys assisting colleagues and helping all departments succeed. This is a leadership position, and candidates must be a passionate contributor to the success of the Hotel on a day to day basis.", "\n", "\nThe Head Engineer must possess great communication skills and a positive and optimistic approach. They will be able to balance multiple projects and a range of priorities on any given day, and will have a deep foundation of general building systems knowledge and experience.", "\n", "\nPrimary Responsibilities", "\n", "\nThe Head Engineer is responsible for every aspect of the building infrastructure and the hands on maintenance of all building systems.", "\nThey will perform and manage preventative maintenance programs on all equipment and systems within the organization.", "\nThey will manage the Engineering team. This includes; scheduling, training, and mentoring to ensure the team is friendly, efficient and committed to the hotel’s success.", "\nThey will maintain maintenance inventory and requisition parts and supplies as needed.", "\nThey must communicate and prioritize all repairs, maintenance, upgrades, changes, and additions to systems within the building.", "\nThey will track and be responsible for deadlines on all projects and report to Ownership and Department Heads.", "\nAll projects, maintenance and repairs will be managed in a clean and efficient manner to ensure best results.", "\nThey will continuously build relationships with maintenance vendors and equipment and materials suppliers and work with Accounting Department to ensure best pricing for best quality service.", "\nDaily, they will respond and attend to guest and Manager repair requests.", "\nThey must maintain compliance with all governing agencies, FDNY, DOH, DOB etc. Manage programs to maintain compliance and stay up to date on all required testing and reporting and training.", "\nThey will keep the Hotel in top notch shape; all public spaces and rooms must be clean and well presented at all times. All BOH spaces must be clean and organized at all times.", "\nIn addition, this organization is a 24 – 7 – 365 business. The Head Engineer must be available to take emergency calls and be able to respond quickly to assist in resolving issues and supporting staff at any time.", "\n Experience Required", "\n", "\nProven experience successfully managing and leading a team of employees.", "\nHotel-related Engineering experience is preferred.", "\nExperience and a high level of competence with HVAC, Electrical, Plumbing, Boiler, Cooling Tower, Elevator operations, Sump Pumps and other building related systems.", "\nExperience with and willingness to take a hands-on approach to all these responsibilities.", "\nSummary", "\n", "\nThe Lead Engineer is a vitally important role. They must set up other departments to be successful every day, which requires a commitment to address a multitude of repairs, problems, operational issues, and concerns with a positive approach, flexibility and patience. Balancing the goal of efficiency while working within a 24 -7 operating business presents challenges that can only be overcome with thoughtful plans, which are well prioritized and supported and executed.", "\n", "\nPlease respond with cover letter and resume.", "\n", "\nEEO.", "\n", "\nApply Now: ", "    "]},
{"date": "2019-08-09 13:52", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-goshow-architects-seeks/6953090381.html", "text": "Goshow Architects seeks Project Managers to join our team in New York", "compensation": "DOE", "type": "full-time", "images": [], "address": ["\n        ", "\nDoes the practice of architecture excite you?  Are you an architect who thrives on helping your co-workers to achieve their best?  Are you looking to have an impact on a team of smart, talented, and super fun people?  And if so, we want to meet you! ", "\n", "\nGoshow Architects is a women-owned small business dedicated to public design for the public good. With a wide range of city, state, and federal clients, Goshow has a portfolio of high-quality public sector projects. ", "\n", "\nWe are seeking a licensed design professional with a passion for leadership, collaboration, and mentoring to join our team as a Project Manager.", "\n", "\nProject Managers oversee the design, production and administration of multiple and/or complex projects.  ", "\n", "\nProject Managers are directly responsible both to the client and the firm for successful execution of the project. ", "\n", "\nEqually as important, this person will lead multi-generational project teams and therefore must be a great communicator and fun person to be around.", "\n", "\nNOTE: We are looking for candidates licensed in the U.S. with Public Sector architecture experience.", "\n", "\nQualifications:", "\n", "\nRegistered Architect in the U.S.", "\nProfessional degree in Architecture", "\n5 - 20 years of hands-on project management experience through all phases of design and construction.", "\nThorough knowledge of architectural design, drafting, detailing, building materials, building codes, construction techniques and costs.", "\nKnowledge of AutoCAD, basic knowledge of Revit, to be able to oversee projects being completed using BIM.", "\nProven experience in effectively leading a project team.", "\nStrong analytical, oral and written communication skills with the ability to build quick rapport with all levels of employees, clients, consultants and vendors.", "\n**Local candidates within the NYC metro and surrounding region only**", "\n  ", "\n", "\n ", "\nTo apply, e-mail your cover letter, resume and work samples to jobs@goshow.com.  Please put PROJECT MANAGER in the subject line.    "]},
{"date": "2019-08-09 14:02", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-goshow-architects-seeks/6953099967.html", "text": "Goshow Architects seeks Project Architects to join our team in New Yor", "compensation": "DOE", "type": "full-time", "images": [], "address": ["\n        ", "\nAre you an architect who thrives on helping your coworkers and clients to achieve their best? Are you looking to have an impact on a team of smart, talented, and super fun people? Are you looking to strike the perfect balance between professional and personal obligations and aspirations? If so, we want to meet you!", "\n", "\nGoshow Architects is a women-owned small business dedicated to public design for the public good. With a wide range of city, state, and federal clients, Goshow has a portfolio of high-quality public sector projects.", "\n", "\nOur Project Architects are intermediate level design professionals who act as assistant team leaders responsible for both technical and design aspects of our projects. They develop high-quality design and construction documents through hands-on work and delegation of both in-house staff and consultants. Strong leadership skills and the ability to multitask are important qualities for our Project Architects.", "\n", "\nDESIRED EXPERIENCE", "\n", "\n5+ years of experience in Architecture office (2-3 years minimum preparing construction documents)", "\nExperience in developing and designing complex & custom details and following them through the construction phase.", "\nExperience developing, organizing, and exercising quality control over drawings and drawing sets", "\nExperience with consultant coordination and ability to recognize deficiencies in consultant-provided content .", "\nExperience conducting material research and meeting vendors to understand materials and products.", "\nExperience “redlining” drawings and delegating production work while being conscious of project deadlines, fees, and contractual obligations.", "\nExperience with oversight and mentorship of junior-level staff.", "\nExperience organizing and leading site visits and field surveys.", "\nDESIRED SKILLS / EDUCATION / CERTIFICATIONS", "\n", "\nProfessional degree in Architecture Required (B.Arch or M.Arch)", "\nStrong communication & organization skills", "\nStrong time management skills", "\nAdvanced knowledge of AutoCAD and Revit", "\nStrong understanding of NYC/NYS codes and NYC zoning regulations", "\nStrong knowledge of building construction, materials, and systems", "\nLicensed Architects preferred, licensure candidates will be considered", "\nLEED Accredited Preferred", "\nPublic sector experience required", "\n ", "\nTo apply, e-mail your cover letter, resume and work samples to jobs@goshow.com.  Please put Project Architect in the subject line.    "]},
{"date": "2019-08-09 14:12", "link": "https://newyork.craigslist.org/mnh/egr/d/freelance-intermediate-architects-revit/6953109967.html", "text": "Freelance INTERMEDIATE Architects (REVIT)", "compensation": "Commensurate with experience level", "type": "contract", "images": [], "address": ["\n        ", "\nMy company is looking for Freelance Intermediate level Architects (3-7 yrs exp) with excellent REVIT skills.", "\n", "\nThis is for full-time, CONSULTING, on-site work.", "\n", "\nThe range of projects is varied (Interiors, Healthcare; Hospitality; Education; Residential; Urban Masterplan etc...) and will run from 2several weeks to 6 months+ in duration.", "\n", "\nThis is for a high-end NYC design firm. If this is of interest to you please respond and we can arrange an interview. Work can start immediately.", "\n", "\nPlease respond with HOURLY RATE and RESUME and portfolio if available in PDF.", "\n", "\nSKILLS:", "\n* Revit - Excellant skills.", "\n* Acad - a plus", "\n* PhotoShop - a plus", "\n    "]},
{"date": "2019-08-09 16:38", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-mechanical-engineer/6953239813.html", "text": "Mechanical Engineer - Plumbing", "compensation": "salary with generous benefit package commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nIMMEDIATE NEED for an experienced Senior Plumbing Designer Engineer with a minimum of eight years of experience in Plumbing and Fire Protection systems.  Proficiency in AutoCAD; Revit desired.  Experience creating plans, schematics and equipment selection.  The successful candidate will have the opportunity to lead the Plumbing/MEP design scope on a wide range of projects.  Contact Alexandra or Josh ASAP!!!    "]},
{"date": "2019-08-09 16:45", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-structural-engineer-bridge/6953245877.html", "text": "Structural Engineer - Bridge Design", "compensation": "salary with generous benefit package commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nIMMEDIATE NEED for two Structural Engineers with ten years or more of experience.  Specific experience in bridge design, tunnel design, building design and airport design and planning.  Proficient CAD user, particularly with Microstation. Bachelor of Science in Civil/Structural Engineering. Please call Josh or Alexandra ASAP!!!", "\n    "]},
{"date": "2019-08-09 16:46", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6953246223.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 3 to 7 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-09 16:47", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-project/6953247643.html", "text": "Facade / Building Envelope Project Architect", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\n", " ", "\n\n", " New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled project architect with 5-10 years’ relevant experience to join us in executing a growing slate of challenging projects. ", " \n", " ", "\nWe’re proud to be an industry leader in crucial practice areas like facade inspections and repairs (Local Law 11), roof repairs, and investigation and remediation of structural issues. We've won numerous awards—including ten Lucy Moses preservation awards—as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", " \n", "\nAbsolutely. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer applications that integrate construction drawings, specifications, cost estimating, scheduling, and construction administration; advanced photography and image processing; and state-of-the-art, non-destructive diagnostic equipment and techniques. In fact, we have an in-house studio dedicated to such supporting technology, constantly developing new digital tools (think James Bond’s “Q”). ", "   .\n\n", " ", "\nHonestly, we offer aspects of both. You’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This gives you the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. ", " \n", "\nYou’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n", "\nAn array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks. ", " \n", " ", "\nWe embrace all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. ", " \n", "\n\nWe offer an array of benefits and growth opportunities:", "\n", "\n", "\n", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away.", "\n\n", "\n\nSend us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or a link to your portfolio that demonstrates your experience and capabilities. We look forward to meeting you! ", "\n\nPlease note that, due to the high number of applicants, we can only contact candidates under consideration. ", "  \n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-09 17:22", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-nyc-dobarchitectural/6953276247.html", "text": "NYC DOB_Architectural Services- filing set_ Freelancer", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nArchitectural Services- filing set_ Freelancer\\Independent Contractor", "\n", "\nWe are seeking an Architectural Associate/CAD drafter to create NYC DOB filing sets for commercial renovations, specifically Restaurant projects primarily in Manhattan.", "\n", "\nRESPONSIBILITIES:", "\n• Survey existing and as-built conditions on sites located throughout the NYC area", "\n• Create Architectural Drawings and Construction Documents (Alteration Type 1 and Type 2)", "\n• Zoning Analysis and Diagrams", "\n• Drawing existing and proposed sections and elevations", "\n• Update drawing sets based on NYC Plan Examiner Objections", "\n• Prepare DOB filing set packages and coordinate with Expediter to file with Department of Buildings.", "\n", "\nPosition is an independent contractor/ freelancer    "]},
{"date": "2019-08-09 17:40", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-nyc-dob-expeditor-project/6953290511.html", "text": "NYC DOB Expeditor Project Manager Filing Representative", "compensation": "Based upon experience and knowledge", "type": "full-time", "images": [], "address": ["\n        ", "\nNYC DOB Class 1 or 2 Full time or nothing if you can prepare applications.", "\n", "\nWe service only Manhattan and Brooklyn applications. ", "\n", "\nSalary based upon experience. MUST know DOB BIS, NOW and HUB online filings and how jobs are structured and filed. Must know the processes,,,", "\n", "\nMust know document preparation, must be familiar with filing necessary agency forms. PW1, PW2, SCH B, SCH A, etc. From owners info to permit you need to know the process.", "\n", "\nCandidate must be competent to understand filing processes and be able to accomplish things on their own. ", "\n", "\nSearch words DOB, DOT, ECB, HPD FDNY , PERMITS, EXPEDITING, MANAGER,  EXPEDITOR, FILING, VIOLATION, DEPARTMENT OF BUILDINGS, CLASS 1 , CLASS 2  ", "\n", "\nSalary $40,00 to $60,000,,, 5 paid SICK days + National holidays.", "\n", "\nIf you don't know what your doing don't apply. You will be tested during your interview.    "]},
{"date": "2019-08-09 21:05", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-freelance-for-small/6953418593.html", "text": "Freelance for Small Architecture Firm", "compensation": "depends on experience", "type": "contract", "images": [], "address": ["\n        ", "\nSmall architecture firm needs some help with drafting in CAD, Revit, and preparation of forensic reports.", "\nPlease submit drafting, writing samples and portfolio if available.", "\nWork directly with the two principals and learn building design and forensic concepts. ", "\nMaster Degree-Level students in their last semesters preferred.", "\nVisit our website at www.maytasebastian.com for general project information.", "\nPlease respond with resume and salary/hourly fee information.", "\n3 easy requirements: please be hard working, humble and honest.    "]},
{"date": "2019-08-10 14:36", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-designer/6953845885.html", "text": "Architect/Designer", "compensation": "Compensation commensurate with experience", "type": "full-time", "images": ["https://images.craigslist.org/01111_gaz8wvs7ByI_600x450.jpg", "https://images.craigslist.org/00g0g_jDYofhdlyZr_600x450.jpg", "https://images.craigslist.org/00x0x_b0YNtzeGhjW_600x450.jpg", "https://images.craigslist.org/00l0l_ba9tKkfF3fQ_600x450.jpg", "https://images.craigslist.org/01010_9yRW0bTI4Ba_600x450.jpg", "https://images.craigslist.org/01111_3rdGpKVfJwx_600x450.jpg", "https://images.craigslist.org/00M0M_bg31Pw2wAox_600x450.jpg", "https://images.craigslist.org/00l0l_jiZu8SEJy6A_600x450.jpg", "https://images.craigslist.org/00t0t_dD1efPwvANu_600x450.jpg"], "address": ["\n        ", "\nWe are an established and awarded small architectural firm located in Manhattan. Our projects cover public buildings and educational facilities. We are looking to hire talented individuals who have the potential and ambition for growth towards positions in office leadership.", "\nOur office organization enables staff members a hands-on experience. Working on multiple projects and different phases of work, including design, construction documents and job administration. Our transparent office environment provides exposure to all aspects of the practice.", "\nQualifications:", "\n•\tBe a US citizen or be permitted to work in the USA", "\n•\tProfessional degree in Architecture", "\n•\tSkill in Autocad and presentation software. Revit capability a plus.", "\n•\tUSA experience in design, detailing and construction administration.", "\n•\tVerbal and writing abilities.", "\nWork description:", "\n•\tParticipate in the design and production of multiple projects at all design and project administration phases.", "\n•\tAttend site meetings and prepare minutes. Observe and document progress and quality of construction work.", "\n•\tCommunicate with in-house staff, consultants and clients.", "\n•\tDemonstrate skill in the use of drafting and presentation software.", "\n", "\nWe offer competitive salaries, health coverage and profit sharing.", "\nInterested candidates should email a cover letter, resume, work samples and requested compensation in PDF format.", "\n    "]},
{"date": "2019-08-10 12:45", "link": "https://newyork.craigslist.org/wch/egr/d/mount-kisco-architect-engineer-cad/6953747764.html", "text": "Architect / Engineer / CAD Operator", "compensation": "Health Insurance, 401K, Bonus", "type": "full-time", "images": [], "address": ["\n        ", "\nTwo positions available in a very busy Westchester based firm that is seeking a self-motivated individual, with a background in high rise exterior building restoration. We specialize in Local Law 11/98 inspections/reports, façade, balcony, roof, terrace, plaza, and sidewalk vault restoration projects. This is a full time position, not interested in freelance or part time workers.", "\n", "\nOur projects are mainly located in the 5 Boroughs of NYC, therefore A CAR IS REQUIRED, as well as a valid driver's license.", "\n", "\nPosition 1: Recent Graduate or Senior Project Manager w/ Architectural / Engineering Degree with Auto CAD Experience or ", "\n", "\nPosition 2: A self-motivated NYS Licensed Architect (RA) or Licensed Engineer (PE) with a background in high rise exterior building restoration.", "\n", "\nThe positions require evaluating Exterior Facade Conditions from Suspended Scaffolds, designing and preparing construction documents, structural restoration design, daily site visits to review the active work being performed. Proficient in MS Word is required and ACAD is a plus. ", "\n", "\nSalary Expectations \"must\" be included    "]},
{"date": "2019-08-10 16:29", "link": "https://newyork.craigslist.org/fct/egr/d/landscape-designer-architect-landscape/6953936006.html", "text": "Landscape Designer/Architect - Landscape sales", "compensation": "Based on experience and skill. Excellent benefit program", "type": "full-time", "images": [], "address": ["\n        ", "\nElise Landscape Design Group", "\n", "\nLandscape Sales professional and landscape designer/architect to join our team. We design and build creative, integrated landscape plans for high-end residential clients.", "\n", "\nCandidates should have a proven record in residential landscape sales with the ability to present and communicate to a sophisticated client base. Autocad or equivalent software abilities a plus. Designing and selling landscapes with style for the high-end residential market key!", "\nApplicants with a landscape design background and exterior design are appropriate for this position.", "\n", "\nYou'll find us in New Canaan in an attractive work environment with an exceptional benefits, salary and retirement package.", "\n", "\nInterested candidates should forward resumes and letter of interest.", "\n", "\nThe Elise Design Group and Elise Landscapes & Nursery is an established award winning Landscape Design and Build firm serving the greater Fairfield and Westchester County areas. Our company provides high quality, innovative landscape design, construction and maintenance services as well as retailing landscape plantings, unique garden elements and furnishings.", "\n", "\nPosition Requirements:", "\nMinimum of 5 years, high-end residential landscape sales experience", "\nDegree in Landscape Design/Architecture/interior design preferred", "\nThe ability to present and communicate design concepts clearly to a sophisticated client base.", "\nProficiency with landscape design software and related office software", "\nGeneral knowledge of permitting and zoning processes", "\nDesire to grow professionally", "\n", "\n    "]},
{"date": "2019-08-11 06:35", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-residential-interior/6954196837.html", "text": "Residential Interior Designer+Project Manager w/10 min 10 yrs exp", "compensation": "Weekly high paying commission-per each active project. Range from 55k to 90k", "type": "full-time", "images": [], "address": ["\n        ", "\nResidential Interior Designer+Project Manager- NYC Co-op, Condo and house Renovations", "\n", "\nThe job requires experience designing and managing residential interior renovations ranging from complete home and apartment interiors to combining units to  kitchens and baths. Also requires proficiency in either SketchUp, Autocad, 20/20 or other design software. An essential component of the job will be excellent and frequent communication with the client, The ideal candidate will know how to maintain good rapport with clients and be experienced enough to trouble-shoot and resolve problems quickly.", "\n", "\nDesign sales work will include meeting our clients at their home/apartment and subsequently, designing, writing work scopes, meeting and guiding clients through product selections at our and other product showrooms. Creating products lists. Ongoing support. After that, project management work will include scheduling, daily site visits, coordinating and supervising trades and product deliveries, client interactions, timely completions. You'll be running the project as the head of our team.", "\n", "\nHours include some evening and weekend appointments.", "\n", "\nReal opportunities for advancement!", "\nWe are growing fast and are have a great location.", "\n", "\n", "\nCompensation: High commission based-paid as a steady weekly income. Also phone reimbursement, $200 monthly general reimbursement and potential bonuses.", "\n", "\nemployment type: full-time", "\n", "\nSmall, reputable midtown Manhattan-based residential interior remodeling firm is looking for professional, personable Designer/Project Managers with a minimum of 10 years in residential renovation/interior design AND at least 5 years of project management experience. We are looking for Designer-project Managers who can design, sell and manage full individual Co-op and Condo apartment/house interior and kitchen/bath renovation projects. Min 6 years on-site field experience, including at least 12 projects in Manhattan or other major city and able to supervise the trades in the field. Prefer NYC resident or within 45 minutes commute.", "\n", "\nOur projects range in price from 40k to 600k+.", "\n", "\nWe make it much easier for homeowners to have work done. We design the rooms, shop with clients for the products, order and then renovate complete apartment and house interiors, kitchens and bathrooms for individual owners of coops, condo apartments and townhouses in the mid-to-high end range.    "]},
{"date": "2019-08-11 13:45", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-junior-architect/6954397480.html", "text": "Junior Architect", "compensation": "Salary is competitive and based on experiences/skill level.", "type": "full-time", "images": ["https://images.craigslist.org/00Z0Z_kPuaJ3XILbL_600x450.jpg", "https://images.craigslist.org/00a0a_8EarV7vWnN7_600x450.jpg", "https://images.craigslist.org/00606_idM3Zmx2PWJ_600x450.jpg", "https://images.craigslist.org/01313_eTLbVNkJTz6_600x450.jpg", "https://images.craigslist.org/00C0C_if8k10Wo1jf_600x450.jpg", "https://images.craigslist.org/00i0i_1Fjbqqn8OT2_600x450.jpg"], "address": ["\n        ", "\nJunior Architect Position", "\n", "\nMelamed Architect is an Architectural and design practice located in Chelsea specializing in multi-family residential buildings, mixed use, offices and interiors. The position involves contributing to the design, document coordination and management of projects from Schematic Design through Construction Administration. We are seeking a talented, and self-motivated individual to join this team. ", "\n", "\nResponsibilities:", "\n•\tInvolvement in multiple projects at all project phases", "\n•\tDevelop aspects of schematic and design development documents and manage coordination with project consultants", "\n•\tProduce construction documentation sets and details in AutoCAD", "\n•\tProduce quality 3D images using AutoCAD and Rhino, of exteriors and interiors", "\n•\tSite surveying", "\n•\tParticipate in team meetings", "\n•\tSite visits during construction", "\n", "\nRequirements:", "\n•\t2-3 years of full-time professional experience from a NYC architecture firm", "\n•\tBArch or MArch from an accredited school", "\n•\tAbility to work independently on all design phases", "\n•\tKnowledge of construction methods and materials related to multi-family is a plus", "\n•\tKnowledge of NYC zoning and building code is a plus", "\n•\tExperience with facade design and CD's is a plus", "\n•\tHighly proficient with AutoCAD, Rhino, Sketch Up, Photoshop, InDesign, Illustrator, MS Word, and MS Excel.", "\n•\tStrong graphic, written and verbal communication skills.", "\n", "\nGreat opportunity for experience, growth and exposure to all aspects of Architectural/Interior practice.", "\nSalary is competitive and based on experiences/skill level. All applicants will receive equal consideration for employment.", "\nPlease email cover letter, resume, and PDF samples of both your academic and professional work", "\nNo phone calls please.", "\n    "]},
{"date": "2019-08-12 11:46", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-senior-interior-designer/6954956182.html", "text": "Senior Interior Designer/Project Manager - Home Studios", "compensation": "COMPETITIVE SALARY/MEDICAL/DENTAL/VISION", "type": "full-time", "images": [], "address": ["\n        ", "\nHome Studios (homestudios.nyc) is currently hiring a Senior Interior Designer/Project Manager to work with our design team. Home Studios is an interior design studio focusing primarily on hospitality projects. As a studio, we are inspired by detail, materials, history, and building processes. We are a young firm that is quickly growing so opportunities are vast for the right applicant. Applicants must be passionate and collaboratively-inclined.", "\n", "\nSCOPE OF WORK:", "\n", "\n-MANAGE LARGE SCALE PROJECTS ", "\n-PROJECT POINT OF CONTACT FOR SELECT PROJECTS", "\n-CREATE DESIGN WITH DESIGN DIRECTOR", "\n-OVERSEE DESIGN TEAM, SET AND MAINTAIN WEEKLY PROJECT GOALS WITH DESIGNERS", "\n-INITIAL APPROVAL ON ALL DELIVERABLES FOR SELECT PROJECTS", "\n-SET AND MAINTAIN WEEKLY PROJECT GOALS WITH DESIGN DIRECTOR", "\n-COORDINATION WITH ARCHITECT AND CONTRACTOR", "\n-CREATE SCHEMATIC PLANS, MODEL, ID SET AND CUSTOM DRAWINGS", "\n-DESIGN ITERATION FOR APPROVAL OF DESIGN DIRECTOR", "\n-BUILD SCHEDULE WITH PROJECT MANAGER", "\n-DIGITAL MATERIAL INPUT FOR RENDERINGS", "\n-DESIGN PROCESSES, PROCEDURES, AND DELIVERABLES", "\n-CONSTRUCTION ADMINISTRATION", "\n", "\n", "\nRequirements: ", "\n4-6 years of relevant experience ", "\nHighly motivated and passionate about design and/or architecture ", "\nARCHITECTURE OR INTERIOR ARCHITECTURE BACKGROUND PREFERRED ", "\nExtremely organized and detail oriented ", "\nProblem solver ", "\nTeam player and enjoy working collaboratively ", "\nHave construction knowledge or enthusiasm for learning about construction and building methods", "\n", "\nSoftware requirements (highly proficient): AutoCad, Sketchup, Adobe Creative Suite, Google Docs (Sheets)", "\n", "\nPlease send the following to careers@homestudios.nyc:", "\nShort paragraph on your background, interests, and goals", "\nResume - attachments only", "\nPortfolio - attachments only", "\nInstagram/blog", "\n3 Professional references", "\nWho is your favorite designer and why?", "\n", "\nNOTE: International candidates must hold a valid US working permit.", "\n    "]},
{"date": "2019-08-11 17:55", "link": "https://newyork.craigslist.org/lgi/egr/d/floral-park-construction-project-manager/6954566897.html", "text": "construction Project Manager", "compensation": "Negotiable", "type": "full-time", "images": [], "address": ["\n        ", "\n-Work with the client from the start of each project to ensure you understand the project scope and vision", "\n-Oversee the beginning of each turn-key project, including details like permit submission and design evaluations", "\n-Create the schedule for each project and match talent to the job", "\n-Process change orders", "\n-Collaborate with the architect and construction crew to ensure feasibility of each project", "\n-Conduct meetings on-site with architect, client and construction crew", "\n-Negotiate with vendors, suppliers and subcontractors", "\n-Prepare and submit project estimates to client", "\n-Prefer experience with NYCSCA, NYCHA, MTA.    "]},
{"date": "2019-08-12 12:01", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect-3intermediate/6954969495.html", "text": "Architect, 3Intermediate Architect for Small High-End Residential Firm", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nArchitect, 3-5 years exp.  Award winning design-oriented Union Sq/Flatiron district architecture/interiors firm seeks intermediate  architect/designer for high quality residential/institutional projects:  from Park Avenue apartments to country houses.  Strong design, organization, communication and computer skills a must.  Must be able to manage projects efficiently and deal directly with clients.  ACAD experience required", "\n", "\n    "]},
{"date": "2019-08-12 13:05", "link": "https://newyork.craigslist.org/lgi/egr/d/massapequa-park-engineer/6955033566.html", "text": "Engineer", "compensation": "We can pay hourly or for the project as a whole. The choice is yours.", "type": "employee's choice", "images": [], "address": ["\n        ", "\nWe are looking for a person to help us create an HHO generator.", "\nIf you have expertise in this area and are interested in a project like this, please contact us.    "]},
{"date": "2019-08-12 13:59", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-dob-expediter/6955085126.html", "text": "DOB Expediter", "compensation": "Compensation is on a per project basis", "type": "contract", "images": [], "address": ["\n        ", "\nArchitecture firm in Financial district is looking for Expediter, employment is in a per project basis. Minimum of 2 year experience with Building Department applications ant-1 and alt-2 mostly. ", "\n", "\nRequirements include:", "\n- Excellent communication skills ", "\n- Self driven and organized. ", "\n", "\nEmail resume along with references.", "\n", "\n    "]},
{"date": "2019-08-12 13:12", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-gc-construction-assistant/6955039813.html", "text": "GC Construction Assistant Project Manager", "compensation": "boe", "type": "full-time", "images": [], "address": ["\n        ", "\nA Manhattan based mid-size General Contracting & Construction Management company specializing in high-end residential & townhouses, restaurants, institutions, and retail spaces is currently seeking a full time Assistant Project Manager (APM) with experience in residential/commercial projects. The APM will work closely with a Project Manager and Project Executive handling anywhere from 3 to 5 projects at a given time. The APM should have high energy, demonstrate enthusiasm, sensible to time constraints and ability to work with demanding architects and clients.", "\n", "\nJob responsibilities include, but are not limited to:", "\n-Attending weekly site meetings", "\n-Creating meeting minutes, daily logs, change orders, and requisitions", "\n-Coordinating client/architect meetings", "\n-Assisting PM to fall within project schedule and budget", "\n-Handling all RFIs and RFPs, submittals, and shop drawings", "\n-Handling project close outs and punch list items", "\n-Processing paperwork for the NYC Dept. of Buildings", "\n-Some estimating and purchasing", "\n-Strong written/verbal skills", "\n", "\nAt least 2-3 years experience. Knowledge in MS Projects, Word, Excel, and Outlook a must. Ability to read architectural plans also a must. Driver's license a plus. This position is an immediate start.    "]},
{"date": "2019-08-12 14:13", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-nyc-dob-class-2-filing/6955099299.html", "text": "NYC DOB Class 2 Filing Representative", "compensation": "Competitive compensation based on skills/experience", "type": "full-time", "images": [], "address": ["\n        ", "\nBrooklyn Expediting firm seeks:", "\nFull-time position for a class 2 DOB expediting position", "\n", "\nNYC DOB, NYC DOT, FDNY and NYC DEP familiarity required", "\nNYC DOB Class 2 Filing Rep ID required", "\n", "\nRequired skills:", "\nprofessional & motivated attitude", "\nwritten and communication skills", "\nstandard Microsoft office suite familiarity", "\n", "\nResponsibilities include:", "\nWritten reports / Paperwork", "\nExpediting", "\nMeeting with plan examiners", "\nClient correspondence, etc.    "]},
{"date": "2019-08-12 19:05", "link": "https://newyork.craigslist.org/mnh/egr/d/freelance-drafter-project-architect/6955340427.html", "text": "Freelance Drafter / Project Architect", "compensation": "depends on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nSmall Architecture and Design firm is looking for a Full time position Drafter / Project Architect with code and zoning knowledge. Preference for a highly motivated and self driven individuals.   ", "\n", "\nResponsibilities include: ", "\n- Site surveying", "\n- Preparation of existing condition drawings.", "\n- Preparation of schematic design drawings.", "\n- Preparation of sketch-up 3D models.", "\n- Preparation of construction and filing drawings with some knowledge of building codes.", "\n", "\nIdeal candidates will meet the following requirements:", "\n- Minimum 3-4 years construction/engineering work experience managing projects from implementation to closure.", "\n- Excellent problem solver and independent thinker with good listening skills and strong follow-through.", "\n- Strong skills in the production of construction drawings.", "\n- Strong verbal and graphic communication, organizational and collaborative skills.", "\n- Ability to work independently and in a team environment.", "\n    "]},
{"date": "2019-08-13 07:20", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-architect-intern-cad-cnc/6955544667.html", "text": "Architect Intern - CAD, CNC, Fabrication", "compensation": "based on experience", "type": "part-time", "images": [], "address": ["\n        ", "\nPopular Design/Build Firm seeks Arch Intern -", "\n", "\n position available for candidate possessing skills in:", "\n-Drafting - Autocad", "\n-Excel and Calculus", "\n-Creation of DOB filing sets", "\n-CNC design and programming", "\n", "\nResume AND Portfolio required for consideration. ", "\n", "\nThis is a licensed firm offering AIA hours.", "\n    "]},
{"date": "2019-08-13 10:07", "link": "https://newyork.craigslist.org/que/egr/d/astoria-sketchup-2018-professional/6955624137.html", "text": "◄◄  SKETCHUP 2018 PROFESSIONAL AVAILABLE FOR YOUR PROJECT (Free Lance)", "compensation": "Per Project Quote", "type": "contract", "images": ["https://images.craigslist.org/00a0a_l6bW4myiKco_600x450.jpg", "https://images.craigslist.org/00E0E_4lsaa5eQoDG_600x450.jpg", "https://images.craigslist.org/00101_3bp13nKYOb9_600x450.jpg", "https://images.craigslist.org/00K0K_iSsVk9JXyuh_600x450.jpg", "https://images.craigslist.org/00o0o_tMc4n4UWNM_600x450.jpg", "https://images.craigslist.org/00k0k_k0mY2kUmXX9_600x450.jpg", "https://images.craigslist.org/00808_8fkJQ6BMRLF_600x450.jpg", "https://images.craigslist.org/00y0y_l1xZY3zNSDK_600x450.jpg", "https://images.craigslist.org/00909_6EJjFbU6gMN_600x450.jpg", "https://images.craigslist.org/00A0A_6YRFFS2mKw6_600x450.jpg", "https://images.craigslist.org/00P0P_2QdIAUk5GMO_600x450.jpg", "https://images.craigslist.org/00S0S_he5jXxemWCY_600x450.jpg", "https://images.craigslist.org/00505_azakxbXJ8xl_600x450.jpg", "https://images.craigslist.org/00O0O_eebJoZo5IhG_600x450.jpg", "https://images.craigslist.org/00n0n_frJxlyjZIgC_600x450.jpg", "https://images.craigslist.org/00404_2d7d7E4zm0v_600x450.jpg", "https://images.craigslist.org/00505_gFRMUdA5eYZ_600x450.jpg", "https://images.craigslist.org/00I0I_gPH0sLL8Xyo_600x450.jpg", "https://images.craigslist.org/00909_bEXAWp61izk_600x450.jpg", "https://images.craigslist.org/00W0W_aTkgs9DGcNn_600x450.jpg", "https://images.craigslist.org/00h0h_jea2F2B4Jf2_600x450.jpg", "https://images.craigslist.org/00B0B_7zop2Z9rSH7_600x450.jpg", "https://images.craigslist.org/00i0i_cfWcNyRZ0gt_600x450.jpg"], "address": ["\n        ", "\n", "    "]},
{"date": "2019-08-13 12:31", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-senior-project-architect/6955751817.html", "text": "Senior Project Architect | Office Interiors", "compensation": "100-120K plus comprehensive benefits package.", "type": "full-time", "images": [], "address": ["\n        ", "\nFull Time Career Role / Leadership Role", "\nTime for a change?", "\nDoes this describe YOU? ", "\nRevit proficiency with supporting work samples. ", "\nNYC area corporate interiors project experience. ", "\nLicensed Architect in New York. ", "\n10-20 years of professional Architecture experience.  ", "\nProfessional degree in Architecture from an accredited university. ", "\nReady to start your new role by October 1.  ", "\nDesire to collaborate in mid-sized A/E firm.  ", "\nDesire for work/life balance and professional growth.  ", "\nIf so, please apply today for immediate consideration! ", "\nThank you!    "]},
{"date": "2019-08-13 11:29", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-land-surveyors-and-cad/6955692860.html", "text": "Land Surveyors and CAD Technicians needed", "compensation": "commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nJED Engineering & Land Surveying, P.C. is a fast-growing multi-disciplined construction management, engineering and land surveying firm headquartered in New York. We are currently seeking:", "\nFull-time Land Surveyors in our New York City office.", "\nField:\t", "\nParty Chief", "\nInstrument Person", "\nRod Person", "\n", "\nQualifications", "\n", "\n•\tMinimum of 3 - 5 years experience.", "\n•\tAbility to use Survey CAD software a plus.", "\n•\tExperience with boundary, topographic, utilities surveying and construction stake out.", "\n•\tMust have a valid New York Driver’s License.", "\n•\tNo Land Surveyor License is required,  but having a License in any state will be a plus", "\n", "\n", "\nFull-time / part-time CADD Technicians in our New York City office.", "\n", "\nQualifications", "\n", "\n•\tMinimum of 3 - 5 years experience.", "\n•\tAbility to use Survey CAD software a plus.", "\n•\tExperience with AutoCAD Civil 3D and / or Micro-Station.", "\n", "\nWe offer a competitive wage, bonus incentive, excellent benefits package including 401(k) with company match, and medical and dental plans.  We are an Equal Opportunity Employer. Send resume for consideration", "\n    "]},
{"date": "2019-08-13 15:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-manager/6955937992.html", "text": "Project Manager", "compensation": "Compensation commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nMICHAEL TOWER ARCHITECTURE is seeking a Project Manager with 3-4 years of work experience to join our growing practice. The position involves working directly with the principal and senior designer to manage projects, develop design work, drawing sets, and presentations.", "\n", "\nResponsibilities:", "\n", "\n•\tProject management", "\n•\tDesign", "\n•\tProducing and supervising working drawings", "\n•\tCommunication with clients and general contractors", "\n•\tEstablish schedules and benchmarks for projects", "\n", "\nProject Managers oversee the design, production and administration of multiple and/or complex projects and are directly responsible both to the client and the firm for successful execution of the project. ", "\n", "\nQualifications:", "\n", "\n•\tSelf-starter", "\n•\tExcellent design skills", "\n•\tWorking experience with Revit", "\n•\tExcellent communication and writing skills", "\n•\tPunctual and highly organized", "\n•\tProfessional Degree in Architecture (B. Arch or M. Arch)", "\n", "\n", "\nSubmittal Requirements:", "\n", "\n•\tPlease send a cover letter along with your resume, portfolio, and your salary requirements via email.", "\n•\tPortfolio must not exceed 10MB.", "\n•\tPortfolio links will be accepted.", "\n", "\nWe are looking only for local candidates within the NYC metro area and will reply only to candidates we are interested in meeting.  No phone calls please.", "\n", "\n    "]},
{"date": "2019-08-13 16:26", "link": "https://newyork.craigslist.org/que/egr/d/ridgewood-draftsman/6955807650.html", "text": "Draftsman", "compensation": "TBD", "type": "part-time", "images": [], "address": ["\n        ", "\nI am looking for a person to do drawings in a company specializing in architectural metal and glass. Sample shop drawings are welcome. Please contact us at archmetny@gmail.com    "]},
{"date": "2019-08-13 21:45", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-for-large-bim-project/6956181758.html", "text": "Architect for large BIM Project", "compensation": "Compensation commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nNew York based architectural firm is seeking mid-level to senior Architect for current large-scale infrastructure project. Applicant must be available to begin work immediately. We are seeking a Project Architect with a minimum of 8 to 10 years of experience in delivering coordinated design and construction documentation with proficiency in Autodesk Revit and other applicable industry software. ", "\n", "\nApplicant must possess strong communication skills necessary for seamless cross-discipline project coordination. Familiarity with program analysis, building planning standards and code compliance issues for large scale facilities is desirable. Experience with current New York City Building Code is a plus.", "\n", "\nEase of commute to a downtown Manhattan office is vital.", "\n", "\nIdeal candidate will be a well-organized, detail-oriented individual capable of working in large teams, coordinate meetings with consultants, and produce deliverables without requiring constant supervision. Candidate must be fluent in written and spoken English.", "\n", "\nWe offer a competitive salary and benefits package commensurate with experience, health insurance, IRA, vacation time, holiday pay and personal time off, paid sick leave, disability and paid family leave coverages. ", "\n", "\nFederal identity and eligibility regulations govern this consultant opportunity. We are an Equal Opportunity Employer. Candidates of any race, color, religion, national origin, sex, physical or mental ability, or age, are encouraged to apply.", "\n", "\nInterested candidates should forward a cover letter and resume. Include BIM Project Architect in the subject. No telephone calls, please.", "\n    "]},
{"date": "2019-08-14 03:01", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-civil-engineers-surveyors/6956265334.html", "text": "CIVIL ENGINEERS & Surveyors - All Levels", "compensation": "Dependent on experience level; Full time with benefits, healthcare, 401k", "type": "full-time", "images": ["https://images.craigslist.org/00q0q_e3jjxRHrFJG_600x450.jpg", "https://images.craigslist.org/00S0S_gg3BrssLVpY_600x450.jpg", "https://images.craigslist.org/00Y0Y_7FbOIsehvH2_600x450.jpg", "https://images.craigslist.org/00V0V_1XwzjcyU0FQ_600x450.jpg", "https://images.craigslist.org/01111_aj23sDEOWmN_600x450.jpg", "https://images.craigslist.org/00K0K_2pN2wVLEmq0_600x450.jpg", "https://images.craigslist.org/00Y0Y_cEpigprK6xc_600x450.jpg", "https://images.craigslist.org/00t0t_51D2oDR2mzC_600x450.jpg", "https://images.craigslist.org/00a0a_drf409kow45_600x450.jpg", "https://images.craigslist.org/00A0A_k6oLYjPcwd5_600x450.jpg", "https://images.craigslist.org/00808_gI1l6wPbXIx_600x450.jpg", "https://images.craigslist.org/00G0G_jdOW9YQ43na_600x450.jpg", "https://images.craigslist.org/00Q0Q_kWW1LPZt9Rt_600x450.jpg", "https://images.craigslist.org/00s0s_5ULF13MvOda_600x450.jpg", "https://images.craigslist.org/00s0s_4QP14z6XpvA_600x450.jpg", "https://images.craigslist.org/00d0d_WSUtQ2ZUsO_600x450.jpg", "https://images.craigslist.org/00u0u_eWrZMPd73KC_600x450.jpg"], "address": ["\n        ", "\n", "  ", "\n ", "  ", "  \n  ", "\n\nWe have positions for: Civil CAD Designer, Civil Project Engineer, Licensed Civil Engineer, Civil Project Manager, Structural Engineer and Land Surveyor  ", " ", "\n\nPositions open for types of project disciplines: Land Development / Site Development, Transportation Engineering, Water Resources, Structural Engineering and Land Surveying  ", " ", "\n\nFor CONFIDENTIAL CONSIDERATION: ", "\nEmail your resume to: jobs@trabucogroup.com \n", " ", "\nFor full list of Engineering positions, visit us at: ", "\n\n", "\n\n KEYWORDS: civil engineering, site development, land development, grading, drainage, storwmwater, SWPPP, paving, striping, traffic control, transportation, signal, signage, railway, highway design, roadway, water, wastewater, hydrology, hydraulics, earthwork, utility design, water resources, wastewater, Autocad, Civil 3D,  REVIT, StaadPro, Microstation, inroads, ArcGIS, surveying, topos, geotechnical, geotech, GIS, structural, ASCE, EIT, PE, TE, survey, surveying, topos, boundaries, ALTA maps, legal description and plats, Appraisal Maps, Records of Survey, topography, photogrammetry, boundary surveys, construction staking, topcon, leica, carlson subdivision mapping, total station, PLS, RPLS, LSIT, SIT\n    "]},
{"date": "2019-08-14 10:22", "link": "https://newyork.craigslist.org/brk/egr/d/architectural-intern-administrative/6956382421.html", "text": "Architectural Intern / Administrative assistant", "compensation": "Competitive compensation based on skills/experience", "type": "full-time", "images": [], "address": ["\n        ", "\nBrooklyn Architectural firm seeks:", "\nfull-time position for Architectural Intern / Administrative assistant", "\n", "\n", "\nSkills: ", "\nProfessional & motivated attitude", "\nWritten and communication skills ", "\nStandard Microsoft office suite familiarity", "\nArchitectural background", "\nFamiliarity with NYC Department of Buildings", "\n", "\nResponsibilities include:", "\nWritten reports / Paperwork ", "\nClient correspondence, etc.", "\n", "\nCompetitive compensation based on skills/experience", "\n", "\nJob seeker to live within 20 miles of 11219 Zip code.    "]},
{"date": "2019-08-14 10:33", "link": "https://newyork.craigslist.org/que/egr/d/estimator-take-offs/6956390994.html", "text": "Estimator/ Take-Offs", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nSeeking F/T individual to read architectural blueprints/specifications, perform accurate take-offs and type proposals for various commercial & residential projects. Important to have good verbal skills, written communication skills and the ability to perform general office duties. Please send resume to design@nycmillwork.com or call 718-392-1600.    "]},
{"date": "2019-08-14 15:42", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-full-time-in-house-architect/6956674689.html", "text": "FULL TIME IN-HOUSE ARCHITECT/EXPEDITER NEEDED", "compensation": "Compensation: BOE", "type": "full-time", "images": [], "address": ["\n        ", "\nFULL TIME IN-HOUSE ARCHITECT/EXPEDITER NEEDED IN A NYC BASED MID-SIZE DEVELOPMENT OFFICE", "\n", "\n“Position available immediately” ", "\n", "\nMust have 12-15 years’ experience as either a freelance architect (mid-level) or have worked in an architectural office, also needs to be ", "\nNYC DOB, NYC DOT, FDNY and NYC DEP familiarity required", "\nNYC DOB Class 2 Filing Rep ID required", "\nRESPONSIBILITIES: included but not limited to.", "\n", "\n• Owner’s representation by all architectural and engineers’ meetings", "\n• Zoning Analysis and Diagrams", "\n• Drawing existing and proposed sections and elevations", "\n• Update drawing sets based on NYC Plan Examiner Objections", "\n• Prepare DOB filing set packages and coordinate with Expediter to file with Department of Buildings.", "\n•\tAdvise ownership of outstanding violations, attend these hearings and defend to the best of your ability", "\nCompensation based on experience and negotiable", "\n    "]},
{"date": "2019-08-14 16:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-temp-to-perm-interior-design/6956729079.html", "text": "Temp to Perm - Interior Design Assistant Position", "compensation": "35K + DOE", "type": "full-time", "images": [], "address": ["\n        ", "\nWe are looking for a Junior Interior  Designer to join our Interior Design Team.  The candidate will work directly to support our Interior Design Staff.  Our firm does concentrates on hospitality  and residential design work, so this should be an area of interest  ", "\n", "\nCandidate must have a positive outlook, have a great attitude, be creative and be willing to learn.  The proper person will have attention to detail, solid organizational skills and be able to work with others in a professional manner.", "\n", "\nThe position entails working with our team to create  a complete Interior Design Construction package, FF&E packages, project presentations and assisting with  other various deadlines.", "\n", "\nWe are willing to accept candidates right out of school if the proper skill set is available.  ", "\n", "\nThe applicant should be well versed in Autocad, Photoshop and the MS Office Applications.  SketchUp and Adobe InDesign are a plus.    "]},
{"date": "2019-08-14 20:08", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intern-and-junior-architect/6956865397.html", "text": "Intern and Junior Architect", "compensation": "hourly", "type": "part-time", "images": [], "address": ["\n        ", "\nSmall Architectural / Interior Design firm located in the Lower East Side, specializing in residential and commercial projects, seeks an architectural intern and a junior architect. Work will consist of assisting in all phases of schematic design, design development, preparation of DOB, LPC drawings and applications, construction documents, construction site visits, archiving, material sourcing, specifications, presentations and general office activities. ", "\n", "\nCandidates must be highly motivated, quick learners, with a passion for architecture and desire to learn and grow. Excellent AutoCAD drafting abilities and 3D rendering skills are a must. Candidates must be responsible, organized, punctual, reliable, have good communication skills, and be team-players, capable of multi-tasking and focused on producing accurate results.  ", "\n ", "\nPlease send:", "\n", "\n1.\tpdf samples of your work and include a brief description of your role in the work presented", "\n2.\ta cover letter and your resume ", "\n3.\tindicate your availability", "\n4.\tindicate your hourly fee requirements", "\n    "]},
{"date": "2019-08-14 20:54", "link": "https://newyork.craigslist.org/que/egr/d/flushing-construction-project-manager/6956889535.html", "text": "Construction Project Manager _ Estimator (Queens NY)", "compensation": "determined after the evaluation. average : $1,000-1200 or $900 per week", "type": "full-time", "images": [], "address": ["\n        ", "\nJob Description: ", "\n", "\nWe are looking for a Project Manager/Estimator available to directly work for Construction General Contractor's Office and Job Site. Mainly New Building and Renovations. ", "\n", "\nThe Position: Daily Job Duties include: ", "\n", "\nConstruction Contract Administration .", "\n", "\nPreparing and ensuring Construction Scheduling, from Permit through signed Punch list.", "\n", "\nDirect support and involvement in the Estimating / Quantity Take-off and the Request For Proposal Process including obtaining and Qualifying proposals is also part of the job.", "\n", "\nNew Building experience needed", "\n", "\nThis Project Manager position will require Daily Job Awareness, juggling multiple priorities, organized interaction with the Field representatives and Professional updates.", "\n", "\nPersonal Characteristics:", "\nDevelops, maintains and fosters a positive attitude concerning the job and our company with both customers and fellow employees", "\nInitiates and promotes teamwork concepts.", "\nDevelops, improves and maintains communication skills with others.", "\nDevelops and understands systems of priorities and time management. ", "\nUtilizes time appropriately.", "\nDevelops and initiates improvements to company business methods and practices.", "\nAbility to stay calm during busy hard working stressful periods", "\n", "\nDriving license needed for the necessary delivery of the material in case.", "\n", "\nFor consideration, please send resume of Project Management Experience specifically regarding NB Commercial Construction, Scheduling and Estimating abilities to us for review and consideration.", "\n", "\n", "\n*We are an Equal Opportunity Employer", "\n", "\nJob Requirements", "\nSkills & Abilities:", "\nKnowledge of Project Management, ", "\nestimating and evaluation.", "\n", "\nKnowledge of Labor output and Labor rates and how they vary by job and location.", "\nKnowledge of material kinds and costs and variations caused by time constraints", "\nUnderstand specific and industry-related construction specifications", "\nAbility to cost and price non-standard construction details", "\nDevelop and understand job specific comprehensive Scopes of Work to Schedule accordingly", "\nAbility to foster and promote customer relationships.", "\nStrong Letter Writing skill set", "\nInnovative Problem Solving", "\nExcellent Follow Up Skills", "\n", "\nQualifications:", "\nEnglish, Korean, Spanish language skill", "\nDrive license, Superintendent lic if needed.", "\n", "\nBachelor's Degree (or equivalent) for Construction Science or related field of study", "\nWorking knowledge of Microsoft Office products; specifically Outlook, Word and Excel", "\nProficiency with reading construction plans, specifications and vendor product data information", "\nFamiliarity with construction project delivery methods and practices", "\nPrincipals only.", "\n", "\nurbangcinc@gmail.com", "\njindoccc@gmail.com", "\n", "\nOffice manager : Mr. Kim 917-599-1669", "\nMr. Jung 917-882-0131", "\n", "\n", "\n", "\n", "\nfull time and part time", "\n    "]},
{"date": "2019-08-15 10:43", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-resident-engineer/6957125077.html", "text": "Resident Engineer", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nGandhi Engineering is seeking a Resident Engineer for a New York City Department of Design & Construction (NYCDDC) Pedestrian Ramp Rehabilitation Project (Bronx).  A Professional Engineering (P.E.) license is required. Prior experience with NYCDDC projects preferred. Competitive salaries and benefits, including 401K plan.    "]},
{"date": "2019-08-15 13:44", "link": "https://newyork.craigslist.org/mnh/egr/d/forest-hills-professional-engineers/6957289128.html", "text": "PROFESSIONAL ENGINEERS", "compensation": "Dependent on skills & experience", "type": "full-time", "images": [], "address": ["\n        ", "\nTectonic is a multi-disciplined engineering firm that has been in business for over 30 years, and has a reputation for delivering professional, quality services without sacrificing integrity or value. We are also one of only a few uniquely positioned consulting engineering firms that can provide our clients with a higher level of quality services by offering special inspections and in-house laboratory material testing services.", "\n", "\nTectonic is currently seeking qualified Professional Engineers to perform various special inspections on behalf of one of the New York City metro area’s highly respected engineering/inspection firms.  The ideal candidate will have a BSCE and a NYS PE license or the ability to obtain in a short period of time, and geotechnical or building construction experience.    ", "\n", "\nESSENTIAL FUNCTIONS", "\n", "\nEssential functions of this position includes performing various special inspections of building for which the design requires professional engineers to ensure compliance with approved construction documented and referenced standards required by the NYC Construction Building Code. The Senior Field Engineer will also perform additional special testing, including the subsurface investigation including soil borings, test pits, and soil percolation testing. This requires readings and interpreting various related documents and drawings, maintaining special inspection records, and preparing official field reports. The Senior Field Engineer may also perform various other inspections, as well as all other related duties as required. ", "\n", "\nQUALIFICATIONS", "\n", "\n•\tValid Professional Engineering License required;", "\n•\tBS Degree or equivalent in Civil Engineering or similar; MS Degree is a plus;", "\n•\tMust possess a minimum of 3 years of geotechnical engineering or construction building inspection experience, preferably in NYC;", "\n•\tAbility to complete OSHA 10-Hour Construction Safety and Health Training within a reasonable time period;", "\n•\tAbility to prepare and submit timely and accurate field inspection reports;", "\n•\tExcellent oral and written communication skills; ", "\n•\tUnderstanding of the fundamentals of building inspection codes and requirements in order to carry out testing, including, but not limited to, International Building Codes, ASTM Standards, and TMS standards; ", "\n•\tDiversified knowledge of technology, materials, equipment, design concepts and construction techniques;", "\n•\tAbility to solve complex issues with limited direction;", "\n•\tMay also require valid, clean driver’s license and personal vehicle to travel to job sites.", "\n", "\nTO VIEW AND APPLY, PLEASE VISIT: ", "    "]},
{"date": "2019-08-15 13:48", "link": "https://newyork.craigslist.org/mnh/egr/d/mountainville-signal-engineer/6957292623.html", "text": "Signal Engineer", "compensation": "Dependent on skills & experience", "type": "full-time", "images": [], "address": ["\n        ", "\nTectonic is currently seeking full-time Signal Engineers to work on various building and infrastructure for upcoming MTA projects in the New York City area.", "\n", "\nThis position will provide Signal Engineers with the chance to work on high profile, challenging projects that offer the opportunity for professional growth and advancement within the A/E/C industry working for a Top ENR 500 Firm. ", "\n", "\nESSENTIAL FUNCTIONS", "\n", "\nThe essential functions of this position include traveling to various project sites on a daily basis and perform daily surveillance and inspections to verify that all work performed by the Contractor has been completed in accordance with the contract requirements, along with being responsible to ensure quality hold points are being observed and witness all applicable inspection and testing required under the Contract. The Signal Engineer will access and conduct field inspection to enforce NYCT rules and regulations involving the daily field construction need and to ensure contractors are incompliance with all pre-requisite for the work tasks being performed in the field, as well as proper and safe working environment are set up and field works are adequately covered. Such pre-requisite will include but not limited to approve drawings, materials, obtain proper permits and procure NYCT support services such as flagging protection, G.O. and work trains. The Engineer will discuss and coordinate work activities with contractors and field inspectors and will review and ensure that daily reports are properly and accurately recorded with details. Essential functions also include the preparation of Daily Field Reports, communication of deficiencies observed in the field to project managers, contractors, and/or client representatives, and the interpretation of project-related drawings and documents, as well as all other duties as assigned. Field inspectors will prepare detailed daily inspection reports and records all contractor and NYCT personnel on site, work performed, materials used and any incidents and non-conformances occurred in the field.", "\n", "\nTO VIEW AND APPLY, PLEASE VISIT: ", "\n", "\nQUALIFICATIONS", "\n", "\n•\tCandidates must possess the following certifications AND a High School Diploma/equivalent:", "\no\tOSHA 30 Hour Safety ", "\no\tLead Awareness", "\n•\tAbility to complete Track Safety and PMG 123 Training Certification;", "\n•\tEffective oral and written communication skills; ", "\n•\tMust be detail oriented;", "\n•\tA valid, clean driver’s license and personal vehicle to travel to job sites is preferred; as regular daily travel is required to various project sites primarily throughout the New York City metro area; ", "\n", "\nCOMPETITIVE SALARY AND BENEFITS PACKAGE", "\n•\tComprehensive group medical insurance, including health, dental, vision and life", "\n•\tOpportunities for professional growth and advancement", "\n•\tTuition reimbursement", "\n•\tPaid time off, including vacation, sick and personal", "\n•\tCompany–observed paid holidays", "\n•\tShort and long-term disability coverage", "\n•\tFlexible spending accounts for medical expenses and dependent care", "\n•\tCommuter benefit plan for public transportation costs", "\n•\t401K retirement and profit sharing plan.", "\n", "\nWe are an equal opportunity/affirmative action employer, and highly encourage resumes from all interested parties including women, minorities, veterans and persons with disabilities. All qualified applicants will be afforded equal employment opportunities without discrimination on the basis of race, creed, color, national origin, sex, age, disability, marital status, or any other protected class.", "\nTectonic participates in the USCIS E-Verify Program to verify that all new hires are authorized to work in the United States.", "\n", "\n    "]},
{"date": "2019-08-15 11:39", "link": "https://newyork.craigslist.org/mnh/egr/d/studio-assistant-entry-level/6957173048.html", "text": "Studio Assistant - entry level", "compensation": "to be discussed", "type": "full-time", "images": [], "address": ["\n        ", "\nPerfect introduction to work in Architect's office for a recent grad or as a follow up to a summer internship!", "\nPrevious experience is not a requirement, just motivation to assist in a busy office and learn the rhythms of day-to-day practice.", "\n", "\nWe are a 10-ish person firm located in Chelsea, doing interesting design work for projects of all scales in nyc from New Buildings to polished interior renovations.", "\n", "\nThe position is full time and duties generally include:", "\n-assisting architects", "\n-managing the materials library", "\n-material and product research", "\n-managing images/assembling porfolio presentations", "\n-maintaining website and other media", "\n-light drafting", "\n-general studio organization", "\n-printing and reproduction", "\n-office oversight of phones, messengers, ordering supplies etc.", "\n", "\nSkillset should include:", "\n-basic photoshop ", "\n-basic autocad for printing and light drafting", "\n-microsoft office suite", "\n", "\n", "\nWe hope to cultivate young architects and there are opportunities for growth for motivated candidates.", "\nPlease forward resume / letter / a few work examples.", "\n", "\n    "]},
{"date": "2019-08-15 13:50", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-land-surveying-drafter-needed/6957294649.html", "text": "Land surveying drafter needed", "compensation": "to be discussed in person at interview", "type": "full-time", "images": [], "address": ["\n        ", "\nLooking for Autocad drafter that has knowledge in the land surveying field. Experience in Land surveying a MUST. Please send resume.    "]},
{"date": "2019-08-15 15:14", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-assistant-for/6957369202.html", "text": "PROJECT ASSISTANT for Real Estate focused Digital Agency", "compensation": "$20/hr.", "type": "part-time", "images": [], "address": ["\n        ", "\nSmall, but quickly growing Real Estate focused Digital Agency seeks a Project Assistant to assist Creative Director with project workflow and product communications on a part-time basis.", "\n", "\nPosition would suit an ARCHITECTURE/INTERIOR DESIGN/GRAPHIC DESIGN student. ", "\n", "\nResponsibilities:", "\n• Assist assembling new project information (schedules, assignments, tasks & contacts).", "\n• Markup Renderings & Animation for comments & Edit Review (Under Direction of CD)", "\n• Make Minor Adjustments to Layouts, Renderings, etc.", "\n• Prepare and format Client Deliverables", "\n• Review Project Status and Update Reports", "\n", "\nRequirements:", "\n• Available 2+ days per week, 10am - 6pm", "\n• Proficiency in Adobe Photoshop a MUST ", "\n• Understanding of image formatting, (dpi/compression etc.), a MUST", "\n• Ability to read and understand architectural technical drawings, (CAD/construction documents/design presentations, etc.) a MUST", "\n• Ability to read and understand interior design technical drawings, (ID CAD/schedules/FF&E/design presentations, etc.) a MUST", "\n• Strong Visual Communication skills", "\n• Ability to translate verbal direction into visual direction", "\n• Excellent organizational skills with meticulous attention to detail", "\n• Self-motivated and dependable with the ability to adapt to changing priorities", "\n• Ability to take direction and execute tasks through to completion", "\n• Understanding of 3D modeling and digital video editing a plus ", "\n• Previous experience working at a creative agency/real estate/architectural firm a plus (internship, etc.)", "\n", "\nNOTE: This is a Project Assistant position and not an opportunity for a 3D renderer/modeler/animator (though an understanding of these would be useful). ", "\n", "\nThis is an entry level opportunity with potential to grow with the company and full-time position for the right person down the road. Compensation is hourly: $20/hr.", "\n", "\nPlease reply with your availability, resume and include 'PROJECT ASSISTANT' in the subject line.    "]},
{"date": "2019-08-15 16:34", "link": "https://newyork.craigslist.org/que/egr/d/flushing-structural-engineer/6957435800.html", "text": "Structural Engineer", "compensation": "The salary is based on level of experience.", "type": "full-time", "images": [], "address": ["\n        ", "\nJob Description:", "\n", "\nWe are currently seeking structural engineers at multiple levels to join our team. As a structural engineer, you will work with other team members in our highly collaborative environment to assure that designs are developed in accordance with appropriate codes and standards, quality control objectives are achieved, and project goals are met within the schedule and budget. This is an outstanding opportunity for a structural engineer to work on a variety of high-profile projects throughout the region. ", "\n", "\nDuties and Responsibilities:", "\n", "\n- Coordinate with architects, contractors, owners, and other engineers from the initial planning stages through final construction.", "\n- Determine design criteria using relevant codes and standards.", "\n- Analyze and/or prepare models and calculations for various structural elements and systems by using various software and/or hand calculations.", "\n- Develop contract documents, including construction drawings and technical specifications", "\n- Produce schematic and detailed designs and evaluation of planning and concept alternatives", "\n- Review shop drawings, RFI's.", "\n- Perform field inspections and write inspection reports.", "\n", "\nSkills and Qualifications:", "\n", "\n- Familiar with latest version of AutoCAD, Revit, ETABS, SAP2000, SAFE, RAM, Excel.", "\n- Excellent verbal and written communication skills", "\n- Ability to effectively work independently and collaboratively in a team environment", "\n- Must be eligible to work in the United States", "\n", "\nEntry Level Candidates:", "\n- Bachelor’s degree in Civil or Structural Engineering.", "\n", "\nIntermediate Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 3+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n", "\nAdvance Level Candidates:", "\n- Master’s degree in Civil or Structural Engineering.", "\n- 8+ years of related work experience in concrete or steel framing building structural design, support-of-excavation and foundation system design, steel or concrete rebar shop drawing design, construction support design and field inspection.", "\n- NYS PE License", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-15 18:49", "link": "https://newyork.craigslist.org/que/egr/d/long-island-city-engineer-architect/6957533495.html", "text": "engineer/architect/autocad, yup!", "compensation": "compensation: above industry average, based on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nTwo positions available as we expand: ENGINEER and/or ARCHITECT(auto cad) wanted as we grow our highly regarded engineering and architectural services firm. ", "\n", "\nWe are a 14 employee mid-sized Professional Corp., located in LONG ISLAND CITY, Queens, we provide owner and contractor support for a wide range of DOB requirements, primarily many contractor required logistics, safety and structural engineering products, as well as full architectural renovations and permanent structural designs. We specialize in the design of temporary structural stability components and sequences, Support of excavation designs, Site Safety Plans, and related contractor equipment designs, we save our clients lots of money bringing build-able and cost effective designs to approval. ", "\n", "\nWe are in need of both of the following:", "\n", "\nSTAFF STRUCTURAL ENGINEER: experienced/proficient with autocad, 1-2 years minimum experience. Passion for build-able cost effective, code compliant solutions is required, with the ability to communicate and defend designs in formal calculations and theory for building and temporary component analysis. ", "\nDuties are predominantly autocad production, but will also be asked to attend field inspections, job site meetings and DOB plan exams. Salary range 55k -65k and up, depending on experience. ", "\n", "\nSTAFF ARCHITECT: experienced/proficient with autocad, 1-2 years minimum experience. Passion for efficient designs, strong interest in many components of building codes, regulations and procedures. Duties are predominantly autocad production, but may be asked to attend job site meetings and DOB plan exams. Chief products are renovation applications, and a large quantity of Site Safety Plans, Egress Analysis, ATRU plans for contractors. Salary range 55k-65k and up, depending on experience. ", "\n", "\nWE ARE ALSO CONSIDERING APPLICANTS WITH MORE EXPERIENCE, AND WILL COMPENSATE ACCORDINGLY. we are also open to entry level, provided autocad experience. We are equal opportunity employer.", "\n", "\nBENEFITS:", "\nAs well as above industry standard salaries, we offer employer contribution in health/dental care, 401k matching saving plan, weekly employer sponsored team building lunch, in-house continuing ed (as part of our DOB/IAS accreditation), and basically an all around good rewarding time producing highly respected products!", "\n", "\nFor consideration:", "\nIN COVER LETTER, PLEASE STATE ANYTHING YOU WOULD LIKE US TO KNOW ABOUT WHY YOU ARE A GOOD CHOICE, PLEASE INCLUDE YOUR SALARY RANGE REQUIREMENTS. ", "\nPlease include resume in body of email or as pdf, not word doc or google drive.", "\n", "\nIMPORTANT: please list either: structural engg applicant, or architect applicant, in the subject of the email. ", "\n", "\nThanks, good luck in your job search.    "]},
{"date": "2019-08-15 19:36", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-part-time-student-intern-in/6957561773.html", "text": "Part-time Student Intern in Architecture", "compensation": "Commensurate with experience", "type": "part-time", "images": [], "address": ["\n        ", "\nCome join our small Architectural Practice which is seeking a student Intern to work part time on a variety of projects. This is a paid position with flexible hours to work around class schedules. Full-time or additional hours may be available during the summer or at school breaks. ", "\n", "\nOur firm is involved in several project types that include: Master Planning, Retail & Showroom Design, Commercial Interiors including Corporate and Co-Working Locations, Apartments and Penthouse Projects, Traditional and Contemporary Homes and Additions. Our current projects are located throughout the tri-state area.", "\n", "\nCandidates must be proficient in: AUTOCAD 2014 or higher, Photoshop, Illustrator, InDesign, and must currently be enrolled in an accredited Architecture or Interior Design School. Model making or 3D rendering a plus.", "\n", "\nPrevious experience in an Architectural or an Interior Design firm is preferred. Please email your resume and samples of your work. Work samples should include a brief description of what your role and job duties were for each project.", "\n", "\nRegrettably we do not have the capacity to respond to every applicant.    "]},
{"date": "2019-08-16 10:34", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-plumbing-fire-protection/6957834921.html", "text": "Plumbing/Fire Protection Engineer", "compensation": "95,000.00 to 135,000.00", "type": "full-time", "images": [], "address": ["\n        ", "\nWe are a world-class multi-disciplinary engineering consulting firm who is seeking a Plumbing/Fire Protection Engineer for our New York, NY office. ", "\n", "\nResponsibilities ", "\n", "\nOur engineers work on high quality, high-profile, national and international projects. We are currently looking for engineers who will be responsible for the systems design of commercial, institutional, healthcare, and laboratory projects.", "\n", "\nResponsibilities include:", "\n• Development of initial Pluming and Fire Protection system concepts", "\n• Design of Plumbing and Fire Protection systems", "\n• Calculation of preliminary water, gas, sanitary/sewer and storm loads for utility coordination", "\n• Develop project specifications", "\n• Survey and evaluation of existing conditions", "\n• Construction administration", "\n• Assist with Project Management", "\n• Attend client meetings ", "\n", "\nRequirements ", "\nBachelor’s degree in Mechanical, Civil or Environmental Engineering preferred. ", "\n2- 15 years’ experience designing plumbing and fire protection systems preferred. (Project experience submitted for consideration should include buildings on which you have actively participated in the project from the design phase through the final construction close-out.) ", "\nStrong working knowledge of building, plumbing, and fire codes ", "\nExcellent verbal and written communication skills ", "\nCurrent PE and LEED AP licenses/registrations are preferred. ", "\nSpecial consideration will be given to those candidates who have successfully demonstrated innovative design experience specifically related to renewable energies and sustainable, high performing buildings.", "\n", "\nOur company offers salary commensurate with experience, a comprehensive benefits package which includes medical, dental, disability and life insurances, 401k plan, tuition reimbursement, and more.    "]},
{"date": "2019-08-16 14:15", "link": "https://newyork.craigslist.org/fct/egr/d/bethel-solidworks-cad-designer/6958044666.html", "text": "Solidworks CAD Designer", "compensation": "Competitive", "type": "full-time", "images": [], "address": ["\n        ", "\nSolidworks CAD Designer", "\nFocal Metals – Bethel, CT", "\n", "\nAbout Us: Focal Metals fabricates high-end, custom architectural furnishings and structural components for quality homes throughout Connecticut and New York. We proudly assist the completion of exacting home projects in some of the most unique and beautiful houses in the country. Frequent projects include the design and fabrication of kitchen hoods and counters, spiral stairs, entry doors, and railings.", "\n", "\nDuties and Responsibilities: We seek to add an additional full-time Solidworks CAD Designer to our growing team. Duties include designing and producing  shop/ build to CAD drawings of custom architectural metals goods using Solidworks  CAD software.  Interacting with general contractors, architects, designers, PM’s and company management to facilitate seamless  manufacturing and installation of the designed items.  CAD Designer must have a willingness to work in a fast pace friendly environment.", "\n", "\nREQUIRED: Knowledge of CAD design and related software.", "\n", "\nREQUIRED: At least one year of experience designing architectural metal good, architectural components or mill shop cabinetry.  ", "\n", "\nSpecial consideration will be given to applicants with experience with the Solidworks or AutoCAD software. Applicants must be available to work full-time during normal operating hours and adhere to safety standards. ", "\n", "\n    "]},
{"date": "2019-08-16 18:01", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6958237509.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 3 to 7 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-16 18:02", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-project/6958238423.html", "text": "Facade / Building Envelope Project Architect", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\n", " ", "\n\n", " New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled project architect with 5-10 years’ relevant experience to join us in executing a growing slate of challenging projects. ", " \n", " ", "\nWe’re proud to be an industry leader in crucial practice areas like facade inspections and repairs (Local Law 11), roof repairs, and investigation and remediation of structural issues. We've won numerous awards—including ten Lucy Moses preservation awards—as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", " \n", "\nAbsolutely. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer applications that integrate construction drawings, specifications, cost estimating, scheduling, and construction administration; advanced photography and image processing; and state-of-the-art, non-destructive diagnostic equipment and techniques. In fact, we have an in-house studio dedicated to such supporting technology, constantly developing new digital tools (think James Bond’s “Q”). ", "   .\n\n", " ", "\nHonestly, we offer aspects of both. You’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This gives you the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. ", " \n", "\nYou’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n", "\nAn array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks. ", " \n", " ", "\nWe embrace all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. ", " \n", "\n\nWe offer an array of benefits and growth opportunities:", "\n", "\n", "\n", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away.", "\n\n", "\n\nSend us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or a link to your portfolio that demonstrates your experience and capabilities. We look forward to meeting you! ", "\n\nPlease note that, due to the high number of applicants, we can only contact candidates under consideration. ", "  \n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-17 07:58", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-civil-structural-engineer/6958481155.html", "text": "CIVIL/STRUCTURAL ENGINEER WANTED", "compensation": "Salary commensurate with experience.", "type": "full-time", "images": [], "address": ["\n        ", "\nWe are a multifaceted engineering firm located in midtown Manhattan, and we’re looking for a full-time civil/structural engineer with AutoCAD proficiency and 1-3 years of experience in design, field work, and project management. Knowledge of façade restorations a plus. Salary commensurate with experience.    "]},
{"date": "2019-08-18 09:37", "link": "https://newyork.craigslist.org/wch/egr/d/rye-landscape-architect-designer/6959173444.html", "text": "Landscape Architect/Designer", "compensation": "according to experience", "type": "full-time", "images": [], "address": ["\n        ", "\nAre you ready to grow as a practitioner, be involved in all aspects of your projects, and to see them built and enhancing the lives of your clients? ", "\n", "\nWe’re doing great work, and we’re growing. Take a look at our website and see for yourself – www.sjlandscapearchitects.com ", "\n", "\nHigh-tech, innovative landscape architecture practice seeks talented, self-motivated landscape architect or designer to join our team. If you enjoy your work and can juggle varied tasks accurately and efficiently in a progressive, collaborative environment, we’d love to meet you. Here’s what you’ll need: ", "\n", "\nAutoCAD experience is required", "\n3d software experience helpful", "\nKnowledge of construction methods", "\nRegional plant knowledge", "\nPreparation of construction documents, details & presentation drawings", "\nAbility to effectively communicate with clients and a wide variety of contractors and professionals. ", "\n", "\nWe're an award-winning professional services firm producing high-end projects primarily in Metropolitan NY & CT. Our office in beautiful Rye, New York is spacious, modern & bright, close to Manhattan, major highways and walk-able from the Metro North Railroad. Submit, via email, in PDF format, a resume with cover letter, including salary requirements, references, and AutoCAD drawing samples. NO PHONE CALLS.", "\n", "\nOnly applicants meeting our criteria will be contacted as part of the short-listing process.", "\n    "]},
{"date": "2019-08-19 09:12", "link": "https://newyork.craigslist.org/lgi/egr/d/great-neck-interior-architect-designer/6959790489.html", "text": "Interior/architect  designer", "compensation": "Hourly rate", "type": "part-time", "images": [], "address": ["\n        ", "\nPinner Architecture  is currently seeking a talented, responsible, ambitious FREELANCE Senior Interior Designer for immediate part-time employment to work  on commercial Interiors designs. We are looking for a sharp individual who is detail-oriented, and who likes to experiment with new ideas and materials. The candidate must be equally able to take direction and work independently as needed while being fully accountable for all project assignments. They will also need to be team-spirited, willing not only to listen but also contribute to a creative design dialogue. Curiosity, discernment, resourcefulness, and drive are important.  Could lead to full time employment.    "]},
{"date": "2019-08-19 09:44", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/6959812116.html", "text": "Intermediate Architect", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nNew York based architectural firm is seeking a Intermediate Architect for current large-scale projects. Applicant must be available to begin work immediately. We are seeking a Project Architect with a minimum of 8 to 10 years of experience in the delivery of detailed construction documents. Proficiency in Autodesk Revit, AutoCad and associated software.. ", "\n", "\nApplicant must possess excellent technical skills. Applicant will be required to perform program analysis, zoning analysis, building planning standards and code compliance issues for large scale facilities is desirable. Experience with current New York City Building Code is a plus.", "\n", "\nWe offer a competitive salary and benefits package commensurate with experience, health insurance, vacation/sick time, disability and paid family leave coverages. ", "\n", "\nInterested candidates please forward a cover letter and resume.    "]},
{"date": "2019-08-19 10:13", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-junior-draftsman/6959835362.html", "text": "Junior Draftsman/Architect with Purchasing Experience", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nCommercial and residential construction company based in Manhattan seeks Junior Draftsman/Architect with purchasing experience. Excellent opportunity to gain knowledge of and practical experience in the construction industry.  Strong potential for advancement and additional responsibilities based on performance.", "\n", "\nResponsibilities, Qualifications and Required Skills: ", "\n•\tRead, interpret and prepare architectural and woodworking drawings.", "\n•\tCandidate must have strong knowledge of AutoCAD or other architectural software.", "\n•\tCandidate must be able to produce quality shop drawings for commercial and residential project.", "\n•\tSource materials and contractors for each project.", "\n•\tDevelop network of multiple material vendors and service contractors to facilitate timely construction and the highest quality standards, and to ensure costs remain within budget.", "\n•\tNegotiate pricing and delivery schedules with vendors. Expedite deliveries when necessary.", "\n•\tKnowledge and experience working with construction material vendors in NYC, a big plus.", "\n•\tMust be comfortable working in a high-pressured environment.", "\n•\tMust be self-motivated and take initiative without instructions", "\n•\tEnergetic and dynamic personality a big plus ", "\n", "\n    "]},
{"date": "2019-08-19 10:22", "link": "https://newyork.craigslist.org/wch/egr/d/white-plains-survey-crew-chief/6959842486.html", "text": "Survey Crew Chief", "compensation": "Negotiable", "type": "full-time", "images": [], "address": ["\n        ", "\nThis is an excellent opportunity with a highly-respected engineering firm as a crew chief in the survey department. This is a great role for an individual with 2-5 years of experience as a Crew Chief who might be looking to work for a more reputable firm, or someone with experience as a Land Surveyor looking for their first Crew Chief role. ", "\n", "\nCandidates will be responsible for operating survey equipment, reporting data to office personnel, and leading a small team. Outstanding candidates will also have experience using Robotic Total Station Equipment. ", "\n", "\nRequirements:", "\nAt least 2-5 years of experience in land surveying", "\nOSHA 10 Certification (we can help obtain)", "\nReferences from past employers", "\n", "\nIf you are interested in the opportunity, please attach an updated resume.    "]},
{"date": "2019-08-19 11:05", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-pro-aire-design-seeks-full/6959881035.html", "text": "Pro Aire Design seeks Full Time HVAC Estimator / Estimating Assistant", "compensation": "Negotiable", "type": "full-time", "images": [], "address": ["\n        ", "\nPro Aire Design is seeking a full-time HVAC Estimating Assistant ($15-22 an hour)", "\n", "\n*Please reference job title on subject, send resume in PDF, and text format on the body of email*", "\n", "\nWe are a company based in Brooklyn is looking for a HVAC Estimating Assistant with a 1-3 years' of experience in taking off a plans. Knowledge of drafting for HVAC metal shop, and coordination drawings in 2D/3D is a plus. The candidate should have knowledge of plumbing. The candidate will work in engineering department with professional. Compensation and benefits based on experience. ", "\n", "\nMAJOR FUNCTION/ROLE", "\nWill work with project managers, and mechanical engineers to take off plans, create CAD files, and construction documents for HVAC projects. Additionally, keep track of incoming/outgoing products, purchase forecast,  and return. ", "\n", "\nJOB DUTIES ", "\n• Take off plans + Performs computer-aided drafting and design work of considerable complexity. Incumbents at this level can work from verbal or written specifications. ", "\n• Create 2D and 3D models using AutoCAD MEP", "\n• Prepare HVAC Shops, As-Builts and Coordination drawings ", "\n", "\nEDUCATION AND EXPERIENCE ", "\n• High school diploma (or equivalent) plus two years related experience; OR ", "\n• An Associate Degree in a related technical field plus one years related experience;", "\n• Must have at least 1-3 years of experience in taking off plans and HVAC CAD preparation of Construction Documents, with additional experience preferred. ", "\n", "\nPro Aire Design Offers: ", "\n• Competitive wages", "\n• Medical benefits", "\n• Paid vacation", "\n• Paid holidays", "\n• Employee product discounts", "\n", "\nWe are an Equal Opportunity Employer; all qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, sex, sexual orientation, gender identity, age, status as a protected veteran, among other things, or status as a qualified individual with a disability. If our company sounds like a place you want to be a part of please feel free to send your resume along with any inquiries. We look forward to hearing from you!    "]},
{"date": "2019-08-19 11:40", "link": "https://newyork.craigslist.org/que/egr/d/forest-hills-civil-field-engineer/6959915282.html", "text": "Civil Field Engineer", "compensation": "Dependent on skills & experience", "type": "full-time", "images": [], "address": ["\n        ", "\nTectonic is currently seeking full-time Civil Field Engineers to work on various building and infrastructure projects throughout the NYC area. ", "\n", "\nThis position will provide Civil Field Engineers with the chance to work on high profile, challenging projects that offer the opportunity for professional growth and advancement within the A/E/C industry working for a Top ENR 500 Firm. ", "\n", "\nESSENTIAL FUNCTIONS", "\n", "\nThe essential functions of this position include traveling to various project sites on a daily basis, monitoring construction operations, and using applicable field testing procedures and testing equipment to perform required field and building inspections and testing, as well as all related testing as required by the project and client to determine compliance with project plans and specifications. Essential functions also include the preparation of Daily Field Reports, communication of deficiencies observed in the field to project managers, contractors, and/or client representatives, and the interpretation of project-related drawings and documents, as well as all other duties as assigned.", "\n", "\nQUALIFICATIONS", "\n", "\n•\tBS Degree in Civil Engineering;", "\n•\tRegistered EIT in New York State;", "\n•\tRelated certifications are a plus;", "\n•\tAbility to complete OSHA 10-Hour Construction Safety and Health Training within a reasonable time period;", "\n•\tEffective oral and written communication skills; ", "\n•\tAbility to learn and understand the fundamentals of building inspection codes and requirements in order to carry out testing, including, but not limited to, International Building Codes, ASTM Standards, and TMS standards; ", "\n•\tMust be detail oriented;", "\n•\tMay also require valid, clean driver’s license and personal vehicle to travel to and transport testing equipment to various project sites primarily throughout the New York City metro area, as regular daily travel is required.", "\n", "\nTO VIIEW AND APPLY, PLEASE VISIT: ", "\n", "\nIn addition to providing competitive salaries, Tectonic offers a wide range of benefit options, including:", "\n", "\n•\tComprehensive group medical insurance, including health, dental, vision and life", "\n•\tOpportunities for professional growth and advancement", "\n•\tTuition reimbursement", "\n•\tPaid time off, including vacation, sick and personal", "\n•\tCompany–observed paid holidays", "\n•\tShort and long-term disability coverage", "\n•\tFlexible spending accounts for medical expenses and dependent care", "\n•\tCommuter benefit plan for public transportation costs", "\n•\t401K retirement and profit sharing plan.", "\n", "\nWe are an equal opportunity/affirmative action employer, and highly encourage resumes from all interested parties including women, minorities, veterans and persons with disabilities. All qualified applicants will be afforded equal employment opportunities without discrimination on the basis of race, creed, color, national origin, sex, age, disability, marital status, or any other protected class.", "\nTectonic participates in the USCIS E-Verify Program to verify that all new hires are authorized to work in the United States.", "\n", "\n    "]},
{"date": "2019-08-19 12:45", "link": "https://newyork.craigslist.org/brk/egr/d/drafter-position-bilingual-russian/6959982012.html", "text": "Drafter Position - Bilingual Russian", "compensation": "Pay based on experience.", "type": "full-time", "images": [], "address": ["\n        ", "\nPosition available now. Architectural Consulting Company is looking for an experienced drafter/ junior architect to work full-time in the office located in Brooklyn, preferably bilingual in Russian, literacy is not required.", "\nOur drafters work directly with the clients from the design phase to sign-off. Strong understanding of the NYC Building Codes is crucial, however, we provide training. It is a fast-paced office, and we expect the employees to have knowledge and understanding of the processes involved in getting a project approved. Able to work efficiently in tight deadlines, ever-changing team-oriented environment. Must be able to communicate effectively both orally and in writing with team members and outside professionals while proactively communicating with the Project Manager to obtain needed information to continue progress on plans.", "\nExperience with renderings (particularly 3D Max) is a plus. However training will be provided. Salary based on skill and experience. ", "\n", "\nPlease include resume and portfolio/samples that reflect your creativity.    "]},
{"date": "2019-08-19 15:14", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-ground-up-construction/6960129731.html", "text": "Ground Up Construction Supervisor", "compensation": "1", "type": "full-time", "images": [], "address": ["\n        ", "\nSahara Contracting in Brooklyn seeks qualified Construction Supervisor.  ", "\n", "\nKey Requirements:", "\n", "\nA positive attitude and willingness to encourage co-workers", "\nExcellent communications skills", "\nMinimum of 7-10 years experience in general construction", "\nExperience in supervising construction projects", "\nThe ability to set priorities and exercise flexibility where necessary", "\nAbility to read and understand blueprints, schematics, and construction documents", "\nUnderstanding of proper safety procedures and recognition of hazards", "\nResponsibilities:", "\n", "\nHiring, training and general management of all employees on the project", "\nMonitoring performance of sub-contractors and staff", "\nMonitoring project budget", "\nAccomplishing project by defining the scope and resources required", "\nAllocating resources, materials, sub-contractors and other staff", "\nMaintaining a safe, secure and healthy work environment by adhering to and enforcing safety codes", "\nTo Apply:", "\n", "\nSubmit a resume detailing your experience", "\nSubmit a cover letter explaining why you would be a great fit", "\n* You must be legal to work in the United States.", "\n", "\nContact Habeeb. 917 468 5083", "\n    "]},
{"date": "2019-08-19 17:42", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-estimator-full/6960259427.html", "text": "Construction Estimator - Full time", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nEstablished NYC based Construction firm seeks self-motivated energetic individual with experience to join our team. ", "\n", "\nDuties Include: Preparing detailed take-offs and estimates, analyzing architectural & structure drawings, preparing formal proposals, cost control. ", "\n", "\nCandidate must have thorough knowledge of computer programs especially Excel, Word, Planswift and strong analytical and communication skills with an eye for detail", "\n    "]},
{"date": "2019-08-19 18:48", "link": "https://newyork.craigslist.org/lgi/egr/d/great-neck-jr-architect-cad-draftperson/6960309483.html", "text": "Jr. Architect/CAD Draftperson", "compensation": "commensurate with experience", "type": "contract", "images": [], "address": ["\n        ", "\nWe are a small architectural firm located in Great Neck, NY with easy access via public transportation. Our work includes multiple dwellings, commercial and fine residential projects in NYC and Long Island.", "\n", "\nWe are looking for a person who has 6 months - 2 years of professional experiences, and the duties include site survey, production of construction documents and client interactions.", "\n", "\nA successful candidate should have:", "\n- US Architectural Degree", "\n- CAD proficiency", "\n", "\nPlease submit a resume and a cover letter with a compensation requirement by replying to this post.", "\n", "\nwww.jwjarchi.com", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-19 20:10", "link": "https://newyork.craigslist.org/lgi/egr/d/smithtown-product-engineer-repair-and/6960362300.html", "text": "Product Engineer - Repair and Development", "compensation": "Up to US$0.00 per year", "type": null, "images": [], "address": ["\n        ", "\n\n        ", "\n    "]},
{"date": "2019-08-20 09:47", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architectural-job-captain/6960595389.html", "text": "Architectural Job Captain", "compensation": "salary commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\nSBLM New York office looks for a highly motivated Job Captain who is a team player with excellent REVIT skills. Ideal candidate will be a well-organized, detail-oriented individual who is accustomed to working on and leading the production of multiple projects. ", "\n", "\nResponsibilities include, but not limited to: ", "\nCoordinate and develop construction documents", "\nTake on technically challenging issues with Project Manager", "\nPerform code and zoning analyses", "\nReview and redline drawings", "\nOversee drafters, as required by the project", "\nProduce deliverables without requiring constant supervision", "\nCoordinate meetings with consultants", "\nOrganize and lead site visits and surveys", "\nConduct material research and meet with vendor as necessary, to understand", "\nmaterials and products", "\nTake initiative to complete work", "\n", "\nRequirements:", "\nBachelor’s Degree in Architecture", "\n3+ years’ experience in an Architect’s office working on Commercial/Retail projects", "\nMust be proficient in Revit and other applicable industry software is a must", "\nGeneral understanding of codes and zoning", "\nGeneral knowledge of building details and construction process", "\nPositive attitude and driven to succeed", "\n", "\nCompensation and Benefits:", "\n•\tWe offer a competitive salary and benefits package commensurate with the level of experience and a creative and innovative work environment.", "\n•\tOur benefit package includes Medical/Dental/Vision Insurance, 401k Retirement Plan, Flexible Spending Plans, Paid Time Off, Holidays, and more.", "\n•\tOur company culture features professional learning and growth opportunities, rewarding project types to participate in and free ongoing professional educational programs.", "\n", "\nInterested candidates should forward their cover letter and resume ", "\nPlease include Job Captain in the subject. No phone calls, please. ", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-20 14:41", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-senior-interior-designer/6960867621.html", "text": "Senior Interior Designer/Project Manager - Home Studios", "compensation": "COMPETITIVE SALARY/MEDICAL/DENTAL/VISION", "type": "full-time", "images": [], "address": ["\n        ", "\nHome Studios (homestudios.nyc) is currently hiring a Senior Interior Designer/Project Manager to work with our design team. Home Studios is an interior design studio focusing primarily on hospitality projects. As a studio, we are inspired by detail, materials, history, and building processes. We are a young firm that is quickly growing so opportunities are vast for the right applicant. Applicants must be passionate and collaboratively-inclined.", "\n", "\nSCOPE OF WORK:", "\n", "\n-MANAGE LARGE SCALE PROJECTS ", "\n-PROJECT POINT OF CONTACT FOR SELECT PROJECTS", "\n-CREATE DESIGN WITH DESIGN DIRECTOR", "\n-OVERSEE DESIGN TEAM, SET AND MAINTAIN WEEKLY PROJECT GOALS WITH DESIGNERS", "\n-INITIAL APPROVAL ON ALL DELIVERABLES FOR SELECT PROJECTS", "\n-SET AND MAINTAIN WEEKLY PROJECT GOALS WITH DESIGN DIRECTOR", "\n-COORDINATION WITH ARCHITECT AND CONTRACTOR", "\n-CREATE SCHEMATIC PLANS, MODEL, ID SET AND CUSTOM DRAWINGS", "\n-DESIGN ITERATION FOR APPROVAL OF DESIGN DIRECTOR", "\n-BUILD SCHEDULE WITH PROJECT MANAGER", "\n-DIGITAL MATERIAL INPUT FOR RENDERINGS", "\n-DESIGN PROCESSES, PROCEDURES, AND DELIVERABLES", "\n-CONSTRUCTION ADMINISTRATION", "\n", "\n", "\nRequirements: ", "\n4-6 years of relevant experience ", "\nHighly motivated and passionate about design and/or architecture ", "\nARCHITECTURE OR INTERIOR ARCHITECTURE BACKGROUND PREFERRED ", "\nExtremely organized and detail oriented ", "\nProblem solver ", "\nTeam player and enjoy working collaboratively ", "\nHave construction knowledge or enthusiasm for learning about construction and building methods", "\n", "\nSoftware requirements (highly proficient): AutoCad, Sketchup, Adobe Creative Suite, Google Docs (Sheets)", "\n", "\nPlease send the following to careers@homestudios.nyc:", "\nShort paragraph on your background, interests, and goals", "\nResume - attachments only", "\nPortfolio - attachments only", "\nInstagram/blog", "\n3 Professional references", "\nWho is your favorite designer and why?", "\n", "\nNOTE: International candidates must hold a valid US working permit.", "\n    "]},
{"date": "2019-08-20 17:43", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-cad-account-manager/6961026493.html", "text": "CAD Account Manager", "compensation": "$50,000-$55,000 per year, Unlimited Vacation Time, Flexible Schedules, Food and Social Activities for the Team", "type": "full-time", "images": [], "address": ["\n        ", "\nRDM (a Building Engines company,) helps asset managers, landlords, and brokers capture the full potential value and rental revenue of commercial real estate. Our pioneering best-in-class solutions set the standard for more accurate measurement, understanding, visualization and redrawing of office space – without expensive CAD drawings. Now that we’ve joined forces with market-leading Building Engines, we are poised for exciting new opportunities.", "\n", "\nKey Responsibilities & Job Requirements", "\n", "\n- Use AutoCAD and our proprietary software to help customers keep their database updated with current floor plans", "\n- Serve as primary point of contact for customers and fulfill their support requests that may include: floor plan scenarios, floor plan changes, leasing/marketing plans, space analysis, space calculations based on REBNY or BOMA", "\n- Become an expert in RealAccess and clearly communicate the benefits and features", "\n- Become an expert in REBNY and BOMA methods of measurement", "\n- Attend customer training and on-boarding meetings in-person and through video", "\n", "\n", "\nRequired Skills and Experience", "\n", "\n- 2-4 years of AutoCAD experience", "\n- BA, BS Degree, or related certification and work experience using AutoCad", "\n- Experience with additional drafting software is a plus", "\n- Intelligent, motivated and competitive with a roll-up-the-sleeves and get the job done attitude", "\n- Excellent communication and interpersonal skills", "\n- Excellent organizational, prioritization, and time management skills", "\n- Knowledge of the commercial real estate space is a plus, but not required", "\n", "\n", "\nAbout Building Engines", "\n", "\nBuilding Engines is a leading cloud-based provider of property management software for operations-minded teams at commercial office, retail, and industrial real estate properties. Our web and mobile platform seamlessly connects property teams with the activities, data, and insights they need to improve operational efficiency, mitigate risk, improve tenant satisfaction and engagement, and make more informed decisions. Clients of Building Engines include many of the leading public REITs, private owner/managers, and third-party management firms in the United States and Canada.", "\n", "\n    "]},
{"date": "2019-08-20 21:12", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-cadd-revit-draftsperson-job/6961157781.html", "text": "CADD/REVIT DRAFTSPERSON/JOB CAPTAIN", "compensation": "to be determined", "type": "full-time", "images": [], "address": ["\n        ", "\nBOUTIQUE MIDTOWN ARCHITECTURAL FIRM SEEKING CADD/REVIT DRAFTSPERSON/JOB CAPTAIN WITH 2-6 YEARS EXPERIENCE IN CORPORATE INTERIORS, BUILDING RENOVATION, AND CORE & SHELL WORK. CANDIDATE MUST BE SELF MOTIVATED AND BE ABLE TO HIT THE GROUND RUNNING. WILL BE WORKING DIRECTLY WITH PARTNER AND PROJECT MANAGER. NEED TO BE ABLE TO CREATE FULL SETS OF CONSTRUCTION DOCUMENTS, CREATE WALL TYPES, DOOR SCHEDULES, DETAILS, ETC. MUST BE PROFICIENT IN AUTOCAD AND HAVE A GOOD KNOWLEDGE OF REVIT. EMAIL RESUME AND SALARY REQUIREMENTS.    "]},
{"date": "2019-08-21 08:02", "link": "https://newyork.craigslist.org/brx/egr/d/bronx-construction-super-assist-project/6961300928.html", "text": "Construction Super / Assist. Project Manager", "compensation": "Based on Compatibility and Experience", "type": "full-time", "images": [], "address": ["\n        ", "\nConstruction Super / Assist. Project manager wanted with plan and spec. experience for a large Healthcare Facility renovation in East Kingsbridge.", "\n", "\nMust be able to read and understand construction drawings.  Previous commercial construction experience required.", "\n", "\nOSHA 30 hour training required. We will assist with this if you are interested and do not have the training.", "\n", "\nCandidates should be hard-working, motivated, and looking to excel.", "\n", "\nCandidate will work directly with owners, professionals, executives, superintendents, subcontractors and officials to insure that all project directives are met.", "\n", "\nResponsibilities Include:", "\n-\tManage and supervise on site construction, subcontractors and vendors ", "\n-\tComplete and submit all field required reports and logs including daily logs, subcontractor change orders, RFI's and project progress / schedules updates ", "\n-\tEvaluate plans, specifications and related construction documents for construct-ability and provide recommendations for value engineering", "\n-\tCommunicate design or material delivery issues to insure no impact to schedule or cost and report significant project related issues to project leadership in a timely manner", "\n-\tEnsure all safety and environmental requirements are met and obtain all project related permits and licenses from Authorities Having Jurisdiction ", "\n-\tImplement on site quality control and adherence to plans and specifications", "\n-\tReview and approve subcontractor and vendor pay requisitions and submit for final approval ", "\n-\tSchedule delivery and sequence of project materials and work ", "\n-\tHold weekly site meeting for subcontractors and clients and communicate the schedule to subcontractors and vendors ", "\n-\tEnsure regular communications with owners, subcontractors, and vendors", "\n-\tPlay key role in internal preparation and project debriefs", "\n", "\nPlease include the statement 'General Liability and Workman's Compensation' in your response to this posting.", "\n    "]},
{"date": "2019-08-21 12:33", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-mechanical-engineer/6961501244.html", "text": "Mechanical Engineer", "compensation": "Experienced highly compensated", "type": "full-time", "images": [], "address": ["\n        ", "\nEME Consulting Engineering Group, LLC, (EME) is a professional engineering firm, headquartered in New York City, with a satellite office in Albany, NY.  EME clients include healthcare, educational, governmental, and hospitality. EME’s core business is engineering and architectural design involving with the upgrade and enhancement of energy systems.  ", "\n", "\nEME is currently seeking degreed Mechanical Engineers for project management and engineering design.  The ideal candidate will have a degree in Mechanical Engineering and at least 3 years of mechanical system design experience in healthcare and or educational facilities.  The candidate should also have working knowledge with the following:", "\n", "\n•\tExperience with NYC Building Codes and International Building Codes ", "\n•\tHVAC design from conceptual through construction", "\n•\tExperience in water and air side systems ", "\n•\tHeating and cooling load calculations", "\n•\tEquipment selection ", "\n•\tBuilding automaton control diagrams and sequence of operations", "\n•\tWritten specifications", "\n•\tAutoCAD, Carrier HAP/Trane Trace and MS Office applications", "\n•\tKnowledge of sustainable design practices", "\n•\tStrong communication skills for client interface", "\n•\tLeadership ability to guide support staff", "\n", "\nThis position offers a competitive compensation and with bonus potential.   Benefits include multiple health insurance plans to choose from, a 401k profit sharing plan, and professional workplace environment.", "\n", "\nThese positions are permanent and offer opportunity for advancement. You will be working directly alongside a distinguished team of licensed professionals in a team-oriented environment.  ", "\n", "\nEME is an equal opportunity employer.", "\n", "\nPlease forward cover letter with resume and salary requirements.", "\n", "\n    "]},
{"date": "2019-08-21 11:21", "link": "https://newyork.craigslist.org/que/egr/d/great-neck-architect-draftsperson/6961433183.html", "text": "ARCHITECT/DRAFTSPERSON - INTERMEDIATE", "compensation": "Negotiable-based on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nQueens / Great Neck Architectural firm seeking Intermediate Architect with 2-5 years’ experience in new construction for high end custom one family residences, builders’ cluster residential developments, apartment buildings and commercial projects located in New York City (primarily Queens) and Nassau County.", "\n", "\nIndividual MUST have a Bachelor's degree (or higher) in ARCHITECTURE.", "\n", "\nMUST HAVE EXPERIENCE IN ONE FAMILY FRAME HOUSES.", "\n", "\nIndividual must possess excellent communication skills, be motivated, have a good sense of design and be able to produce design and construction drawings using AutoCAD. Individual must be able to work in the USA.", "\n", "\nKnowledge of New York City Zoning and Building Code and Expediting a plus.", "\n", "\nGreat opportunity to become a Registered Architect.", "\nFriendly, upbeat work environment. Send cover letter with resume and SALARY REQUIREMENTS.    "]},
{"date": "2019-08-21 16:57", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-finance-office-manager-wanted/6961744708.html", "text": "Finance / office manager wanted", "compensation": "Based on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nGrowing construction company specializing in public works is looking to add an finance / office manager. Ideal candidate will have experience in construction and previous extensive exposure to QuickBooks and financial operations. Must be able to work in a fast-paced, pressure environment - especially during summer months. This is a permanent position with an immediate start.", "\n", "\nPlease submit resume and salary requirements. Candidates without Quickbooks experience are not considered.    "]},
{"date": "2019-08-22 10:37", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-field-service-engineer/6962143315.html", "text": "Field Service Engineer", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nJob Description", "\n", "\nOne of the 3D Printing leading companies in the United States is currently seeking a responsible, professional and experienced 3D Printing Field Service Technician.", "\n", "\nThe 3D Printing Field Service Technician ensures optimum operational performance for hardware related to 3D Printers installed at the customers' site. They deliver technical service to customers including installation, relocation, repair, and preventative maintenance. This person will provide technical and operational support of 3D printing equipment and systems located within the following types of environments: business/corporate, educational and military specifications.", "\n", "\nResponsibilities:", "\n•\tEnsure optimum operational performance for systems installed at the customer's site", "\n•\tOptimize system performance to minimize equipment downtime and ensure maximum overall customer ", "\n        satisfaction", "\n•\tBe dispatched and directed by their supervisor with a primary function of repairing customer's equipment", "\n•\tFrequent travel to perform onsite equipment installs, maintenance, and upgrades", "\n•\tFamiliarize customer with product usage and care", "\n•\tAvailability for occasional off-hours calls and work", "\n•\tRead and interpret documents such as safety rules, operating and maintenance instructions, wiring ", "\n        diagrams, flowcharts, and procedure manuals", "\n•\tWrite routine reports and correspondence", "\n", "\nEducation & Training Requirements:", "\n•\tAA degree, a two-year diploma from a technical school or military ratings such as Naval ET, FC or FT ", "\n        required", "\n•\t3-5 years of related electrical, mechanical &/or technical experience.", "\n•\tBS in engineering field preferred but not required", "\n•\tSolid knowledge of remote support tools, TCP/IP protocol, and computer science", "\n•\tSolid skills in Microsoft Office and strong troubleshooting skills with mechanical/electrical systems.", "\n", "\nRequirements:", "\n•\tMust have a hands-on approach", "\n•\tAbility to read an electrical schematic and mechanical drawings", "\n•\tStrong customer service experience required", "\n•\tSkills in organization, problem-solving, and customer relations", "\n•\tBasic interpersonal and communication skills in the business environment and a commitment to ", "\n        professionally represent the company with its customers", "\n•\tAbility to speak effectively before customers and act in an advisory capacity", "\n•\tWorking effectively and efficiently under tight deadlines", "\n•\tAbility to work at customer locations independently with minimal support", "\n•\tMust have a driver's license", "\n", "\nBenefits:", "\nExcellent employee environment with a competitive benefits package including:", "\n•\tSalary commensurate with experience", "\n•\tGreat Benefits package including Health Insurance + 401k", "\n•\tStable company with growing revenue", "\n•\tWork with cutting edge technologies in many spaces", "\n", "\nEEO/AA/V/D/M/F/SO", "\nJob Type: Full-time", "\n    "]},
{"date": "2019-08-22 12:11", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-entry-level-electrical/6962227574.html", "text": "Entry Level Electrical Engineering", "compensation": "Salary commensurate with experience, 401(K), Health & Life Insurance, Vacation Days, Sick Days", "type": "full-time", "images": [], "address": ["\n        ", "\nHighland Associates is a full service architectural, engineering and interior design firm, offering a single source of responsibility for all design and project administration disciplines.  Staff performs: architecture; interior design; facility master planning and programming; HVAC, electrical, plumbing, fire protection, and structural engineering; project management; code analysis, site utilization/selection and real estate services.", "\n", "\nCurrently hiring Entry Level Electrical Engineering to be trained in design of electrical systems for commercial and institutional facilities (new construction, renovation, fit-up and rehabilitation projects, high rise buildings), including, but not limited to: power distribution systems, emergency power generation and uninterruptible power systems, electrical system trouble shooting, lighting control systems; building and site infrastructure upgrades.  Must be proficient in electric circuit and systems design.  Must have knowledge of AutoCAD.  BSEE required.  (No computer majors)", "\n    "]},
{"date": "2019-08-22 14:25", "link": "https://newyork.craigslist.org/que/egr/d/manhasset-kitchen-bath-designer/6962353116.html", "text": "Kitchen & Bath Designer - Experienced", "compensation": "Salary + Commission", "type": "full-time", "images": [], "address": ["\n        ", "\nHi-end Kitchen & Bath Showroom/Contractor seeking experienced, talented Kitchen & Bath designer/sales person to join our team! Must be bilingual - Fluent in English and Chinese. ", "\n", "\nSkills", "\n\tCreative kitchen & bath designer (CKD, CBD a plus)", "\n\tWorking knowledge of kitchen and bath remodeling process.", "\n\tAbility to execute the contract from concept to completion. ", "\n\tKnowledge of electrical & plumbing requirements ", "\n\tProficient in Auto Cad, Excel, Word", "\n\tUnderstanding of the luxury K&B cabinetry market", "\n\tAbility to sell to high end clients ", "\n\tKnowledge of sales techniques including closing ", "\n\tWorking knowledge of current kitchen & bath design trends.", "\n\tJobsite Experience (measuring, layouts, general understanding of residential custom home construction process, etc.) plus ability to do accurate measurement for material orders.", "\n\tProven ability to work both independently and in a team environment", "\n\tDetailed oriented", "\n\tOrganized ", "\n\tInsure customer satisfaction as if you were on the receiving end.", "\n", "\nJob Functions", "\n\tResponsible for selling, designing & developing residential Kitchen & Bath Designs and guide client selections", "\n\tPrepare complete design of kitchen & bath projects, including floor plan, elevations and complete detailed drawings for installers so they have a clear understanding of scope of work.", "\n\tInclude electrical & plumbing requirements in design ", "\n\tComplete Client Information Form", "\n\tComplete all designs necessary for the owner's projects.", "\n\tProvide great customer service to clients", "\n\tAsk clients for referrals & testimonials at the completion of the project", "\n\tAttend factory training & new product launches", "\n\tEngage and develop new business opportunities through prospecting, social and professional networking    "]},
{"date": "2019-08-22 17:59", "link": "https://newyork.craigslist.org/que/egr/d/project-manager/6962530380.html", "text": "Project Manager", "compensation": "Based on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nProject manager needed for drywall company based in queens.", "\nMust have experience as a project manager on drywall jobs", "\nMust be reliable, motivated and excellent organizational skills.", "\nProficient in  take off, reading plans, prepare proposals, quick books, Microsoft word and excel.", "\nMust have the ability to manage new and existing drywall construction.", "\nPlease send salary requirements with resume.", "\nThe ideal candidate must be well versed in the drywall industry", "\n    "]},
{"date": "2019-08-23 11:38", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-assistant-pm-expediter/6962927023.html", "text": "Assistant Pm Expediter", "compensation": "Salary and Benifits", "type": "full-time", "images": [], "address": ["\n        ", "\nArchitectural/Expediting firm seeking individual with MIN 3-5 year experience for an Assistant PM position , immediate opportunity.", "\nCandidate MUST know and be familiar with the municipal process.", "\nDOT, Meetings and permits", "\nDOB, filings, permits, AHV", "\nLMPC, filings, permits", "\nDEP filings", "\nResearch all departments", "\n", "\nKnowledge of applications, process for filings, permits, variances, and violation work a must.", "\nThis is a full time position with benefits, health, PTO, Vacation, 401K.", "\n", "\nPlease submit your resume  by e-mail with salary requirements.", "\nThese two components to be provided or will not be considered.", "\n", "\n    "]},
{"date": "2019-08-23 16:30", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6963200951.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 3 to 7 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-23 13:48", "link": "https://newyork.craigslist.org/que/egr/d/brooklyn-architectural-construction/6963053410.html", "text": "Architectural Construction Admin/ Field Representative (18-24 months)", "compensation": "Depending on Experience", "type": "full-time", "images": [], "address": ["\n        ", "\nSenior level, onsite construction administration field representative needed for 18-24 months. Multiple projects,  predominantly in Brooklyn and S.I. NYC. Job responsibilities entail monitoring progress and quality of construction work and confirm conformance with contract documents. Respond to RFI's, participate in project meetings and prepare meeting minutes. Maintain on-site project records, process change orders and review submittals' conformance with documents as well as maintain activity logs, etc. Possibly also providing in-house support at our midtown office. Opportunity to stay on in firm after  project completion, long term growth potential.", "\n", "\nQualifications:", "\n", "\n8 years minimum, with extensive CA experience.", "\nMS Office; PDF mark ups", "\nRevit and/or AutoCAD ability required", "\nArchitectural License preferred or additional related experience necessary    "]},
{"date": "2019-08-23 16:34", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-project/6963204446.html", "text": "Facade / Building Envelope Project Architect", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\n", " ", "\n\n", " New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled project architect with 5-10 years’ relevant experience to join us in executing a growing slate of challenging projects. ", " \n", " ", "\nWe’re proud to be an industry leader in crucial practice areas like facade inspections and repairs (Local Law 11), roof repairs, and investigation and remediation of structural issues. We've won numerous awards—including ten Lucy Moses preservation awards—as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", " \n", "\nAbsolutely. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer applications that integrate construction drawings, specifications, cost estimating, scheduling, and construction administration; advanced photography and image processing; and state-of-the-art, non-destructive diagnostic equipment and techniques. In fact, we have an in-house studio dedicated to such supporting technology, constantly developing new digital tools (think James Bond’s “Q”). ", "   .\n\n", " ", "\nHonestly, we offer aspects of both. You’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This gives you the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. ", " \n", "\nYou’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n", "\nAn array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks. ", " \n", " ", "\nWe embrace all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. ", " \n", "\n\nWe offer an array of benefits and growth opportunities:", "\n", "\n", "\n", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away.", "\n\n", "\n\nSend us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or a link to your portfolio that demonstrates your experience and capabilities. We look forward to meeting you! ", "\n\nPlease note that, due to the high number of applicants, we can only contact candidates under consideration. ", "  \n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-23 23:11", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-construction-site-supervisor/6963436860.html", "text": "Construction Site Supervisor/Manager", "compensation": "Please respond with asking starting Salary in Oybek", "type": "full-time", "images": [], "address": ["\n        ", "\nA dynamic, growth-oriented construction company G.C. serving the NYC metro market.", "\n", "\nPOSITION SUMMARY: ", "\nSite Super with strong technical skills who can support the job and PM with expert advice about execution of all trades. Must be able to communicate with clients, as well workers. All site related coordination and scheduling.", "\n", "\nESSENTIAL ROLES and RESPONSIBILITIES", "\n•\tCareful review plans and specifications and comment", "\n•\tReview Contract and comment", "\n•\tAssist in bidding process ", "\n•\tNegotiate with vendors, suppliers, and subcontractors", "\n•\tProcurement ", "\n•\tIdentify long lead time items, order materials, protect site, layout, provide take-offs", "\n•\tOverseeing Subcontractors", "\n•\tCreation and enforcement of project schedules to facilitate on-time completion", "\n•\tCoordination of Architects and Engineers ", "\n•\tMaintain strong working relationships with all professional groups (Architects, Engineers, Clients, and Subcontractors)", "\n•\tCoordinate sign-offs and inspections, make sure all project participants are on the same page and aware of the project status and responsibilities", "\n•\tReview Maintenance of building during construction", "\n•\tDevelop Internal RFI/questions ", "\n•\tProcess change orders", "\n•\tSchedule crew and subs, review subs P.O.'s ", "\n•\tReceive and review subcontractors Daily Reports of work done and labor and material employed. ", "\n•\tMaintain daily work logs and sign in/out sheets and verify that workers have the necessary union affiliations and safety training. ", "\n•\tSupervise daily project activities including but not limited to supervision of laborers, subcontractors and vendors.", "\n•\tAssist Project Manager in reviewing and approving the Subcontractor's monthly requests for payment. ", "\n•\tConduct weekly coordination meetings and monthly safety meetings with subcontractors and prepare meeting minutes.", "\n•\tHold weekly toolbox and safety meetings", "\n•\tReview Shop Drawings and schedules, take and submit meeting minutes, suggest agenda items", "\n•\tReview site and project plan with PM, prepare job status report", "\n•\tPlan and review construction Program with Project Manager including quality control procedures, work scheduling, safety and security practices.", "\n•\tEnsure that all required permits or licenses have been obtained", "\n•\tMust have knowledge of construction safety practices, codes and related issues", "\n- Provide leadership to Site Staff and Trades", "\n- Read and completely understand Construction Docs/Specifications in their entirety", "\n- Manage Day-to-Day and weekly Site Labor/Trades work", "\n- Assist in coordination of job schedule and creating sub-contractor schedules to ensure job is completed on-time and within budget", "\n- Paperwork management to keep submittal, drawings, and other pertinent project information in order", "\n- Prepare and keep daily reports / upload job site photographs in the computer software program documenting each day's activities", "\n- Generate 2 week look ahead according to the Construction Schedule and maintaining of deadlines/milestones. Important as it may indicate potential delays of project.", "\n- Keep Record of Daily Site Labor/Trade, Hours on site and task completion", "\n- Receive and inventory deliveries (Submit Bills of Lading to PM's/APM's)", "\n- Ensure that short term project delivery/completion dates are maintained. If not then communicate with PM/APM as to why expected dates are not being met", "\n- Coordinate and communicate between trades/subcontractors to alleviate conflicts", "\n- Maintain site safety/ perform weekly toolbox talks in regards to safe working habits", "\n- Perform Quality Control on workmanship/materials/equipment", "\n- Ensure proper site housekeeping/organization is maintained", "\n- Ensure equipment/materials/fixtures are properly and securely stored to avoid damage, loss and theft", "\n- Generate/Receive emails with PM's/APM's/Trades/Subcontractors/Suppliers", "\n- Review and Approve all Trade Work Tickets if changes occur on site", "\n- Generate material lists for ordering for site labor in a timely fashion and prior to actually needing on-site to perform work.", "\n- Generate incident reports, if accident occurs and notify partners immediately", "\n", "\nJob Type: Full-time", "\n", "\nEDUCATION, EXPERIENCE AND SKILLS REQUIRED", "\nFive (5)+ years industry experience (Commercial & Residential)", "\nMust be hands on manager with excellent people skills as well as excellent written and verbal communication skills", "\nKnowledge of industry and OSHA safety requirements", "\nAble to read blueprints", "\nDaily Reports, weekly, project meetings", "\nSubcontractor day to day monitoring", "\nSubmittal process, RFI process", "\nSkilled in multi-trade understandings", "\nExcellent Computer Skills, MS Office suite of products, Dropbox, Adobe, etc.", "\nSuccessful completion of in-house training", "\nAble to work at a desk when necessary as well as strap on a tool belt when required", "\n", "\nExperience:", "\nSuperintendent: 10 years (Required)", "\nConstruction: 10 years (Required)", "\nLicense:", "\n4 Hour Scaffold (Preferred)", "\n30 Hour OSHA (Required)", "\nDriver's License (Required)", "\n", "\nPlease respond with asking starting Salary in Oybek.", "\nPrincipals only. Recruiters, please don't contact this job poster.", "\ndo NOT contact us with unsolicited services or offers    "]},
{"date": "2019-08-24 11:02", "link": "https://newyork.craigslist.org/que/egr/d/bayside-architect-senior-intermediate/6963626629.html", "text": "ARCHITECT Senior/ Intermediate/ Junior", "compensation": "$20-$30 based on experience/knowledge", "type": "full-time", "images": [], "address": ["\n        ", "\nMin. proven 3 year architectural drawing experience ", "\nDrawings using autocad,", "\nUnderstanding NYC zoning regulation/ bldg code, ", "\nPermit applications and other required forms.", "\n", "\nLegal documents for employment in US.", "\nBA/BS in Architecture required.", "\n", "\nEnglish Communication skill req'd.", "\nFull time, Cover letter with Expected Salary.    "]},
{"date": "2019-08-26 10:23", "link": "https://newyork.craigslist.org/fct/egr/d/fairfield-project-engineer-fairfield/6964885260.html", "text": "Project Engineer (Fairfield)", "compensation": "Based on Experience", "type": "full-time", "images": [], "address": ["\n        ", "\nBaggage Handling Systems design consulting firm has an immediate need for a Project Engineer in our Connecticut office. ", "\n", "\nOur firm, BNP Associates, Inc. specializes in the design of automated baggage handling and screening, parcel, cargo and apron systems for airports throughout the world. We are the market leader in all of these fields and our employees are respected industry leaders. We are seeking the best of the best to help us grow and excel.", "\n", "\nMechanical engineering, architectural engineering, or a construction management background is preferred, however, civil, industrial and electrical engineers may be considered with relevant knowledge or experience. ", "\n", "\nBNP Associates, Inc. specializes in the design of automated baggage handling and screening, parcel, cargo and apron systems for airports throughout the world. The position will be based out of the Tampa office; however, travel will be required so the ability and willingness to do so is a must. ", "\n", "\nThis engineering position will provide the successful candidate with a broad array of opportunities to utilize their talents. We are seeking an individual who has considerable attention to detail and will contribute to our team of airport system consultants in project roles from the preparation of design and specification documents, cost estimating, project management through on-site installation and commissioning efforts. Excellent written and verbal communication skills are required. We utilize the latest software package technology in our design efforts, including recent releases of AutoCAD, Revit, AutoMod, PathPlanner, and Microsoft Office suite of programs, so experience in any of these would be beneficial.", "\n", "\nWe are looking for a local candidate, and as such, no relocation package is being offered for this position. ", "\n", "\nProjects that the successful candidate will participate in will require federal background checks and drug screening. We are an equal opportunity employer. We offer an excellent benefits package and competitive salaries, along with professional advancement opportunities. ", "\n", "\nIf you are seeking a rewarding career that provides you the opportunity to become a significant contributor in the fast paced, dynamic environment of airport systems design, please send your cover letter, resume, and a list of references to bnphq@bnpassociates.com", "\n    "]},
{"date": "2019-08-26 11:25", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-project-manager-for-busy/6964940143.html", "text": "Project Manager for Busy Design-to-Build Reno Co.", "compensation": "75k-125k DOE", "type": "full-time", "images": [], "address": ["\n        ", "\nBusy Design-to Build renovation company looking for mid to upper level project manager.", "\nMUST be able to oversee jobs throughout NYC, supervise, and report to CEO.", "\nMUST have experience performing alterations in Co-ops, Condos, and houses.", "\nMUST be college grad.", "\nAble to start immediately.    "]},
{"date": "2019-08-26 16:46", "link": "https://newyork.craigslist.org/que/egr/d/astoria-mid-level-architect-8-to-10/6965250255.html", "text": "Mid-Level Architect: 8 to 10 Years of Experience", "compensation": "Competitive", "type": "full-time", "images": [], "address": ["\n        ", "\nSeeking Mid-Level Architect with 8+ years of experience in all phases of design including Schematic Design, Design Development, Construction Documents and a strong background in Construction Administration. The candidate should have the following:", "\n", "\n•\tMust have strong background in Construction Administration", "\n•\tAbility to independently review submittals, respond to RFIs, and issue bulletins", "\n•\tLicensure in New York State is preferred", "\n•\tBachelor’s or Master’s degree in Architecture", "\n•\tProficiency in AutoCAD 2014 or later with BIM experience a plus", "\n•\tAbility to coordinate the work of a multi-disciplinary team", "\n•\tSelf-motivation and the ability to work independently", "\n•\tExperience with Microsoft Office (Word, Excel, PowerPoint) and other graphic / design software including the Adobe Design Suite", "\n", "\nPreferred project experience includes K-12 schools, higher-education projects, and design of large-scale public projects (transit stations, convention centers, and similar).", "\n", "\nExperience and interest in sustainable design/documentation and LEED is strongly encouraged, with applicable accreditations preferred.", "\n", "\nFor application requirements and submission instructions, see the link below:", "\n", "\n", "\n", "\ndi Domenico + Partners, LLP is an equal opportunity employer. The firm offers a full benefits package including health insurance, dental and vision insurance, and 401(k) retirement plan.", "\n    "]},
{"date": "2019-08-26 23:34", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-dob-filing-representative/6965492876.html", "text": "DOB Filing Representative- Freelance", "compensation": "TBD", "type": "contract", "images": [], "address": ["\n        ", "\nJob Description", "\nFiling Representative needed to file DOB Architectural filing set and certificate of correction in Manhattan NY.", "\n", "\nMust have Class 1 or 2 Filing Representative License.", "\n", "\nRESPONSIBILITIES:", "\n", "\nDOB (Department of Buildings)", "\n", "\n1. Pre-filing and E-filing for job filings (ALT 1, 2, 3, Demo, PA)", "\n2. DOB Now Build", "\n3. DOB Now Safety", "\n4. DOB Now Inspections:", "\nSchedule Construction, Plumbing, Electrical inspections", "\nDelegate pertinent parties", "\nDownload Pass - Final Reports and submit for sign-off", "\nUpload corrections for certifiable objections", "\n5. DOB Permits PW 1, PW 2, PW 3, PW4, After hour variances", "\n6. Site Safety Plans", "\n7. Records Room research: microfilm, block and lot, folder", "\n8. Post Approval Amendments", "\n9. Violations (AEU2, AEU20, Dismissals, Waivers)", "\n10. Stop Work Orders, Partial Stop Work Orders", "\n11. Obtain New DOB Tracking Number for Contractors and insurance updates", "\n12. Required Items submission", "\n13. Letter of Completions", "\n14. Temporary and Final Certificates of Occupancy", "\n15. Schedule and attend Plan Examiner appointments to obtain approvals", "\n16. Attend Chief Plan's examiners meetings with Architects, Engineers, Developers, Property Managers", "\n17. Attend meetings with Deputy Borough Commissioners", "\nDOT (Department of Transportation)", "\n", "\n1. DOT Permits: Sidewalk, Fire Hydrant, Curb Cut", "\nECB (Environmental Control Board)", "\n1. Attend ECB hearings", "\n2. Process penalty payments", "\n", "\nTOPO (Topographical Bureau)", "\n", "\n1. Street Address Verification", "\nDOF (Department of Finance)", "\n", "\n1. Tax Maps", "\n", "\nFDNY (Fire Department of the city of New York)", "\n", "\n1. Submit applications", "\n2. Obtain Building Profiles, Notices of Violation and Violation Orders", "\n3. Attend appointments", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-26 14:45", "link": "https://newyork.craigslist.org/brk/egr/d/architectural-intern-administrative/6965140411.html", "text": "Architectural Intern / Administrative assistant", "compensation": "Competitive compensation based on skills/experience", "type": "full-time", "images": [], "address": ["\n        ", "\nBrooklyn Architectural firm seeks:", "\nfull-time position for Architectural Intern / Administrative assistant", "\n", "\n", "\nSkills: ", "\nProfessional & motivated attitude", "\nWritten and communication skills ", "\nStandard Microsoft office suite familiarity", "\nArchitectural background", "\nFamiliarity with NYC Department of Buildings", "\n", "\nResponsibilities include:", "\nWritten reports / Paperwork ", "\nClient correspondence, etc.", "\n", "\nCompetitive compensation based on skills/experience", "\n", "\nJob seeker to live within 20 miles of 11219 Zip code.    "]},
{"date": "2019-08-26 23:42", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-nyc-dob-architect/6965495303.html", "text": "NYC DOB_ Architect _ Architectural Services- filing set_ Freelancer", "compensation": "TBD", "type": "full-time", "images": [], "address": ["\n        ", "\nArchitectural Services- filing set_ Architect_ Freelancer\\Independent Contractor", "\n", "\nWe are seeking an Architectural Associate/CAD drafter to create NYC DOB filing sets for commercial renovations, specifically Restaurant projects primarily in Manhattan.", "\n", "\nRESPONSIBILITIES:", "\n• Survey existing and as-built conditions on sites located throughout the NYC area", "\n• Create Architectural Drawings and Construction Documents (Alteration Type 1 and Type 2)", "\n• Zoning Analysis and Diagrams", "\n• Drawing existing and proposed sections and elevations", "\n• Update drawing sets based on NYC Plan Examiner Objections", "\n• Prepare DOB filing set packages and coordinate with Expediter to file with Department of Buildings.", "\n", "\nPosition is an independent contractor/ freelancer    "]},
{"date": "2019-08-27 11:34", "link": "https://newyork.craigslist.org/brk/egr/d/junior-intermediate-architect-expediter/6965717468.html", "text": "Junior / Intermediate Architect / Expediter", "compensation": ".", "type": "full-time", "images": [], "address": ["\n        ", "\nArchitectural/design firm is looking for a Junior / Intermediate Architect for full time position.  The firm specializes in Commercial, Mid sized residential buildings and in high-end residential single family homes. We are very detail oriented and work with a select few clientele base.", "\nCandidate should possess the following qualifications:", "\nMust be proficient in AutoCad, have good verbal skills, be a team player and be willing to work on projects from inception to completion.  ", "\n", "\nPosition:", "\nApplicant will be working on all phases of a project from the design phase through the production of a complete set of construction documents/construction administration under the direct supervision of the Architect. Our belief is to expose individuals to all aspects of architecture as to increase their worth and knowledge within the firm.    "]},
{"date": "2019-08-27 13:13", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-jr-associate-architect8-month/6965811746.html", "text": "Jr. Associate Architect.....8 month project....NYC", "compensation": "28.00 - 35.00 per hour", "type": "contract", "images": [], "address": ["\n        ", "\nAssociate Architect must have a minimum of five (5) years of experience. The ideal candidate will have an Architectural degree, and experience with government projects, especially in K-12 public schools and public housing. Knowledge of interior building surfaces and materials.  He or she will have experience with building condition assessments inspections and generating computer-based reports.    "]},
{"date": "2019-08-27 11:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect/6965730490.html", "text": "Architect", "compensation": "open - depending of experience", "type": "full-time", "images": [], "address": ["\n        ", "\nArchitect ", "\n", "\nEME Consulting Engineering Group (EME)—one of New York City’s leading professional firms dedicated to energy efficiency, existing building design and sustainability—is seeking a degreed architect with 1–3 years of experience providing architectural design service for fit-out and modifications to existing spaces for EME’s educational and healthcare clients. ", "\n", "\nThe position of Associate Architect will work alongside experienced senior architects providing support in design and field applications. Highly motivated individual with a strong work ethic and commitment to work in a team environment in the office as well as in the field. EME’s core business is the implementation of energy efficiency systems in existing buildings.  ", "\n", "\n•\tExperience with ADA and accessibility design requirements", "\n•\tKnowledge of NYC Building Code ", "\n•\tKnowledge of construction drawings and specifications", "\n•\tProficiency with AutoCAD and rendering tools", "\n", "\nThe position will provide considerable exposure to clients and requires excellent communication and project management skills. The position offers significant opportunity for advancement within EME's growing in-house architecture department. ", "\n", "\nEME is an equal opportunity employer, offering competitive salaries with a full benefits package. ", "\n", "\nFor immediate consideration, please email a cover letter, resume, and salary requirements", "\n", "\n", "\n", "\n    "]},
{"date": "2019-08-27 17:48", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect/6966054359.html", "text": "Project Architect", "compensation": "DOE", "type": "full-time", "images": [], "address": ["\n        ", "\nSmall Manhattan design driven architectural firm is seeking a highly motivated Architect / Project Manager to assist with multiple projects, including new construction and gut renovations for commercial and residential projects.", "\n", "\nQualifications:", "\n-\tArchitecture degree required", "\n-\tMust have minimum  of 10 years experience in U.S. based offices", "\n-\tExperience with code research, zoning research and product research", "\n-\tCoordination of Architectural and Engineering Documents", "\n-\tConsultant Coordination", "\n-\tDesigning, drawing, and development of Architectural Plans, Elevations, and Details", "\n-\tExperience doing field surveys and as-built drawings", "\n-\tKnowledge of Mechanical, Electrical, and Plumbing Systems", "\n-\tTime Management and organizational skills", "\n-\tExcellent written and communication", "\n-\tProficient in AutoCAD, Microsoft Office, and Adobe", "\n", "\nPlease Provide resume, portfolio, and salary requirements.", "\n    "]},
{"date": "2019-08-28 11:34", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-architect/6966462955.html", "text": "Architect", "compensation": "$40,000 - $70,000 (Depending On Experience)", "type": "full-time", "images": [], "address": ["\n        ", "\nArchitect", "\n", "\nSmall Manhattan Design Firm Seeks Architect with 3 - 5 Years Experience in High End Residential (Apartments and Townhouses). License not required", "\n", "\nThe position of Architect will work alongside experienced senior architects providing support in design and field applications. Highly motivated individual with a strong work ethic and commitment to work in a team environment in the office as well as in the field. ", "\n", "\n• Experience with townhouse design ", "\n• Knowledge of NYC Building Code and Landmarks requirement", "\n• Knowledge of construction drawings and specifications", "\n• Proficiency with vectorworks design program (6 months minimum) and Mac computers", "\n", "\nThe position will provide considerable exposure to clients and requires excellent communication and project management skills. ", "\n", "\nWilliam Leeds Architect is an equal opportunity employer and offers competitive salaries.", "\n", "\nFor immediate consideration, please email a cover letter, resume, and salary requirements", "\n    "]},
{"date": "2019-08-28 11:22", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-intermediate-architect/6966451697.html", "text": "Intermediate Architect", "compensation": "Competitive Salary", "type": "full-time", "images": [], "address": ["\n        ", "\nGF55 Partners (www.GF55.com) seeks a talented and motivated full time Intermediate Architect for its NYC Office. Enjoy a stimulating and challenging team work environment with a variety of significant projects.  The position requires strong design, analytical and communication skills to interact with colleagues, clients and consultants.  GF55 offers an environment where professional growth and development is encouraged.", "\nGF55 seeks excellence by a collaborative search for the best solution in the creation of architecture ", "\n", "\nSkills Required ", "\n•\tRevit, Cad, Sketchup, Photoshop, In Design and MS Office Suite", "\n•\tStrong Analytical skills, and good follow through ", "\n•\tAbility to collaborate and work independently ", "\n•\tBachelor's Degree in Architecture or higher", "\n•\tAuthorized to work in the US", "\n•\t1-3 years of relevant experience ", "\n", "\nCompensation commensurate with qualifications. GF55 pays a competitive salary with benefits. ", "\n", "\nInclude in your application:", "\n•\tCover Letter", "\n•\tResume ", "\n•\tWork Samples", "\n    "]},
{"date": "2019-08-27 21:23", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-architect-interior-design/6966186464.html", "text": "Architect/Interior Design Internship/Full Time Position", "compensation": "Competitive Salary, Insurance and Bonuses", "type": "full-time", "images": [], "address": ["\n        ", "\nBoutique Architecture and Interior Design firm specializing in high end residential projects looking to fill two positions.  Both Junior Designer and Administrative Assistant will work directly with the principals and can expect to participate in all aspects of the design process from concept to completion.  Both positions require individuals with outstanding personal and professional demeanor and communication skills.  Ideally, the Junior Designer has a Bachelor's Degree in Interior Design / Architecture and 1 - 2 years of professional experience.  AutoCad / Rendering skills are a must.   Our Administrative Assistant should have a minimum 1 -2 years relevant professional experience and thorough knowledge of QuickBooks.  Non-smokers only.  Dog lovers preferred.", "\n", "\nPlease send resume and salary requirements.    "]},
{"date": "2019-08-28 13:58", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-engineer-hotel/6966596105.html", "text": "ENGINEER (Hotel)", "compensation": "Competitive Package", "type": "full-time", "images": [], "address": ["\n        ", "\nWe are in search of a savvy, hands-on individual that can work independently.  Join our Team at the Residence Inn and Courtyard by Marriott Central Park, an Interstate Hotels and Resorts property.", "\n", "\nYou’re like the firefighter of Engineering. You’re always at the ready and first to respond when something goes wrong. You understand the urgency because guests expect and deserve a safe, comfortable environment and associate safety is critical. You’re alert and action-minded, with the technical skills and know-how to keep operations smoothly running. If this rings true, Interstate’s Class II Engineer position may be the perfect opportunity for you.", "\nAs an Engineer, you will", "\no\tBe ready and quick with your knowledge and experience to ensure guest safety and comfort, and a safe environment that’s critical to fellow associates.", "\no\tBe on top of preventive maintenance to protect every aspect of the property, from hotel rooms and equipment to kitchen and laundry.", "\no\tKeep operations running smoothly in the absence of engineering staff.", "\no\tRespond swiftly and effectively to every emergency situation that arises during your shift.", "\no\tHelp keep the mechanical areas safe, orderly, and clean and maintain legible, orderly records.", "\n", "\nFundamentals", "\nA high school diploma with special instruction in building maintenance and construction, having two years building experience in building maintenance or related industry, is required. The ability to maintain and repair HVAC, electrical, plumbing equipment and perform carpentry, repair work, construction and renovation work is expected. This position requires carrying a radio while on duty and may require operating a pick-up truck and snow removal equipment. You must have effective communication skills and a professional manner. This position requires complete mobility and the ability to lift at least 40 pounds.", "\n    "]},
{"date": "2019-08-28 15:03", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-part-time-architecture-work/6966654844.html", "text": "Part-time architecture work- must know Revit", "compensation": "TBD", "type": "part-time", "images": [], "address": ["\n        ", "\nSmall architecture firm looking for part-time, freelance employee for immediate hire. Must know Revit. All levels of experience are welcome. Working on small projects, renovations, and small new buildings. Send hourly rate, resume, and a few work samples. Find us at jorgefontan.com    "]},
{"date": "2019-08-28 15:34", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-solar-project-manager/6966681883.html", "text": "Solar Project Manager", "compensation": "Salary plus package includes 100% company medical insurance, and paid time off for holidays, vacations and sickness.", "type": "full-time", "images": [], "address": ["\n        ", "\nCome join one of the fastest growing Electrical Contractors in the New York area.  We offer great benefits, and career growth opportunity for the right candidate.", "\n ", "\nElectrical firm taking on a huge Solar Project, various locations across the state, seeks qualified PM to assist in managing numerous  projects.", "\nIn this role you will prepare work and manage crews for the installation of Solar energy.", "\n ", "\nREQUIREMENTS – If you are the ideal candidate, you will have:", "\n* Must have solar experience PV", "\n* Familiarity with New York City and New Jersey union labor rates", "\n* An understanding of construction and ability to visualize the requirements", "\n* An orderly mind with a tendency to be careful and accurate", "\n* Decisiveness and the ability to make decisions without being intimidated by detail", "\n* Fairness, honesty, and integrity", "\n* Patience to finish the project without frustration", "\n ", "\nRESPONSIBILITIES", "\n* Reading & understanding of bid documents: drawings, specifications & scope of work", "\n* Evaluating which materials and methods will be used on Solar jobs", "\n* Obtaining price quotes of equipment from various suppliers and analyzing the cost-effectiveness and specification compliance", "\n* Contributing to the team effort by accomplishing related results as needed", "\n", "\n    "]},
{"date": "2019-08-28 17:48", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-special-inspector-concrete/6966790395.html", "text": "Special Inspector (Concrete)", "compensation": "Competitive compensation based on skills/experience", "type": "full-time", "images": [], "address": ["\n        ", "\nBrooklyn based Class 1 special inspection firm seeking a Special Inspector.", "\n", "\nJOB FUNCTIONS", "\nThis position will be responsible for performing or witnessing special inspections on New York City construction projects, including mid to high rise buildings.", "\n", "\nCandidate will be required to prepare reports on inspection activities, file documentation and complete required technical report forms in accordance with New York City Construction Codes.", "\n", "\nQUALIFICATIONS:", "\nMust have \"ACI Concrete field testing technician\" certification.", "\n", "\nMust have one of the following certifications;", "\n-ICC reinforced concrete special inspector", "\nor", "\n-ACI concrete construction special inspector", "\n", "\nStrong oral and written communication skills; ability to communicate in English. Follow directions, and interpret engineering and construction plans.    "]},
{"date": "2019-08-29 07:39", "link": "https://newyork.craigslist.org/mnh/egr/d/autocad-pm-drafting-positions-for-site/6967040035.html", "text": "AutoCAD PM/Drafting Positions for Site Safety Plans", "compensation": "We offer a competitive salary (commensurate with experience), with paid vacation", "type": "full-time", "images": [], "address": ["\n        ", "\nPM/Drafting position - Safety design coordinator for a Major NYC Safety Consulting Company", "\nWe are looking for a full-time CAD PM/Draftsman to join our dynamic Production team. As a member of this fast-paced, cutting edge group you will work with architects, engineers and construction specialists to handle the drawing and graphic needs for industry leading developers and construction managers.", "\n", "\nKey Duties and Responsibilities:", "\nThe Safety Design Coordinator will work in a team overseeing project design, construction & project administration. ", "\n", "\nKnowledgeable of codes and regulations including NYC Building Code, NYC Fire Code & DOT regulations.", "\n", "\nProficient in reviewing DOB-BEST Squad objections and maintaining Building Code, the client's preferences, and design intent.", "\n", "\nMeet with New York City Department of Buildings Plan Examiners to review and obtain approvals of Site Safety Plans.", "\n", "\nGood drafting skills. Must be able to balance CAD drafting (For Site Safety Logistics Plans for Alterations, Facade Repairs & New Buildings), project management and coordination. ", "\n", "\nPerform Quality Assurance reviews of drawing sets.", "\n", "\nConduct site visits for field measurements and drawing research.", "\n", "\nDevelop and produce presentation materials, including plans, diagrams, details, etc", "\n", "\nCommunicate and follow up with clients about specific projects and their goals.", "\n", "\nPrepare daily & weekly reports.", "\n", "\n", "\n", "\nQualifications:", "\n1.\tBachelors Degree in Architecture, Civil engineering or closely related field preferred.", "\n2.\t2-5 years architectural design/CAD drafting work experience, minimum 1 year in Project Coordination, or Management.", "\n3.\tMust have EXCELLENT computer skills. Proficient in CAD software and/or AutoCAD experience is required. ", "\n        REVIT knowledge is a plus. Proficiency in Photoshop and/or illustrator, PowerPoint, Excel and Word is necessary as well.", "\n4.     Complex problem solving and decision-making skills.", "\n5.\tGood written and verbal communication skills", "\n6.\tMust be a team player and have the ability to effectively multi-task", "\n7.     Strong leadership, communication and relationship management skills.", "\n8.     Flexibility in a fast-paced changing environment. ", "\n9.     Working knowledge of NYC Building Code, Chapter 33 Safeguards During Construction or   Demolition as well as OSHA ", "\n        CFR 1926 Construction Safety and Health and NYC DOT", "\n", "\nWe offer a competitive salary (commensurate with experience), with paid vacation and benefits package.", "\nRecent college grads welcome to apply!", "\n    "]},
{"date": "2019-08-29 13:17", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-project-architect-commercial/6967270722.html", "text": "Project Architect | Commercial Architecture", "compensation": "Temporary to hire position. Hourly fee initially, then full time base salary, PTO plus full benefits package if hired.", "type": "full-time", "images": [], "address": ["\n        ", "\nTitle:", "\nProject Architect for Commercial Projects", "\n", "\nPosition Overview:", "\nQuality control, design oversight, coordination of all project disciplines, scheduling, budgeting, ensure code compliance.", "\n", "\nRequirements:", "\nProfessional degree in Architecture from an accredited university. ", "\n7-15 years of professional experience.", "\nRevit proficiency.", "\nProject leadership experience.", "\nExperience working on commercial projects.", "\n ", "\n    "]},
{"date": "2019-08-29 13:32", "link": "https://newyork.craigslist.org/fct/egr/d/landscape-designer-architect-landscape/6967283957.html", "text": "Landscape Designer/Architect - Landscape sales", "compensation": "Based on experience and skill. Excellent benefit program", "type": "full-time", "images": [], "address": ["\n        ", "\nElise Landscape Design Group", "\n", "\nLandscape Sales professional and landscape designer/architect to join our team. We design and build creative, integrated landscape plans for high-end residential clients.", "\n", "\nCandidates should have a proven record in residential landscape sales with the ability to present and communicate to a sophisticated client base. Autocad or equivalent software abilities a plus. Designing and selling landscapes with style for the high-end residential market key!", "\nApplicants with a landscape design background and exterior design are appropriate for this position.", "\n", "\nYou'll find us in New Canaan in an attractive work environment with an exceptional benefits, salary and retirement package.", "\n", "\nInterested candidates should forward resumes and letter of interest.", "\n", "\nThe Elise Design Group and Elise Landscapes & Nursery is an established award winning Landscape Design and Build firm serving the greater Fairfield and Westchester County areas. Our company provides high quality, innovative landscape design, construction and maintenance services as well as retailing landscape plantings, unique garden elements and furnishings.", "\n", "\nPosition Requirements:", "\nMinimum of 5 years, high-end residential landscape sales experience", "\nDegree in Landscape Design/Architecture/interior design preferred", "\nThe ability to present and communicate design concepts clearly to a sophisticated client base.", "\nProficiency with landscape design software and related office software", "\nGeneral knowledge of permitting and zoning processes", "\nDesire to grow professionally", "\n", "\n    "]},
{"date": "2019-08-29 17:53", "link": "https://newyork.craigslist.org/mnh/egr/d/new-york-city-class-2-expeditor/6967499998.html", "text": "Class 2 Expeditor", "compensation": "Based on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nSeeking class 2 licensed expeditor. Established firm, great location. Responsible, punctual, and effective. Salary negotiable based on experience.    "]},
{"date": "2019-08-29 19:20", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-ecb-vioaltion-and-demolitions/6967556941.html", "text": "ECB/Vioaltion and Demolitions expediter", "compensation": "Let me know how much you would like and show me what you can do.  VIOLATIONS AND DEMOS lets roll!", "type": "employee's choice", "images": [], "address": ["\n        ", "\nHello, I have a small/midish size office and looking to add to the team. I need an expediter who HAS KNOWLEDGE AND EXPERIENCE with ECB/FDNY/DOT violations.   You need to be able to work independently to make your own Certificate of corrections and attend court.  You will be responsible to follow up and organize your violations.  You have to be able to argue violations based on issuance and merit in court. ", "\n", "\nThe second part of your job is Demolitions.  I need you to deal with Demolitions including cutoffs, ordering pest control, submit plans to Best, organizing with the Engineer of record.  And occasionally dealing with Best regarding Stop work Orders. ", "\n", "\nIf you want to work and know how to work our team is looking for someone.  Please contact me. Position is only for work described above. All other positions are filled I need violations and Demolitions. I am not willing to teach I need someone who can handle the work.   We have the best laid back and fun office in the industry but you need to come in knowing this work I will not train but I will guide and offer full support staff. PART TIME CAN work as well. ", "\n", "\n    "]},
{"date": "2019-08-30 10:24", "link": "https://newyork.craigslist.org/lgi/egr/d/roslyn-heights-carpet-flooring-sales/6967824079.html", "text": "Carpet & Flooring Sales/Estimator", "compensation": "Based on Experience", "type": "full-time", "images": [], "address": ["\n        ", "\nEstablished Flooring Company located in long island is currently seeking a full-time Carpet & Flooring Sales/Estimator with a construction background.    "]},
{"date": "2019-08-30 14:55", "link": "https://newyork.craigslist.org/que/egr/d/queens-village-gc-construction/6968064520.html", "text": "GC Construction Assistant Project Manager", "compensation": "$21.00 per hour", "type": "full-time", "images": [], "address": ["\n        ", "\nA Queens Village-based mid-size General Contracting & Construction company specializing in remodeling residential homes is currently seeking a full-time Assistant Project Manager (APM) with experience in residential projects. The APM will work closely with a Project Manager handling anywhere from 3 to 5 projects at a given time. The APM should have high energy, demonstrate enthusiasm, sensible to time constraints and the ability to work with demanding architects and clients.", "\n", "\nJob responsibilities include, but are not limited to:", "\n-Attending weekly site meetings", "\n-Creating meeting minutes, daily logs, change orders, and requisitions", "\n-Coordinating client/architect meetings", "\n-Assisting PM to fall within project schedule and budget", "\n-Handling all RFIs and RFPs, submittals, and shop drawings", "\n-Handling project closeouts and punch list items", "\n-Processing paperwork for the NYC Dept. of Buildings ", "\n-Strong written/verbal skills", "\n", "\nAt least 2-3 years of experience. Knowledge in MS Projects, Word, Excel, and Outlook a must. Ability to read architectural plans also a must. Driver's license a plus. This position is an immediate start.", "\n    "]},
{"date": "2019-08-29 18:11", "link": "https://newyork.craigslist.org/que/egr/d/project-architects/6967512467.html", "text": "Project Architect(s)", "compensation": "Commensurate with Experience", "type": "full-time", "images": [], "address": ["\n        ", "\nMssa, a Small Successful 9-Person Architectural studio based in Queens is seeking Project Architect(s). Our projects include single-family residential, multifamily, and mixed-use hospitality projects. The studio offers an opportunity to be involved in all phases of the urban built environment from Design Development, Construction Documents, Consultant Coordination and City Approvals to Project Close up. The candidate shall be willing to work on a whole range of projects from small extensions to multifamily and hospitality.", "\n", "\nRequirements", "\n• BS or 5-year Professional degree in Architecture", "\n• Minimum 3 years US experience in an architecture office", "\n• Proven ability to produce Construction Documents", "\n• Working knowledge of NYC code and zoning regulations", "\n• Familiarity with DOB procedures a plus", "\n• Site visits and requisition review", "\n• Check submittals and respond to requests for information", "\n• Fluent with Autocad Architecture 2017/18", "\n• Revit 2017 Experience a plus", "\n• Strong work ethic ", "\n• Fluent English ", "\n", "\nPlease submit your resume including work samples with a particular emphasis on construction documents.", "\n    "]},
{"date": "2019-08-30 17:23", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-structural/6968185342.html", "text": "Facade / Building Envelope Structural Engineer", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled structural engineer with 5 to 6 years of building envelope restoration experience if licensed, and 7 to 10 years' experience if not licensed, to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-08-30 17:26", "link": "https://newyork.craigslist.org/mnh/egr/d/facade-building-envelope-architect/6968187363.html", "text": "Facade / Building Envelope Architect", "compensation": "Commensurate with experience", "type": "full-time", "images": [], "address": ["\n        ", "\n", " ", "\n", " , New York City's leading professional firm dedicated to the preservation of buildings and infrastructure, is seeking a resourceful, skilled architect with 2 to 5 years of building envelope restoration experience to join us in executing a growing slate of challenging projects.", " \n\nWe work on an array of building types, including courthouses, schools, universities, churches, and hospitals, and many of New York's most storied landmarks, from Trinity Church to Grand Central Terminal. Our work embraces all components of the building envelope and underlying structure—facades, roofs, windows, and plazas—and the full complement of materials, from historic terra-cotta to high-performance curtain walls. We’re proud to be an industry leader in crucial practice areas like Local Law 11 inspections and repairs. We've won numerous awards, as well as the loyalty of many of the premier public, corporate, and residential clients in the region. ", "\n\nYou’ll work as part of a small team assigned to projects based on synergies between project requirements and the capabilities of each team member. This arrangement offers employees the dual advantages of a small office experience coupled with access to the centralized resources of a larger firm. You'll be supported by some of the most sophisticated technology in the profession, including proprietary computer systems and applications, advanced photography and image processing, and state-of-the-art, non-destructive diagnostic equipment and techniques. ", "\n\nTypically, you’ll participate in all phases of a project from inception through completion: proposal, investigation, construction documents, bid negotiation, and construction administration. You'll have the opportunity to see your designs executed in the field and you'll take on greater responsibility and client management as soon as you are ready. ", "\n\nWe offer an array of benefits and growth opportunities: :", "\n", "\n\nOur light-filled Tribeca office is in a landmarked building with 16' high ceilings, 8' tall windows, and stunning views of Manhattan in three directions—not a bad place to spend the work day. We’re easily accessible via public transportation: the A, C, and E Canal Street station connects directly to our building’s lobby. The N, R, 1, and 6 lines are all just a few blocks away. ", "\n\nIf you’re excited about this opportunity, please send us your resume, a cover letter with salary requirements, and a few pages of attachments (maximum of 10MB, please) or link to your portfolio that demonstrates your experience and capabilities. ", "\n\nWith thanks for your interest, please note that only those candidates under consideration will be contacted. ", "\n\nFor additional information on our firm’s services, approach, and projects, visit ", "\n    "]},
{"date": "2019-09-01 07:37", "link": "https://newyork.craigslist.org/lgi/egr/d/melville-bookkeeper/6969065658.html", "text": "BOOKKEEPER", "compensation": "Salary", "type": "full-time", "images": [], "address": ["\n        ", "\nGeneral Contracting firm is looking or a full time bookkeeper. Candidates need to have a basic knowledge of accounting and quickbooks. Bachelor's degree is a plus, 3 years experience preferably in the construction industry.", "\nTo apply please send your resume and requirements.", "\n", "\n", "\n    "]},
{"date": "2019-08-30 18:23", "link": "https://newyork.craigslist.org/que/egr/d/architect-cad-with-project-management/6968226007.html", "text": "Architect CAD with Project Management duties", "compensation": "Based on experience", "type": "full-time", "images": [], "address": ["\n        ", "\nBusy Queens Architectural firm [www.ArchitectsStudioNY.com] seeking an Intermediate CAD Draftsperson with project mgmt duties for new mid-rise Residential/Commercial base buildings, alterations and Interior Renovation projects. ", "\n", "\nThe  individual will work directly with the Principal Architect to manage and administer each phase of the project, and coordinate incoming and outgoing information on a day-to day basis. ", "\n", "\nQualifications:", "\n-Knowledge in Construction Details", "\n-Knowledge of NYC Building Codes, NYC Zoning Ordinances", "\n-Full engagement of projects", "\n-Knowledge of NYC Zoning Resolution, NYC Building Codes, ADA Regulations", "\n-Able to work under pressure to meet deadlines", "\n-Primarily an office-based position but some travel required for project meeting and other related duties", "\n-Proficient drafting skills using AutoCAD, including layer management", "\n-Minimum 3 years of construction technical work experience ", "\n", "\n", "\nIdeal candidates are those looking for growth through long-term employment and must be able to work overtime when required. Firm offers health benefits and 401K participation opportunity.  PLEASE ANSWER ONLY IF YOU LIVE IN THE AREA (NYC) & CAN WORK LEGALLY IN THE U.S.", "\n", "\nEmail cover letter  and resume [in pdf format] with desired compensation to us with confidence. Any other format will not be viewed.  Please indicate CAD under subject line on email.", "\n", "\n    "]},
{"date": "2019-09-01 15:38", "link": "https://newyork.craigslist.org/brk/egr/d/brooklyn-intern-mechanical-engineer/6969330022.html", "text": "Intern Mechanical Engineer", "compensation": "Market", "type": "part-time", "images": [], "address": ["\n        ", "\nOpentrons makes robots for biologists. Currently, over 90% of biologists in the world run experiments with manual pipettes, moving tiny amounts of liquid from vial to vial by hand. By making robotics affordable and open, we can help all life-scientists easily execute and share their experiments. Opentrons’ robotics are in use in over 40 countries around the world and have been adopted by top-tier institutions like Stanford, Harvard, Merck, and Roche. ", "\n", "\nWe’re interested in candidates who are working toward a BA/BS in mechanical engineering with background/experience in  the following:", "\n•\tPrototyping processes : 3D printing, Laser cut", "\n•\tDesign for production methods", "\n•\tSolidWorks", "\n•\tPassionate about products", "\n    "]}
]